[
  {
    "surah": "1. Al-Fatiha",
    "posts": [
      {
        "reference": "Ayah 1: In the name of Allah, the Entirely Merciful, the Especially Merciful",
        "text": "• This opening phrase of the surah, also known as Tasmiyah, acknowledges Allah's name, seeking His guidance.\n• “Allah” is the unique and exclusive name for God, and \"Ar-Rahman\" (Entirely Merciful) and \"Ar-Raheem\" (Especially Merciful) highlight Allah’s universal and believer-specific mercy."
      },
      {
        "reference": "Ayah 2: [All] praise is [due] to Allah, Lord of the worlds",
        "text": "• This verse attributes all praise to Allah by recognizing Him as the ultimate source of all blessings. \n• It acknowledges Allah as the Lord of all worlds, highlighting His sovereignty over the entire creation, visible and invisible.\n• The verse implies that all praise-worthy actions are ultimately directed towards Allah, who is the originator and sustainer of all creation."
      },
      {
        "reference": "Ayah 3: The Entirely Merciful, the Especially Merciful",
        "text": "• It reiterates the themes of mercy introduced in the opening verse.\n• “Ar-Rahman” and “Ar-Raheem” are repeated to emphasize and deepen the understanding of Allah's profound and encompassing mercy.\n• This repetition serves as a reminder of Allah's mercy as a central theme in understanding His nature and relationship with His creation."
      },
      {
        "reference": "Ayah 4: Master of the Day of Judgement",
        "text": "• This verse acknowledges Allah's exclusive authority and mastery over the Day of Resurrection, a day of accountability for human deeds.\n• It highlights the concept of divine justice, where individuals will be rewarded or punished based on their actions, emphasizing the ultimate accountability in the Hereafter."
      },
      {
        "reference": "Ayah 5: It is You (Allah) we worship and You (Allah) we ask for help",
        "text": "• This ayah declares exclusive worship and obedience to Allah and rejects any form of polytheism or associating partners with Him.\n• It expresses complete reliance on Allah for help, acknowledging His authority over all matters and seeking His assistance in every aspect of life."
      },
      {
        "reference": "Ayah 6: Guide us to the straight path",
        "text": "• It’s a sincere plea for guidance to the straight path of Islam, symbolizing a righteous and upright way of life.\n• It requests continuous guidance from Allah until reaching the ultimate destination, which is the pleasure of Allah and admission to His paradise."
      },
      {
        "reference": "Ayah 7: The path of those upon whom You have bestowed favor",
        "text": "• This ayah teaches us to ask Allah to guide us on the path of those favored by Allah, including prophets, truthful individuals, martyrs, and the righteous.\n• By reciting it, we seek protection from the paths leading to divine anger and deviation, the path of those who knowingly rejected the truth or strayed from the right path."
      }
    ]
  },
  {
        "surah": "2. Al-Baqarah",
        "posts": [
          {
            "reference": "Ayat 1–20: Three Categories of People",
            "text": "• Introduces three categories of people based on their belief in Allah.\n• Describes those who seek guidance, believe in the unseen, and perform good deeds.\n• Highlights disbelievers who conceal guidance and undermine believers, lying to Allah and themselves."
          },
          {
            "reference": "Ayat 21–29: Proof of Belief in Allah and His Messenger",
            "text": "• Emphasizes the proof of belief in Allah and His Messenger.\n• Stresses the consequences of belief and disbelief, outlining destinies in Heaven or Hell.\n• Provides examples from creation, leaving no doubt about Allah's authority."
          },
          {
            "reference": "Ayat 30–39: Beginning of Humanity and Responsibility",
            "text": "• Explores the beginning of humanity's existence and the responsibility to be good stewards.\n• Introduces Iblis as the primary adversary and emphasizes the human ego.\n• Illustrates the impact of knowledge on rank and the struggle to follow guidance."
          },
          {
            "reference": "Ayat 40–50: Covenant with the Children of Israel",
            "text": "• Shifts focus to the Children of Israel, highlighting Allah's covenant with them.\n• Stresses the need for salvation from both worldly and spiritual oppression."
          },
          {
            "reference": "Ayat 51–66: Spiritual Oppression among Believing Communities",
            "text": "• Examines spiritual oppression among believing communities, starting with ingratitude.\n• Highlights ingratitude for the blessings of worship, food, land, and drink, leading to divine anger.\n• Addresses ingratitude for sacred rituals such as the Sabbath."
          },
          {
            "reference": "Ayat 67–80: Psychology of Ungratefulness",
            "text": "• Explores the psychology of ingratitude among the Children of Israel.\n• Highlights their excessive questioning to avoid religious responsibilities.\n• Describes how hearts can grow insensitive to the fear and awe of Allah.\n• Reveals intentional distortion of revelation, withholding information, and reliance on imagination instead of scripture."
          },
          {
            "reference": "Ayat 81–93: Nature of Covenants and Covenant Breaking",
            "text": "• Elaborates on the nature of Allah's covenants.\n• Illustrates examples of breaking covenants, including selective use of sacred laws, killing and lying about Messengers, rejecting divine assistance, and disregarding current revelations.\n• Warns against disobedience despite knowing the truth and claiming faith."
          },
          {
            "reference": "Ayat 94–101: Characteristics of Covenant-Breakers",
            "text": "• Reviews characteristics of those predisposed to breaking covenants.\n• Identifies individuals who prioritize the worldly life over the Hereafter, despise specific Messengers and angels, and abandon sacred laws knowingly."
          },
          {
            "reference": "Ayat 102–123: Sowing Discord and Jealousy",
            "text": "• Exposes jealousy in the hearts of people of other faiths.\n• Details how differences in words and revelation are used to sow discord in families and communities.\n• The consequences include uncertainty in faith and the ultimate goal of abandoning Islam."
          },
          {
            "reference": "Ayat 124–141: True Religious Stewardship – Story of Prophet Ibrahim (AS)",
            "text": "• Illustrates the correct blueprint for Prophetic stewardship through the story of Ibrahim.\n• Highlights prophet Ibrahim's (AS) actions, including building a Masjid (mosque), ensuring security and sustenance for the community, promoting intergenerational participation in worship, and establishing religious education and spiritual purification."
          },
          {
            "reference": "Ayat 142–162: Transition from Ancient History to Prophet Muhammad's (PBUH)",
            "text": "• Shifts from ancient history to the lifetime of Prophet Muhammad (PBUH).\n• Details the changing of the qiblah from Jerusalem to the Kaaba, addressing hypocrites' objections.\n• Highlights the significance of the qiblah in maintaining spiritual direction.\n• Clarifies the role of al-Safa and al-Marwah in Hajj and Umrah rites."
          },
          {
            "reference": "Ayat 163–176: Blindly Following Religion and Withholding Knowledge",
            "text": "• Warns against blindly following religion, allowing people to withhold and distort knowledge, leading to Hell.\n• Declares Allah as the only Creator and emphasizes worshiping Him alone to avoid being led astray.\n• Illustrates struggles in areas like dietary restrictions and warns against following those far from Allah's guidance."
          },
          {
            "reference": "Ayat 177–203: Righteousness Beyond Prayer",
            "text": "• Establishes the foundation of prayer and Divine authority in lawgiving.\n• Expands the concept of righteousness beyond prayer rules, encompassing charity, justice, inheritance, fasting in Ramadan, crescent moon sighting, avoiding unlawful wealth acquisition, conducting war, and performing Hajj."
          },
          {
            "reference": "Ayat 204–222: Righteousness in Interpersonal Relationships",
            "text": "• Explores the theme of righteousness in interpersonal relationships.\n• Reminds of the fate of the Children of Israel and the misuse of knowledge for dominance.\n• Addresses questions about charity, fighting during sacred months, gambling, alcohol, caring for orphans, and laws of menstruation."
          },
          {
            "reference": "Ayat 223–242: Extension of Menstruation Topic",
            "text": "• Extends the discussion on menstruation's impact on marriage and divorce.\n• Details treatment of women in marriage, divorce rules, and regulations of the waiting period (Iddah).\n• Covers guidelines for widows, respecting women during the waiting period, and the rights of the mother regarding breastfeeding and child support."
          },
          {
            "reference": "Ayat 243–252: Narration of Stories on Human Interaction with Prophets (AS)",
            "text": "• Shifts to narrating stories illustrating how humans interact with Prophets and guidance.\n• Relays the story of people fleeing from Allah's decree and facing consequences.\n• Describes the Children of Israel seeking help from Allah and their response to King Talut."
          },
          {
            "reference": "Ayat 253–260: Unity of Messengers and Acceptance of Hierarchy",
            "text": "• Continues the theme of Messengers, emphasizing their equality as Allah's chosen and their hierarchy based on divine favors.\n• Reminds that Messengers were facilitators to submit to Allah's guidance, not obstacles hindering submission to Prophet Muhammad (PBUH).\n• Emphasizes Allah's ultimate power and guidance, introducing Ayat al-Kursi to stress His supremacy."
          },
          {
            "reference": "Ayat 261–262: Wealth and Its Impact on Belief",
            "text": "• Shifts the discussion to wealth, reiterating how people may compromise their religion for material gain.\n• Highlights that downfall often results from failing to understand Allah's control over wealth.\n• Emphasizes that Allah determines the granting and restricting of wealth."
          },
          {
            "reference": "Ayat 263–274: Charity and Blessings",
            "text": "• Discusses giving charity as a means of increasing wealth, emphasizing sincere intentions for blessings.\n• Warns against giving unnecessary items for charity due to fear of poverty, tracing such thinking to the devil's influence.\n• Outlines the best ways to give charity for spiritual elevation and identifies the most blessed recipients."
          },
          {
            "reference": "Ayat 275–283: Interest and its Spiritual Effects",
            "text": "• Interest is portrayed as the single greatest method of destroying wealth and spirit.\n• Highlights the importance of Divine guidance in understanding the consequences of financial decisions.\n• Addresses the importance of proper documentation, witnesses, protections for scribes and witnesses, and the option of collateral."
          },
          {
            "reference": "Ayat 284–286: Closing of Surah Al-Baqarah",
            "text": "• A conclusion of Surah Al-Baqarah, summarizing the lessons from past communities, delivered laws, and explanations of correct belief.\n• Reminds of accountability and instructs a supplication for ease and compassion in fulfilling obligations to Allah."
            }
          ]
        },
        {
          "surah": "3. Al-Imran",
          "posts": [
            {
              "reference": "Ayat 1–9: Establishing Belief in Allah's Attributes",
              "text": "• Affirmation of Allah's perfect attributes and revealed scriptures.\n• Warning against interpreting ambiguous verses to build theology.\n• Emphasis on interpreting Allah's words based on clear and unambiguous verses."
            },
            {
              "reference": "Ayat 10–22: Success through Belief and Consequences of Disbelief",
              "text": "• Success through faith in Allah.\n• Examples of the Pharaoh and the Battle of Badr.\n• Material power is defeated by the power of faith.\n• The allure of worldly pleasures compared to the pleasures of the Hereafter.\n• Characteristics and beliefs of true believers."
            },
            {
              "reference": "Ayat 23–32: People of the Book and Accountability",
              "text": "• Addressing the People of the Book and their avoidance of accountability.\n• Lack of faith in their own scripture.\n• Control of power by Allah and the consequences of following disbelievers.\n• Following the Prophet Muhammad (PBUH) as obedience to Allah."
            },
            {
              "reference": "Ayat 33–63: Clarification of Prophetic Lineages and Challenges to Theology",
              "text": "• Clarifying the family of 'Imran and the story of Maryam (RA), Zakariyya (AS), and the miracles of 'Isa (AS).\n• Detailed evidence of 'Isa's (AS) story, challenging the people of Najran.\n• Emphasizing the truth and exposing the lack of confidence in opposing beliefs."
            },
            {
              "reference": "Ayat 64–83: Dawah to the People of the Book and Exposing Hypocrisy",
              "text": "• Encouraging Muslims to find common ground with the People of the Book.\n• Addressing Christians directly, enjoining them to follow sound knowledge.\n• Questioning their reluctance to accept Allah's signs.\n• Exposing hypocrisy and plots to mislead believers."
            },
            {
              "reference": "Ayat 84–91: Adherence to Islam and Avoiding Paths Away from Guidance",
              "text": "• Command to adhere to the religion of submission to Allah (Islam).\n• Explicit expression of the consequences for those persisting in oppression and darkness.\n• Salvation and regret for those who meet Allah in a state of disbelief.\n• The opportunity for rectification and righteousness in this world."
            },
            {
              "reference": "Ayat 92–99: Learning from the Experience of the Children of Israel",
              "text": "• Directing the People of the Book to learn from the Children of Israel's experience.\n• Contrasting the ways of the Children of Israel with the path of Prophet Ibrahim.\n• Rhetorical question about rejecting signs and preventing people from the correct path."
            },
            {
              "reference": "Ayat 100–120: Warning Against Obedience to Certain Factions, Unity, and Taqwa",
              "text": "• Warning against obeying specific factions of the People of the Book.\n• Command to hold fast to the Quran as a united community.\n• Unity and solidarity among believers for resilience against disbelievers.\n• Example of the Battle of Badr, victory through Allah's support and protection."
            },
            {
              "reference": "Ayat 121–148: Avoiding Pitfalls and Lessons from the Past",
              "text": "• Warning against falling into the pitfalls of faith communities that preceded the believers.\n• Prohibition of dealing in interest, emphasizing its gravity.\n• Charity, forgiving, and seeking forgiveness for attaining Paradise.\n• Foreshadowing the topic of Uhud and the eventual death of the Prophet Muhammad (PBUH)."
            },
            {
              "reference": "Ayat 149–171: Lessons from the Battle of Uhud",
              "text": "• Warning against being led astray by disbelievers and relying on Allah as the Savior.\n• Lessons from the Battle of Uhud.\n• Ultimate reward for those who sacrifice and die for Allah, looking forward to the Hereafter."
            },
            {
              "reference": "Ayat 172–180: Perceived Defeat and Success in This World",
              "text": "• Addressing the perceived defeat of believers in death as actual success.\n• Martyrdom as the ultimate sacrifice and obedience to the Messenger, leading to superior reward.\n• Contrasting disbelievers' perceived success with extensive comfort and enjoyment in this world."
            },
            {
              "reference": "Ayat 181–200: Expectations from Disbelievers and True Believers' Devotion",
              "text": "• Addressing the unreasonableness of believers seeking to appease the People of the Book.\n• Disapproval and verbal abuse from those who betrayed their religion for worldly gain.\n• Sincere devotion leading to Allah answering their prayers and rewarding them for struggles with something greater than temporary comforts."
            }
          ]
        },
        {
          "surah": "4. An-Nisa",
          "posts": [
            {
              "reference": "Ayat 1–23: Family Dynamics and Rights",
              "text": "• Familial relationships are sacred bonds.\n• Emphasis on the rights of women and children.\n• Detailed guidelines on inheritance.\n• Protection from slander for women.\n• Repentance and forgiveness for sexual deviance.\n• Abolishment of oppressive practices like forced marriages and usurping women's wealth.\n• Prohibition of incestuous marriages with specific clarifications."
            },
            {
              "reference": "Ayat 24–32: Sanctity of Women and Financial Rights",
              "text": "• Establishment of women's right to dowries.\n• Dignified and public marriage ceremonies.\n• Repentance for those who violate sanctity.\n• Prohibition of usurping anyone's wealth.\n• Discouragement of envy and understanding individual shares.\n• Application to family relationships and inheritance issues."
            },
            {
              "reference": "Ayat 33–57: Safeguarding the Sanctity of Allah's Word",
              "text": "• Instructions on avoiding alcohol, especially during prayers.\n• Preservation of sanctity in prayer spaces (masjids).\n• Warning against distorting Allah's Word, drawing from the People of the Book's example.\n• Curse for those who distort their scriptures.\n• Polytheism is an unforgivable sin.\n• Lies about Allah lead to a specific punishment.\n• Believers promised the greatest reward."
            },
            {
              "reference": "Ayat 58–70: Governance and Belief",
              "text": "• Strive to govern according to the Quran's guidelines.\n• Example of People of the Book abandoning Allah's governance.\n• Belief is tied to obeying Prophet Muhammad.\n• Actions, in Allah's service, are in the believers' best interest."
            },
            {
              "reference": "Ayat 71–86: Warfare for Protection",
              "text": "• Warfare legislated to protect vulnerable rights.\n• Fighting for Allah's religion prevails over fighting for falsehood.\n• Death is inevitable; cowardice is counterproductive.\n• Obedience to the Messenger is obedience to Allah.\n• Encouragement to fight for salvation against enemies."
            },
            {
              "reference": "Ayat 87–94: Regulation of Warfare",
              "text": "• Distinction between clear enemies and those seeking peace.\n• Believers must not fight against other believers.\n• Compensation for accidental killings outlined.\n• Severe consequences for intentionally murdering a believer."
            },
            {
              "reference": "Ayat 95–104: Status of Fighters and Migrants",
              "text": "• Distinction between ranks of fighters and those who stay behind.\n• Assurance for suppressed individuals who cannot fight.\n• Good tidings for those who migrate for religious freedom.\n• Modification of prayers for fighters and travelers."
            },
            {
              "reference": "Ayat 105–126: Hypocrites Among the Ranks",
              "text": "• Hypocrites are not clear enemies but must be tolerated.\n• Allah's protection against hypocrites' schemes.\n• Hope for forgiveness for repentant hypocrites.\n• Plots against the Prophet and believers have no benefit.\n• Those who follow the Prophet are destined for bliss."
            },
            {
              "reference": "Ayat 127–130: Women's Protection in Marital Affairs",
              "text": "• Women have self-determination in marital affairs.\n• Measures to protect women from neglect and abuse.\n• Liberation from societal pressure to stay in harmful relationships."
            },
            {
              "reference": "Ayat 131–147: Adhering to Divine Guidance for Self-Preservation",
              "text": "• Importance of adhering to Divine guidance.\n• Warning against the obsession with material gain over the Hereafter.\n• Recognition of hypocrisy and self-accountability.\n• Signs of hypocrisy are described, emphasizing repentance."
            },
            {
              "reference": "Ayat 148–161: Responding to Harm and Infractions",
              "text": "• Caution against harmful speech and encouragement for forgiveness.\n• Historical context of Children of Israel's disbelief despite signs.\n• Understanding the futility of new signs for those determined in disbelief."
            },
            {
              "reference": "Ayat 162–176: Sufficient Evidence and Correct Belief",
              "text": "• The Quran as sufficient evidence for the authenticity of the Prophet.\n• Affirming the unity of messages from all previous Prophets.\n• Disbelieving in Prophet Muhammad is akin to disbelieving in all Prophets.\n• Correct belief in 'Isa and performing righteous deeds as requirements for reward."
            }
          ]
        },
        {
          "surah": "5. Al-Ma’idah",
          "posts": [
            {
              "reference": "Ayat 1–5: Laws and Food Regulations",
              "text": "• Allah outlines forbidden foods and hunting regulations, akin to forbidden relationships in Surah al-Nisa'.\n• Specifics on hunting during Hajj and lawful slaughter by the People of the Book are highlighted.\n• This underscores the importance of lawful consumption and adherence to divine rules."
            },
            {
              "reference": "Ayat 6–16: Covenant and Warning",
              "text": "• Allah addresses believers, emphasizing worship and purification instructions.\n• He warns against neglecting the covenant, drawing parallels with the past disobedience of the Children of Israel and Christians.\n• Prophet Muhammad's guidance is highlighted as pivotal for rectifying past mistakes."
            },
            {
              "reference": "Ayat 17–26: Broken Covenants",
              "text": "• Allah illustrates how the People of the Book, both Jews and Christians, deviated despite claiming Allah's love.\n• Their distortions and refusals to obey are highlighted, leading to the withholding of blessings.\n• The lesson emphasizes the importance of preserving theology and making necessary sacrifices for divine guidance."
            },
            {
              "reference": "Ayat 27–40: Examples of Failure",
              "text": "• The story of Qabil and Habil demonstrates the consequences of unrepentant rebellion and murder.\n• Allah sets examples for deterring crimes like murder and theft, aiming to break cycles of violence and wrongdoing.\n• This section underscores the importance of justice and deterrence in maintaining societal order."
            },
            {
              "reference": "Ayat 41–57: Abandonment of Guidance and Hypocrisy",
              "text": "• Allah illustrates how abandoning guidance is linked to consumption and production, emphasizing the significance of food laws.\n• Hypocrites, paralleled with the Children of Israel, consume unlawful matter leading to disbelief and false actions.\n• The abandonment of religious laws by the Children of Israel and Christians serves as a warning."
            },
            {
              "reference": "Ayat 58–71: Futility of Following Hypocrisy",
              "text": "• Hypocrites, mimicking the People of the Book, face futile endeavors, such as mocking Azan.\n• Despite their transgressions, Allah offers forgiveness if they embrace Prophet Muhammad's (PBUH) guidance.\n• Believers are urged to proclaim truth, holding the People of the Book accountable until they embrace the message of Prophet Muhammad (PBUH)."
            },
            {
              "reference": "Ayat 72–81: Rejection of Misconceptions",
              "text": "• Allah clarifies that equating Isa (AS) with Allah or believing in the Trinity constitutes disbelief.\n• Christians are discouraged from blindly following Jewish narratives, as they too deviated from their religion and rejected Prophet Muhammad's guidance.\n• Embracing Prophet Muhammad's teachings is emphasized as the only path to salvation for both Christians and Jews."
            },
            {
              "reference": "Ayat 82–91: Likelihood of Christian Conversion",
              "text": "• Allah highlights the potential of Christians to embrace Prophet Muhammad's message, suggesting their natural affinity with the Quran.\n• Compared to the Children of Israel, Christians are portrayed as more receptive to Islam."
            },
            {
              "reference": "Ayat 92–108: Unique Food Regulations and Legal Protection",
              "text": "• Returns to the discussion of food regulations, emphasizing unique aspects such as the sanctity of Sacred Grounds and the rights of animals.\n• Allah discourages unnecessary questioning and superstitions.\n• Legal protection extends beyond life to death, ensuring the integrity of wills and protecting the legacy of the Messengers."
            },
            {
              "reference": "Ayat 109–120: Protection of Legacy and Guidance",
              "text": "• Allah highlights how He safeguards the legacy of the Messengers, particularly Prophet 'Isa, and their miracles.\n• The abandonment of guidance by later generations is warned against, with a reminder of accountability on the Day of Judgment."
            }
          ]
        },
        {
          "surah": "6. Al-An'am",
          "posts": [
            {
              "reference": "Ayat 1–20: Acknowledging Allah's Sovereignty",
              "text": "• Allah's unmatched power is evident in creation.\n• Disbelievers reject clear signs despite warnings.\n• Recognition of Allah's sovereignty and mercy is crucial.\n• Denial of resurrection leads to regret.\n• Past generations were destroyed for their sins."
            },
            {
              "reference": "Ayat 21–41: Consequences of Disbelief",
              "text": "• Fabricating lies about Allah leads to failure.\n• Disbelievers will be held accountable for polytheism.\n• Excuses won't avail on Judgment Day.\n• Life's transient pleasures distract from the ultimate purpose.\n• Disbelief blinds people to the truth, leading to destruction."
            },
            {
              "reference": "Ayat 42–60: Trials and Warnings",
              "text": "• Messengers warn and bring good news.\n• True success lies in the Hereafter.\n• Disbelievers face punishment despite worldly blessings.\n• Allah's knowledge encompasses all things.\n• Messengers faced denial but received divine help."
            },
            {
              "reference": "Ayat 61–82: Divine Supremacy and Guidance",
              "text": "• Allah appoints angels to guard humanity.\n• Divine punishment manifests for those who stray.\n• Reflect on Allah's power for protection.\n• Avoid those who mock Quranic verses.\n• Monotheism ensures security and guidance."
            },
            {
              "reference": "Ayat 83–100: Divine Guidance and Recognition",
              "text": "• Allah's wisdom is exemplified through Ibrahim and other prophets.\n• Prophets guided by Allah include Ibrahim (AS), Ishaq (AS), Yaqub (AS), Zakariya (AS), Yahya (AS), and ‘Isa (AS).\n• Acceptance of Allah's guidance leads to true rewards.\n• The Quran serves as a blessed reminder for believers.\n• Disbelievers fail to recognize divine signs despite clear proof."
            },
            {
              "reference": "Ayat 101–121: Emphasis on Allah's Uniqueness and Quranic Guidance",
              "text": "• Worship Allah alone, the Creator of all.\n• The Quran's clarity distinguishes truth from falsehood.\n• Muhammad is not responsible for those who reject guidance.\n• Misled by deceit, disbelievers indulge in sinful behavior.\n• Rejecting forbidden food and polytheism is emphasized."
            },
            {
              "reference": "Ayat 122–140: Transformation, Consequences and Divine Justice",
              "text": "• Allah grants life and guidance to those previously in darkness.\n• Disbelievers face humiliation and torment for their plots.\n• Allah guides whom He wills and leads astray whom He wills.\n• Islam is the path of guidance for those who take heed.\n• Allah’s justice ensures each is rewarded or punished according to their deeds."
            },
            {
              "reference": "Ayat 141–154: Blessings, Consumption, Conduct, and Musa's Guidance",
              "text": "• Allah's provision includes diverse crops and livestock.\n• Specific rules govern permissible food consumption.\n• Commandments guide behavior toward parents, children, and orphans.\n• Following Allah's commands leads to righteousness.\n• Musa (AS) was given the Torah as guidance and mercy for the righteous."
            },
            {
              "reference": "Ayat 155–165: Guidance Through the Qur'an, Unity, and Affirmation",
              "text": "• The Qur'an is a blessed book guiding humanity to mercy.\n• Believers await signs of the Hour while disbelievers reject them.\n• Dividing religion into sects is condemned; unity is emphasized.\n• Deeds are rewarded or punished accordingly.\n• Muhammad affirms his adherence to Allah's commands."
            }
          ]
        },
        {
            
          "surah": "7. Al-A'raf",
          "posts": [
            {
              "reference": "Ayat 1–25: Miracles, Guidance, and Accountability",
              "text": "• Miraculous letters of the Qur'an are known only to Allah.\n• The Qur'an serves as a guide and reminder for believers, warning others.\n• Idolatry is warned against, reflecting on past nations' destruction.\n• Everyone, including Messengers, will be held accountable for their deeds.\n• Deeds will be weighed on the Day of Resurrection."
            },
            {
              "reference": "Ayat 26–39: Adornment, Resistance, Justice, and Consequences",
              "text": "• Clothing and righteousness are forms of adornment contrasting with Satan's deception.\n• Resisting Satan's tactics and avoiding extravagance and sin are emphasized.\n• Rejecting Allah's signs leads to eternal punishment, while the righteous enjoy eternal bliss.\n• Believers who follow Allah's guidance will inherit Paradise."
            },
            {
              "reference": "Ayat 40–58: Punishment, Hope, Divine Control, and Signs",
              "text": "• Arrogance and disbelief lead to exclusion from Paradise and entry into Hellfire.\n• Believers find hope in Paradise, peace, and gratitude for Allah's guidance.\n• Allah's power over creation emphasizes His sovereignty and mercy.\n• Humility in worship, avoidance of mischief, and gratitude for blessings are urged."
            },
            {
              "reference": "Ayat 59–72: Prophetic Mission, Rejection, Divine Mercy, and Intervention",
              "text": "• Prophets called people to worship Allah alone and warned of impending punishment.\n• Leaders rejected the Prophets’ messages out of arrogance and accused them of falsehood.\n• Allah saved Prophets and believers, punishing disbelievers with calamities and destruction.\n• Prophets faithfully conveyed Allah's message despite rejection."
            },
            {
              "reference": "Ayat 73–93: Prophetic Mission and Divine Response",
              "text": "• Prophets like Saleh (AS), Lut (AS), and Shuaib (AS) conveyed messages of monotheism and social justice.\n• Each Prophet presented clear signs and proofs of their authenticity, facing rejection from arrogant leaders.\n• Allah punishes disbelievers with calamities while saving believers who adhered to guidance."
            },
            {
              "reference": "Ayat 94–108: Divine Response to Disbelief and Prophetic Miracles",
              "text": "• Allah sent punishment upon towns rejecting Prophets, humbling them before final retribution.\n• Disbelievers remained unaware or felt secure from Allah's punishment, leading to heart sealing.\n• Prophets like Musa (AS) delivered Allah's message with clear signs, facing rejection from arrogant rulers.\n• Allah supported His messengers with miracles."
            },
            {
              "reference": "Ayat 109–129: Musa (AS) Confronts Sorcerers and Divine Retribution",
              "text": "• Musa (AS) confronts sorcerers in a contest to prove divine truth over falsehood.\n• Allah supports Musa (AS) with miracles, leading sorcerers to embrace faith despite pharaoh threats.\n• Despite persecution, Musa (AS) encourages patience, trust in Allah, and promises of victory.\n• Allah punishes the pharaoh with calamities and saves the Children of Israel from tyranny."
            },
            {
              "reference": "Ayat 130–151: Divine Punishment, Arrogance, and Guidance",
              "text": "• Allah punishes the pharaoh’s people with signs of displeasure and warning.\n• Despite the punishment, the pharaoh’s people remain arrogant, leading to their destruction.\n• Allah saves the Children of Israel from the pharaoh’s tyranny.\n• The people's idolatry leads to regret and repentance, seeking Allah's forgiveness through Musa’s (AS) intercession."
            },
            {
              "reference": "Ayat 152–171: Divine Mercy, Guidance, and Justice",
              "text": "• Divine retribution awaits idolaters, while repentance leads to Allah's forgiveness and mercy.\n• The Tablets of Musa (AS) contain guidance and mercy for the God-fearing.\n• Musa (AS) intercedes for his people, seeking Allah's mercy upon them.\n• Allah praises those committed to truth and justice among Musa’s (AS) people."
            },
            {
              "reference": "Ayat 172–188: Covenant, Guidance, and Accountability",
              "text": "• Allah's covenant with Adam's descendants ensures accountability on the Day of Resurrection.\n• Allah guides whom He wills and holds individuals responsible for their choices.\n• Some are created for Hell due to heedlessness and rejection of guidance.\n• Believers are urged to call upon Allah's names and avoid associating with deniers."
            },
            {
              "reference": "Ayat 189–206: Monotheism, Worship, and Protection",
              "text": "• Worshiping partners to Allah is futile, emphasizing monotheism's importance.\n• False deities are powerless and incapable of responding to supplication.\n• True worship entails reliance on Allah, seeking forgiveness, and enjoining good.\n• Seeking refuge in Allah protects believers from Satan's evil whispers.\n• The pious remember Allah and are guided aright."
            }
          ]
        },
        {
          "surah": "8. Al-Anfal",
          "posts": [
            {
              "reference": "Ayat 1–19: Spoils, Believers' Attributes, Support, Trials",
              "text": "• Spoils of war are Allah's and His Messenger's, with guidance on their distribution.\n• Attributes of believers include fear of Allah, increased faith, prayer, and charity.\n• Allah's support in battle is emphasized, urging believers to trust and seek His help.\n• Trials and past victories are reminders of the rewards for steadfastness."
            },
            {
              "reference": "Ayat 20–37: Obedience, Warning, Trials, Divine Support",
              "text": "• Believers are urged to obey Allah and His Messenger, warned against disbelief, and promised reward for faithfulness.\n• Trials faced by believers are acknowledged, with reminders of Allah's support and punishment for disbelievers."
            },
            {
              "reference": "Ayat 38–48: Call to Disbelievers, Command to Fight, Booty Distribution",
              "text": "• Disbelievers are urged to cease disbelief, and Muslims are commanded to fight for Allah's religion, with guidelines for distributing war booty.\n• Allah's plan and support during battles are highlighted, with instructions on battle conduct and caution against Satan's deception."
            },
            {
              "reference": "Ayat 49–64: Hypocrites, Disbelievers' Punishment, Covenant, War Preparation",
              "text": "• Hypocrites and disbelievers mock and deceive believers, facing punishment in the afterlife.\n• Punishment for disbelievers includes smiting by angels, with a warning to those who break covenants.\n• Believers prepare for war, open to peace but ready for battle, relying on Allah's unity and support."
            },
            {
              "reference": "Ayat 65–75: Encouragement, Divine Support, and Unity",
              "text": "• Believers are encouraged to fight for Allah's cause, assured of victory.\n• Divine support lightens the burden, allowing the enjoyment of lawful booty.\n• Prisoners of war treatment outlined with emphasis on trust and unity.\n• Unity is crucial to prevent discord, ensuring forgiveness and provision from Allah."
            }
          ]
        },
        {
          "surah": "9. At-Tawbah",
          "posts": [
            {
              "reference": "Ayat 1–15: Conquest of Makkah and Treaty Breach",
              "text": "• Conquest signals the end of Quraysh's reign, restoring Islam's place.\n• Repentance is offered; treaty breakers become open enemies.\n• Fair option: Seek protection with Muslims; Muslims upheld the treaty.\n• Imperative to end idolatry's influence in Makkah and Arabia."
            },
            {
              "reference": "Ayat 16–37: Moral Right and Historical Legacy",
              "text": "• Makkah's foundation on Islam warrants its leadership by believers.\n• Descendants of Ibrahim managed Makkah, yet practiced idolatry.\n• Prophetic authority supersedes familial, tribal, or economic ties.\n• Tasked with removing idolaters from Sacred Grounds due to treaty breach."
            },
            {
              "reference": "Ayat 38–66: Exposing Hypocrisy",
              "text": "• Hypocrites' traits: reluctance in battles, excuses, hatred for believers' success.\n• Charitable efforts were rejected due to insincerity and lack of worship.\n• Greed for wealth, mockery of the Prophet (PBUH), joking about sacred matters.\n• Hypocrites accommodate sin, and discourage good deeds, unlike believers."
            },
            {
              "reference": "Ayat 67–74: Struggle Against Hypocrisy",
              "text": "• Hypocrites encourage sin, and discourage good deeds; the opposite of believers.\n• Historical examples highlight the destruction of hypocrites and the success of believers.\n• This is a reminder to the Prophet to continue to struggle with hypocrites and disbelievers.\n• Upholding Divine standards central to the struggle for religion's preservation."
            },
            {
              "reference": "Ayat 75–92: Causes of Hypocrisy",
              "text": "• Hypocrisy stems from greed for wealth and cowardice in battle.\n• Hypocrites value wealth excessively and mock the poor.\n• They avoid fighting for Allah and seek worldly gain with minimal risk.\n• Their betrayal is unforgivable; wealth becomes a hardship, not a blessing.\n• Exemption for those with genuine inability to fight, but with sincere hearts."
            },
            {
              "reference": "Ayat 93–106: Speech and Charity of Hypocrites",
              "text": "• Hypocrites justify actions with insincere speech and over-swearing.\n• Charity, seen as a burden, causes animosity toward believers.\n• Allah instructs us to judge them by deeds, not words.\n• Believers view charity as purification, seeking forgiveness sincerely."
            },
            {
              "reference": "Ayat 107–116: Hypocritical vs. Believers' Institutions",
              "text": "• Hypocritical institutions facilitate harm, division, and the spread of heretical beliefs.\n• Founded on shallow knowledge, harbor hostility toward the Prophet (PBUH).\n• Believers' institutions promote taqwa, seek Allah's pleasure, and enjoin righteousness.\n• Contrast between harmful and righteous establishments."
            },
            {
              "reference": "Ayat 117–129: Forgiveness and Repentance",
              "text": "• Polytheists cannot be forgiven if dying in disbelief, even if related to prophets.\n• Repentant sinners can be forgiven, regardless of past sins.\n• Those unable to fulfill obligations due to circumstances receive mercy.\n• Unrepentant hypocrites mock the Prophet (PBUH), reject the Quran's guidance, and face consequences."
            }
          ]
        },
        {
          "surah": "10. Yunus",
          "posts": [
            {
              "reference": "Ayat 1–20: Revelation and Disbelief",
              "text": "• The Quran guides humanity to monotheism and offers eternal happiness.\n• Disbelievers mock the Quran and Prophet Muhammad, alleging sorcery.\n• Allah is the Creator and controls all affairs.\n• Signs in creation emphasize Allah's existence and power.\n• The Quran serves as a reminder and challenges disbelievers to produce something like it."
            },
            {
              "reference": "Ayat 21–40: Warning and Accountability",
              "text": "• Those who plot against Allah's signs face consequences.\n• Disbelievers turn to Allah in distress but forget Him once relieved.\n• On Judgment Day, disbelievers disown false gods, and accountability is emphasized.\n• The Quran confirms previous scriptures, exposing disbelief."
            },
            {
              "reference": "Ayat 41–60: Accountability and Denial",
              "text": "• People are accountable for their deeds; disbelief and disobedience wrong themselves.\n• Each community receives a messenger, and disbelievers question the timing of punishment.\n• Prophet Muhammad has no power except by Allah's will.\n• Disbelievers will face regret and punishment for their lies against Allah."
            },
            {
              "reference": "Ayat 61–82: Signs and Prophetic Stories",
              "text": "• Allah's awareness extends to the smallest actions.\n• The righteous have no fear or grief.\n• Prophet Nuh (AS) and Musa's (AS) stories highlight rejection and divine intervention.\n• Allah ensures the truth prevails despite disbelief."
            },
            {
              "reference": "Ayat 83–92: Musa (AS) and Pharaoh",
              "text": "• Only a few of Musa's people believed due to fear of Pharaoh.\n• Moses and Aaron establish worship for their people.\n• Allah saves the Children of Israel but drowns Pharaoh and his army.\n• Pharaoh's last-minute belief is rejected, and his body is preserved as a sign."
            },
            {
              "reference": "Ayat 93–109: Guidance and Responsibility",
              "text": "• Prophet Muhammad is cautioned against denying Allah's signs.\n• Only those whom Allah guides believe.\n• Guidance comes from Allah alone.\n• Invoking others besides Allah is futile.\n• Prophet Muhammad is advised to follow Allah's inspiration and be patient."
            }
          ]
        },
        {
          "surah": "11. Hud",
          "posts": [
            {
              "reference": "Ayat 1–24: Revelation and Disbelief",
              "text": "• The Quran is detailed and wise, guiding humanity to worship Allah alone.\n• Prophet Muhammad (PBUH) is sent as a warner, urging repentance and faith.\n• Allah's knowledge encompasses all things, including the unseen.\n• Creation and signs in the universe attest to Allah's power and wisdom.\n• Disbelievers will face punishment."
            },
            {
              "reference": "Ayat 25–49: Prophetic Stories – Nuh (AS)",
              "text": "• Prophet Nuh (AS) warns his people, who mock him and reject his message.\n• Nuh builds the ark as Allah commands, saving the believers from the flood.\n• Nuh's son perishes due to disbelief, despite Nuh’s (AS) plea for his safety.\n• The flood subsides, and the righteous are saved, while the disbelievers face torment."
            },
            {
              "reference": "Ayat 50–68: Prophetic Stories – Hud (AS) and Saleh (AS)",
              "text": "• Prophets Hud (AS) and Saleh (AS) warn their people to worship Allah and reject false deities.\n• The people of Aad and Thamud reject their prophets and face destruction.\n• Disbelievers mock the prophets and deny the signs of Allah."
            },
            {
              "reference": "Ayat 69–95: Prophetic Stories – Ibrahim (AS), Lut (AS), Shuaib (AS)",
              "text": "• Prophet Ibrahim (AS) receives glad tidings of a son and pleads for the people of Lot.\n• Angels visit Prophet Lut (AS), who warns his people of their sinful behavior.\n• Sodom and Gomorrah face destruction, while Lut (AS) and the believers are saved.\n• Prophet Shuaib (AS) advises his people to worship Allah and act justly."
            },
            {
              "reference": "Ayat 96–123: Prophetic Stories – Musa (AS)",
              "text": "• Prophet Musa (AS) confronts Pharaoh and his chiefs, demanding they worship Allah.\n• Pharaoh persists in disbelief, leading to curses and punishment.\n• The stories of prophets serve as lessons for mankind about the Day of Judgment.\n• Muslims are encouraged to stand firm in faith and trust in Allah's justice."
            }
          ]
        },
        {
          "surah": "12. Yusuf",
          "posts": [
            {
              "reference": "Ayat 1–20: The Beginning of Prophet Yusuf’s (AS) Story",
              "text": "• The story of Prophet Yusuf (AS) begins with his dream, symbolizing his future leadership.\n• Prophet Yusuf’s (AS) brothers, driven by jealousy, plot against him and throw him into a well.\n• Despite their deception, Allah assures Prophet Yusuf (AS) that the truth will prevail."
            },
            {
              "reference": "Ayat 21–35: Prophet Yusuf’s (AS) Trials in Egypt",
              "text": "• Prophet Yusuf (AS) is sold into slavery in Egypt but finds favor with his master due to his wisdom and righteousness.\n• He faces temptation from his master's wife but remains steadfast in his faith.\n• Falsely accused, Prophet Yusuf (AS) is imprisoned but maintains his innocence and trust in Allah."
            },
            {
              "reference": "Ayat 36–49: Interpretation of Dreams",
              "text": "• Prophet Yusuf (AS) interprets the dreams of two fellow prisoners, predicting their fates.\n• When summoned by the king to interpret his dream, Prophet Yusuf (AS) predicts years of abundance followed by famine.\n• Impressed by Prophet Yusuf’s (AS) wisdom, the king appoints him as a minister to prepare for the coming famine."
            },
            {
              "reference": "Ayat 50–68: Prophet Yusuf’s (AS) Reunion with His Brothers",
              "text": "• Prophet Yusuf’s (AS) brothers visit Egypt seeking grain during the famine, unaware of his true identity.\n• Prophet Yusuf (AS) tests his brothers by demanding they bring Benjamin to him.\n• He reveals himself to his brothers, forgives them, and reunites with his family."
            },
            {
              "reference": "Ayat 69–93: Forgiveness and Reconciliation",
              "text": "• Prophet Yusuf (AS) orchestrates a plan to test his brothers' sincerity and forgiveness.\n• The brothers show remorse for their past actions and seek forgiveness from Prophet Yusuf (AS).\n• Prophet Yusuf (AS) forgives them and urges them to bring their father and entire family to Egypt."
            },
            {
              "reference": "Ayat 94–111: Reunion and Reflection",
              "text": "• Prophet Yaqub (AS) recognizes Prophet Yusuf’s (AS) scent and learns of his survival, leading to a joyful reunion.\n• Prophet Yusuf (AS) prostrates to his parents out of respect, fulfilling the vision of his dream.\n• The story of Prophet Yusuf (AS) serves as a lesson in forgiveness, perseverance, and trust in Allah's plan."
            }
          ]
        },
        {
            
              "surah": "13. Ar-Ra’d",
              "posts": [
                {
                  "reference": "Ayat 1–7: The Majesty and Power of Allah",
                  "text": "• Allah is described as the Creator of the heavens and the earth, with full control over celestial bodies and phenomena.\n• Disbelievers question resurrection after death but will face punishment in Hell for their denial.\n• Muhammad (PBUH) is a warner sent by Allah to guide humanity."
                },
                {
                  "reference": "Ayat 8–18: Allah’s Omniscience and Authority",
                  "text": "• Allah knows the unseen and the seen, and He controls all actions and phenomena.\n• Angels guard each person by Allah’s command, and everything in the heavens prostrates to Him.\n• Believers find peace in the remembrance of Allah, while disbelievers face disasters until Allah’s promise is fulfilled."
                },
                {
                  "reference": "Ayat 19–26: Characteristics of Believers and Disbelievers",
                  "text": "• Believers fulfill their covenant with Allah, maintain family ties, remain patient, and spend in His way.\n• Disbelievers who sever Allah’s connection will face Hell.\n• This world is temporary compared to the Hereafter."
                },
                {
                  "reference": "Ayat 27–31: Assurance of Allah’s Decree and Muhammad’s (PBUH) Mission",
                  "text": "• Muhammad (PBUH) is sent to inspire good deeds, regardless of the disbelievers’ rejection.\n• Despite their desire for miracles, Allah’s wisdom prevails, and disbelievers will meet their fate when Allah’s promise is fulfilled."
                },
                {
                  "reference": "Ayat 32–37: Allah’s Guidance and the Fate of Disbelievers",
                  "text": "• Allah is the Guardian of every person and does what He wills.\n• The destruction of Paradise is promised to the pious, while disbelievers’ final destination is the Fire.\n• The Quran is revealed as a decisive judgment in Arabic, commanding worship of Allah alone."
                },
                {
                  "reference": "Ayat 38–43: Allah’s Decree and Witness",
                  "text": "• Allah erases and confirms as He wills, and Muhammad (PBUH) is only to convey the message.\n• Disbelievers claim Muhammad (PBUH) is not a messenger, but sufficient witnesses are Allah and those with knowledge of the Scripture who embraced Islam."
                }
              ]
            },
            {
              "surah": "14. Ibrahim",
              "posts": [
                {
                  "reference": "Ayat 1–12: Guidance and Warnings",
                  "text": "• Revelation to Muhammad (PBUH) guides us to truth, empowered by Allah, the All-Mighty.\n• Disbelievers face torment, preferring worldly life.\n• Disbelievers plan to misguide using Allah’s messages against Him, but Allah’s plan prevails.\n• Guided by Allah’s will, nations reflect past actions embracing patience on Allah and patience."
                },
                {
                  "reference": "Ayat 13–21: Consequences of Disbelief",
                  "text": "• Believers inherit the land, disbelievers’ downfall seen.\n• Allah’s victory from believers closer than it seems.\n• Fire becomes their eternal home, with no escape.\n• Creation of Hell, animals, and the sky will rise before them on Judgment Day."
                },
                {
                  "reference": "Ayat 22–34: Rewards and Parables",
                  "text": "• Righteous believers gather the Gardens of Paradise.\n• Wrongdoers face Hell for bad intentions, false worship, and lies.\n• Believers are to avoid arrogance, give charity, and be grateful.\n• Allah’s unique signs demonstrate provision, mercy, and punishment.\n• Warnings to persist in wrongdoing and disbelief."
                },
                {
                  "reference": "Ayat 35–41: Ibrahim’s (AS) Prayers",
                  "text": "• Prophet Ibrahim (AS) prays for his followers’ sincerity.\n• He asks for descendants to inhabit Mecca, worship Allah, and offer prayer.\n• Allah acknowledges and grants sincere prayers of the righteous.\n• Ibrahim (AS) prays for forgiveness, mercy, and blessings for his family and believers on the Day of Reckoning."
                },
                {
                  "reference": "Ayat 42–52: Day of Judgment",
                  "text": "• Wrongdoers harmed towards mankind now lament their judgment.\n• They act against Prophets (AS), plot, and perish, but Allah judges.\n• On Judgment Day, the earth and heavens will change, and all creatures will appear before Allah.\n• Disbelievers will be bound and led, and accountability enforced according to truth, showcasing Allah’s swift reckoning."
            }
          ]
        },
        {
          "surah": "15. Al-Hijr",
          "posts": [
            {
              "reference": "Ayat 1–15: The Quran’s Guidance",
              "text": "• The Quran is guidance with clear verses; disbelievers will regret their rejection on Judgment Day.\n• Each community had a decreed term.\n• Messengers challenged Muhammad’s (PBUH) authority, demanding signs.\n• Allah protects the Quran from corruption.\n• Disbelievers refuse the Quran, even if heaven’s gate was opened to them."
            },
            {
              "reference": "Ayat 16–25: Signs of Creation",
              "text": "• Allah spreads the earth with firm mountains, vegetation, and sustenance for all creatures.\n• Winds fertilize clouds, and rain is sent in measured amounts.\n• Allah controls life and death, and He will gather all humanity.\n• Allah is All-Wise and All-Knowing."
            },
            {
              "reference": "Ayat 26–44: Creation of Man and the Rebellion of Iblis",
              "text": "• Allah created man from clay and commanded angels to prostrate to Adam.\n• Iblis refused, claiming superiority, leading to his expulsion.\n• He requested respite until resurrection to misguide Allah’s creation.\n• Allah curses Iblis, except for Allah’s sincere followers.\n• Hell is the destination for his followers."
            },
            {
              "reference": "Ayat 45–60: The Promise of Paradise and the Warning to Ibrahim (AS)",
              "text": "• In Paradise, believers will be rewarded for all of eternity.\n• Angels bring Ibrahim (AS) glad tidings of a son and warnings for the people of Lut.\n• The blessed are rewarded, and the cursed will face Hell.\n• Lut’s (AS) wife is among the condemned, and all promises will be kept."
            },
            {
              "reference": "Ayat 61–79: Warning to Lut and the Destruction of Sinful Cities",
              "text": "• Angels warn Lut (AS) of the impending destruction and instruct him to flee with his family.\n• Some of his people doubt the torment, and Lut is told to leave by night.\n• Instantly, they face destruction at sunrise; other cities are condemned.\n• These events are warning signs for believers."
            },
            {
              "reference": "Ayat 80–99: Destruction of Madyan and Proclamation of the Quran",
              "text": "• The creation of the heavens and the earth is true, and the Hour is coming.\n• The Quran, including Al-Fatihah, is instructed upon Muhammad (PBUH).\n• Do not worship what disbelievers possess or proclaim Allah’s message openly.\n• Allah reassures the Prophet (PBUH) and warns those who set up partners with Him."
            }
          ]
        },
        {
          "surah": "16. An-Nahl",
          "posts": [
            {
              "reference": "Ayat 1–21: Oneness of Allah and Creation",
              "text": "• Emphasises belief in Allah’s Oneness and warns against associating partners with Him.\n• Highlights Allah’s creation and the signs pointing to His existence and power.\n• Disbelievers mock signs and twist truth.\n• Denial of the Day of Resurrection leads to consequences."
            },
            {
              "reference": "Ayat 22–40: Arrogance, Punishment, and Rewards",
              "text": "• Discusses the arrogance of those who deny the truth and fate of wrongdoers.\n• Promises Paradise and reward for the righteous.\n• Emphasises the role of messengers.\n• Illustrates Allah’s mercy in creating and decreeing.\n• Rewards for remembrance and the importance of patience and trust in Allah."
            },
            {
              "reference": "Ayat 41–60: Prostration, Gratitude, and Belief",
              "text": "• Reflects on everything in the heavens and earth, praising and prostrating to Allah.\n• Reverence of Allah and His signs increases believers in faith.\n• Disbelievers reject messengers and ridicule the Quran.\n• Their pride blinds them to the truth despite Allah’s guidance and signs in nature."
            },
            {
              "reference": "Ayat 61–76: Divine Decree, Deception, and Examples",
              "text": "• Allah postpones punishment but warns repeatedly.\n• Illustrates the outcomes of deception with worldly examples.\n• Highlights the power of divine decree.\n• Warns against ascribing evil to Allah’s will.\n• Contrasts belief with disbelief, showing mercy for believers and punishment for disbelievers."
            },
            {
              "reference": "Ayat 77–89: Allah’s Sovereignty and Guidance",
              "text": "• Allah holds the unseen of the heavens and the earth.\n• He created you, gave hearing, sight, and understanding.\n• His signs include natural cycles, like the flight of birds.\n• These signs are a source of guidance and mercy for believers."
            },
            {
              "reference": "Ayat 90–110: Ethical Principles and Accountability",
              "text": "• Allah commands justice, kindness, and prohibits evil.\n• Fulfilling covenants is stressed, with Allah as the ultimate witness.\n• The Surah’s unity is reaffirmed, and every soul is accountable for their deeds.\n• Guidance rewards believers, error misguides disbelievers."
            },
            {
              "reference": "Ayat 111–128: Individual Accountability and Exemplary Faith",
              "text": "• On the Day of Judgment, all are raised alone with no helpers.\n• Allah’s favor is for gratitude and righteousness.\n• Prophets faced rejection, but still endured.\n• Emphasis on personal accountability and the reward of patience.\n• Ibrahim’s (AS) gratitude is highlighted."
            }
          ]
        },
        {
          "surah": "17. Al-Isra",
          "posts": [
            {
              "reference": "Ayat 1–22: Divine Guidance and Moral Precepts",
              "text": "• The miraculous journey of Prophet Muhammad (PBUH) showcases Allah’s power.\n• Musa (AS) was given the scriptures, warning Israelites amid punishment.\n• Past rebellions and punishment fulfilled by Allah’s decree.\n• The Quran guides believers and warns disbelievers of torment.\n• Accountability for deeds and destruction of sinful towns."
            },
            {
              "reference": "Ayat 23–40: Monotheism and Ethical Conduct",
              "text": "• Monotheism and kindness to parents are key.\n• Mercy, charity, humility, prayer, honesty, and fulfilling promises are emphasized.\n• Prohibition of wastefulness and injustice.\n• Warning against arrogance and self-righteousness.\n• Emphasis on justice, balance, and contentment.\n• Arrogance, pride, and polytheism is advised."
            },
            {
              "reference": "Ayat 41–60: Rejection of Guidance and Call to Righteousness",
              "text": "• Quranic verses clarify truth, yet disbelievers continue in denial.\n• Condemnation of false claims about Allah.\n• Call to righteousness and warnings against pride.\n• Disbelievers demand signs and threaten the Prophet (PBUH).\n• Warning of great punishment for transgressors."
            },
            {
              "reference": "Ayat 61–77: Satan’s Rebellion and Humanity’s Honor",
              "text": "• Satan’s rebellion is highlighted and his oath to mislead humans is mentioned.\n• Allah warns disbelievers and encourages faith.\n• Warning for ingratitude, pride, and defiance.\n• Judgment Day accountability.\n• Encouragement to follow the Prophet (PBUH) with steadfastness and consistency in prayer."
            },
            {
              "reference": "Ayat 78–93: Importance of Prayer and Quranic Recitation",
              "text": "• Emphasis on performing prayers and reciting the Quran with sincerity.\n• Additional Tahajjud prayer mentioned for exceptional status.\n• Visual signs are for Allah’s sake and help.\n• Seek refuge from Satan, worship Allah sincerely.\n• The Quran serves as healing and mercy."
            },
            {
              "reference": "Ayat 94–111: Obstacles to Belief and Confirmation of Revelation",
              "text": "• Disbelief in Prophet Muhammad (PBUH) was due to the rejection of true human messengers.\n• Sufficiency of Allah as witness over truth.\n• Prophet Muhammad (PBUH) guides disbelievers.\n• Guidance behind Quranic recitation and wisdom.\n• Quran revealed over 23 years."
            }
          ]
        },
        {
      "surah": "18. Al-Kahf",
      "posts": [
        {
          "reference": "Ayat 1–17: The Story of the People of the Cave",
          "text": "• Praise for the Quran’s revelation as guidance and warning.\n• Refutation of the notion of divine offspring.\n• Prophet Muhammad’s (PBUH) grief over disbelievers' rejection.\n• Earthly possessions as a trial.\n• The miraculous story of the People of the Cave.\n• Sun's movement as a sign from Allah."
        },
        {
          "reference": "Ayat 18–31: Awakening and Protection",
          "text": "• Allah’s awakening of the People of the Cave after years of sleep.\n• Concealment of their presence in the cave.\n• Dispute among people regarding their fate.\n• Humanity’s future planning acknowledging Allah’s will.\n• Length of stay in the cave and Allah’s knowledge of the unseen."
        },
        {
          "reference": "Ayat 32–49: Parables and Accountability",
          "text": "• The parable of two men with gardens.\n• Arrogance, ingratitude, and regret.\n• Reminder of worldly impermanence.\n• Resurrection and exposure of all deeds.\n• Warning of destruction for disbelievers."
        },
        {
          "reference": "Ayat 50–59: Disobedience and Mercy",
          "text": "• Iblis’s disobedience and pride.\n• Warning to those who follow him.\n• Apportionment of Hell for disbelievers.\n• Universal evidence of truth.\n• Mercy despite denial.\n• Destruction of towns by Allah."
        },
        {
          "reference": "Ayat 60–82: Journey with Khidr",
          "text": "• Prophet Musa’s (AS) quest for knowledge.\n• His servant seeking knowledge with Khidr, a servant endowed with divine knowledge.\n• Lessons learned from Khidr’s seemingly inexplicable actions.\n• Interpretation of Khidr’s actions revealing hidden wisdom."
        },
        {
          "reference": "Ayat 83–110: Story of Dhul-Qarnayn",
          "text": "• The story of Dhul-Qarnayn, a righteous ruler empowered by Allah.\n• His journey to the east and west, and places of the sun.\n• Encounters with Gog and Magog.\n• Divine mercy and judgment are evident.\n• Reminder of the Quran’s truth.\n• Reward for believers and punishment for disbelievers on the Day of Judgment."
            }
          ]
        },
        {
            
      "surah": "19. Maryam",
      "posts": [
        {
          "reference": "Ayat 1–15: The Miracle of Birth",
          "text": "• Zakariyya's (AS) supplication for a righteous heir despite old age.\n• Gift of Yahya (AS) granted by Allah.\n• Zakariyya’s (AS) praises for signs and wisdom.\n• Birth and attributes of Yahya (AS): wisdom, piety, and righteousness.\n• Peace was invoked upon Yahya (AS) on significant occasions."
        },
        {
          "reference": "Ayat 16–40: The Story of Maryam and Isa (AS)",
          "text": "• Maryam's (RA) seclusion and encounter with the angel Jibreel (AS).\n• The miraculous conception and birth of Isa (AS).\n• Isa (AS) defends Maryam and speaks from the cradle.\n• Refutation of Christian beliefs regarding Isa’s (AS) divinity.\n• Warnings to disbelievers as a declaration of Allah’s ownership over all creation."
        },
        {
          "reference": "Ayat 41–50: The Legacy of Ibrahim (AS)",
          "text": "• Ibrahim’s (AS) truthfulness and opposition to shirk.\n• His gentle but firm reasoning with his father.\n• His prayers for blessings and lineage.\n• Mentions of blessings upon Ishaq (AS), Ismail (AS), Musa (AS), and Yaqub (AS)."
        },
        {
          "reference": "Ayat 51–65: Honouring the Prophets",
          "text": "• Mention of Musa (AS) as a chosen messenger who conversed with Allah.\n• Gift of Harun (AS) was made as a minister.\n• Ismail’s (AS) truthfulness and prayers.\n• Idris (AS) was raised to a high station by Allah."
        },
        {
          "reference": "Ayat 66–82: Accountability and Resurrection",
          "text": "• Disbelief in resurrection countered with reminders of creation and gathering before Allah.\n• Allah recompenses deeds, while the worst reject faith and face punishment.\n• False worship condemned, as false gods will disown their followers.\n• Influence of devils is exposed; believers will succeed eventually."
        },
        {
          "reference": "Ayat 83–98: Intercession and Reward",
          "text": "• Distinction between the pious and sinners in the afterlife.\n• Power of intercession granted only to those permitted by Allah.\n• False beliefs about Allah having offspring rejected.\n• The essence of the Quran in the Prophet Muhammad’s (PBUH) message brings both glad tidings and warnings."
            }
          ]
        },
        {
          "surah": "20. Taha",
          "posts": [
            {
              "reference": "Ayat 1–24: Introduction of Musa (AS) and Pharaoh",
              "text": "• Revelation and purpose of the Quran as a reminder.\n• Affirmation of Allah as the Creator and above all.\n• Dialogue between Musa (AS) and Allah at the burning bush.\n• Miraculous signs granted to Musa (AS).\n• Musa’s (AS) and Harun’s (AS) mission to confront Pharaoh’s arrogance."
            },
            {
              "reference": "Ayat 25–54: Musa’s (AS) Mission and Supplications",
              "text": "• Musa’s (AS) supplication for confidence, ease, and clarity in speech.\n• Signs to prove Musa’s mission.\n• Pharaoh’s mocking about Allah and Musa’s (AS) response.\n• Blessings provided by Allah as sustenance from the earth."
            },
            {
              "reference": "Ayat 55–76: Confrontation with Pharaoh and Magicians",
              "text": "• A reminder of resurrection and returning to Allah.\n• Meeting between Musa (AS) and the magicians.\n• Magicians accept truth and are punished by Pharaoh.\n• The magicians’ firm stance becomes a symbol of faith in the face of disbelief."
            },
            {
              "reference": "Ayat 77–89: Deliverance, Covenant, and Idolatry Condemned",
              "text": "• Guidance and miraculous deliverance of Musa’s (AS) people from Pharaoh’s oppression.\n• Pharaoh’s drowning and destruction.\n• Warnings against worshipping idols.\n• Samiri’s role in creating the golden calf."
            },
            {
              "reference": "Ayat 90–115: Warning Against Idolatry and As-Samiri’s Deception",
              "text": "• Harun’s warning against worshipping the calf and the people’s stubbornness.\n• Musa (AS) rebukes Harun (AS) for not preventing the people.\n• Condemnation of Samiri’s deceitful role in creating the calf.\n• Mention of Adam (AS) as a reminder for future generations."
            },
            {
              "reference": "Ayat 116–135: Creation of Adam (AS), Temptation, and Life’s Test",
              "text": "• Creation of Adam and command to prostrate, except for Iblis.\n• Satan’s temptation of Adam (AS) and his expulsion from Paradise.\n• Forgiveness and guidance after disobedience.\n• Life as a test, encouragement to repent, and the eternal reward or punishment awaiting disbelievers."
            }
          ]
        },
        {
          "surah": "21. Al-Anbya",
          "posts": [
            {
              "reference": "Ayat 1–10: Warning and Mockery",
              "text": "• Warning of the impending Day of Reckoning.\n• Disbelief and mockery toward Muhammad (PBUH) and the Quran.\n• Muhammad’s defense and refutation of disbelievers’ claims.\n• Reminder of past communities’ destruction for rejecting messengers.\n• Emphasis on messengers as human beings inspired by Allah."
            },
            {
              "reference": "Ayat 11–29: Destruction and Response",
              "text": "• Cycle of destruction and replacement of wrongdoing communities.\n• Consequences faced by mockers of messengers.\n• Creation and purpose of the heavens and earth.\n• Powerlessness of false gods against Allah’s will.\n• Gradual loss by wrongdoers and warning against disbelief."
            },
            {
              "reference": "Ayat 30–50: Creation, Order, and Justice",
              "text": "• Creation and purpose behind the universe.\n• Reminder of the role of water, land, and celestial bodies.\n• Disbelievers’ denial despite clear signs.\n• Gradual loss of hope for disbelievers.\n• Promises of justice and the Day of Resurrection."
            },
            {
              "reference": "Ayat 51–75: Prophets and Divine Intervention",
              "text": "• Guidance and leadership of Ibrahim (AS) against idol worship.\n• Divine intervention rescuing the believers from harm.\n• Mention of prophets like Ishaq (AS), Yaqub (AS), Lut (AS), and Nuh (AS).\n• Rescue of Nuh (AS) and his people from the flood."
            },
            {
              "reference": "Ayat 76–93: Blessings Upon the Prophets",
              "text": "• Justice and knowledge bestowed upon Dawud (AS) and Sulaiman (AS).\n• Victory, power, and mercy upon Ayub (AS), Ismail (AS), Idris (AS), and Dhul-Kifl (AS).\n• Blessings upon Zakariyya (AS), granting him Yahya (AS) and curing his wife."
            },
            {
              "reference": "Ayat 94–112: Day of Resurrection and Inheritance",
              "text": "• Reward for righteous deeds and protection of ruined or destroyed towns.\n• Example of Ya’juj and Ma’juj signaling the nearness of the Day of Resurrection.\n• Clear message of the Quran and Muhammad (PBUH) as a mercy.\n• Truth in Allah’s judgment and His help against false accusations."
            }
          ]
        },
        {
          "surah": "22. Al-Hajj",
          "posts": [
            {
              "reference": "Ayat 1–22: Warning and Promise",
              "text": "• Urgency to fear Allah due to the impending Day of Judgment.\n• Description of the chaos and terror on the Day of Judgment.\n• Warning against following the devil’s misleading advice.\n• Affirmation of resurrection and reward/punishment.\n• Creation of humankind and dispute among them.\n• Inevitability of punishment for deniers and obstructors."
            },
            {
              "reference": "Ayat 23–38: Rewards and Prohibitions",
              "text": "• Rewards of believers in Paradise: gardens, jewelry, and silk.\n• Suffering of the wicked in Hell.\n• Warning against idol worship and emphasis on monotheism.\n• Pilgrimage sacrifices as symbols of faith.\n• Defense of believers against treachery."
            },
            {
              "reference": "Ayat 39–57: Struggle and Fate",
              "text": "• Permission to fight in defense of faith.\n• Rights of persecuted believers.\n• Consequences of rejecting messengers and nations.\n• Destruction of past disbelievers.\n• Allah’s justice for disbelievers and reward for believers on the Day of Judgment."
            },
            {
              "reference": "Ayat 58–78: Divine Assistance and Attributes",
              "text": "• Reward for emigration in the cause of Allah.\n• Divine assistance for the wronged.\n• Attributes of Allah and the ordained religious obligation.\n• Power of Allah’s signs and punishment of polytheists.\n• Choice of messengers and the call to worship sincerely.\n• Islam is the religion of Ibrahim (AS) and the call to uphold it."
            }
          ]
        },
        {
        
          "surah": "23. Al-Mu'minun",
          "posts": [
            {
              "reference": "Ayat 1–22: Qualities of Believers and Creation",
              "text": "• Description of the qualities of successful believers.\n• Promise of inheritance of Paradise for these believers.\n• Stages of human creation—from a drop to a new creation.\n• Affirmation of life after death and resurrection.\n• Allah’s creation of the heavens and His divine knowledge.\n• Blessings provided by Allah including gardens and provisions."
            },
            {
              "reference": "Ayat 23–50: Prophets and Divine Assistance",
              "text": "• Sending of prophets like Nuh (AS) to nations.\n• Rejection and opposition faced by prophets from disbelievers.\n• Allah’s aid to His messengers with miracles and signs.\n• Punishment of disbelievers who rejected the prophets.\n• Maryam (RA) and ‘Isa (AS) are mentioned as signs from Allah."
            },
            {
              "reference": "Ayat 51–77: Guidance and Warnings",
              "text": "• Instructions for messengers to eat lawful provisions and obey Allah.\n• Division of religion into sects despite its unity.\n• Punishment for persistent disbelief and rejection of truth."
            },
            {
              "reference": "Ayat 78–92: Attributes of Allah and Judgment",
              "text": "• Description of Allah’s attributes as the Creator of life, death, hearing, sight, and understanding.\n• Disbelievers’ doubt in resurrection and denial of Allah’s sovereignty over the heavens and the earth.\n• Emphasis on seeking refuge from the whispers of devils and the outcome of judgment on the Day of Judgment."
            },
            {
              "reference": "Ayat 93–118: Supplication and Reality of Afterlife",
              "text": "• Teachings on seeking refuge from Allah’s punishment and seeking mercy.\n• Hopes for the believers in the afterlife and truth of the message.\n• Reward for patience in faith and acknowledgment of Allah as the Bestower of mercy."
            }
          ]
        },
        {
          "surah": "24. An-Nur",
          "posts": [
            {
              "reference": "Ayat 1–20: Laws and Justice",
              "text": "• Establishment of laws regarding punishment for illegal sexual acts and false accusations.\n• Equality in punishment for adultery and marriage restrictions for adulterers.\n• Importance of witnesses and severe punishment for false accusations.\n• Emphasis on repentance and Allah’s mercy for those who repent sincerely."
            },
            {
              "reference": "Ayat 21–34: Moral Guidance",
              "text": "• Warning against following Satan’s path.\n• Condemnation of slander and false accusations (including the story of Aisha RA).\n• Emphasis on good speech, privacy, modesty, and chastity.\n• Mercy for those who repent and encouragement for the emancipation of trustworthy slaves."
            },
            {
              "reference": "Ayat 35–50: Divine Guidance and Accountability",
              "text": "• Description of Allah as the Light of the heavens and the earth.\n• Importance of maintaining prayer and charity.\n• Warning against the disobedient hearts of disbelievers and their rejection of Allah’s guidance.\n• Reminder of the consequences in obeying or rejecting the Messenger."
            },
            {
              "reference": "Ayat 51–64: Obedience and Respect",
              "text": "• Emphasis on obedience to Allah and His Messenger for true believers.\n• Honouring succession and command for those steadfast in faith.\n• Rules for seeking permission before entering private spaces and guidelines for women’s clothing and privacy.\n• Equality in eating and respect for the authority of the Messenger."
            }
          ]
        },
        {
          "surah": "25. Al-Furqan",
          "posts": [
            {
              "reference": "Ayat 1–20: Revelation and Warning",
              "text": "• The Quran is praised as the criterion of truth.\n• Affirmation of Allah’s oneness and rejection of partners.\n• Disbelievers’ accusations against Muhammad (PBUH) and rejection of the message.\n• Promise of Paradise for the righteous and warning for disbelievers.\n• Encouragement for believers to endure trials with patience."
            },
            {
              "reference": "Ayat 21–34: Arrogance and Punishment",
              "text": "• Disbelievers’ arrogance in demanding signs and denial of the Day of Resurrection.\n• Warning of severe punishment for disbelievers on Judgment Day.\n• Promise of reward in Paradise for the righteous and regret of the disbelievers.\n• Gradual revelation of the Quran and refutation of disbelievers’ objections."
            },
            {
              "reference": "Ayat 35–44: Prophets and Signs",
              "text": "• Mention of Prophet Musa (AS) and Prophet Nuh (AS), along with others who faced rejection.\n• Lessons from the destruction of past nations due to disbelief.\n• Disbelievers’ arrogance to signs and worship of false deities.\n• Using examples for the believers to understand."
            },
            {
              "reference": "Ayat 45–60: Divine Signs and Mission",
              "text": "• Recognition of Allah’s signs in the creation of heavens, earth, and celestial bodies.\n• Warnings against disbelief and idol worship.\n• Affirmation of Prophet Muhammad (PBUH) as a bearer of glad tidings and a warner.\n• Encouragement for believers to trust in Allah’s power over all things."
            },
            {
              "reference": "Ayat 61–77: Celestial Bodies and Devotion",
              "text": "• Acknowledgment of Allah’s greatness reflected in celestial bodies.\n• Attributes of true servants of Allah: humility, devotion, repentance, and moderation.\n• Importance of avoiding falsehood and seeking forgiveness.\n• Rewards for patience, balance, and consequences for denial of truth."
            }
          ]
        },
        {
          "surah": "26. Ash-Shu'ara",
          "posts": [
            {
              "reference": "Ayat 1–33: Miracles and Prophetic Mission",
              "text": "• Introduction to the miraculous nature and clarity of the Quran.\n• Encouragement for Muhammad (PBUH) to continue his prophetic mission.\n• Allah’s signs in nature and the story of Prophet Musa (AS), including his confrontation with Pharaoh.\n• Display of miracles by Musa (AS) and the triumph of truth over falsehood."
            },
            {
              "reference": "Ayat 34–69: Triumph and Exodus",
              "text": "• Pharaoh’s plot against Musa (AS) and the triumph of truth over sorcery.\n• The exodus of the Israelites and the parting of the sea for their escape.\n• Destruction of Pharaoh and his army.\n• Lessons drawn from the story of Musa (AS) as a sign of Allah’s power and mercy."
            },
            {
              "reference": "Ayat 70–122: Faith of Ibrahim (AS) and Judgment",
              "text": "• Story of Prophet Ibrahim (AS) and his rejection of idol worship.\n• His arguments for the existence of Allah and His attributes.\n• Message of truth by Ibrahim (AS) and his prayers for future generations.\n• Communication of Allah’s attributes."
            },
            {
              "reference": "Ayat 123–159: Warnings and Destruction",
              "text": "• Stories of Prophets Hud (AS) and Salih (AS) sent to the Aad and Thamud.\n• Rejection and punishment of disbelievers despite miracles.\n• Warnings of destruction as signs of Allah’s power and reminders of His attributes."
            },
            {
              "reference": "Ayat 160–191: Warning and Destruction",
              "text": "• Lut (AS) warned his people against immoral behaviour, particularly homosexuality.\n• Rejection of Lut’s message and threats against him.\n• Supplication of Lut (AS) along with his family being saved from destruction.\n• Their destruction as a sign of Allah’s power and justice."
            },
            {
              "reference": "Ayat 192–227: Quranic Revelation and Warnings",
              "text": "• The Quran is Allah’s revelation delivered by Jibril (AS).\n• Its purpose is to warn people and reveal clear guidance.\n• Affirmation of the Quran’s truth and refutation of previous corrupted scriptures.\n• Warning the disbelievers (deniers of truth) that the Quran was revealed to them, facing punishment suddenly."
            }
          ]
        },
        {
          "surah": "27. An-Naml",
          "posts": [
            {
              "reference": "Ayat 1–14: The Miraculous Quran",
              "text": "• Introduction with the disjointed letters 'Ta-Sin'.\n• Attributes of the Quran: clarity, guidance, and good news.\n• Disbelievers’ rejection and their fate in the Hereafter.\n• Musa’s (AS) encounter with Allah at the burning bush.\n• Musa’s (AS) signs and Pharaoh’s rejection."
            },
            {
              "reference": "Ayat 15–31: Knowledge and Wisdom Granted",
              "text": "• Knowledge was granted to Dawud (AS) and Sulaiman (AS).\n• The ants warn one another, seen by Sulaiman (AS).\n• Sulaiman’s prayer for righteous descendants.\n• Discovery of a distant land by the hoopoe.\n• Dawud’s (AS) plan to invite the queen to Islam."
            },
            {
              "reference": "Ayat 32–44: Sulaiman (AS) Test and Gratitude",
              "text": "• The queen seeks guidance and decides to submit to Sulaiman (AS).\n• Her entry expresses humility, seeking forgiveness.\n• She embraces the truth and submits.\n• Sulaiman (AS) praises Allah’s power.\n• Sulaiman (AS) shows gratitude and encourages others to do so."
            },
            {
              "reference": "Ayat 45–58: The Story of Prophet Saleh (AS) and Thamud",
              "text": "• Prophet Saleh (AS) is sent to Thamud to call them to righteousness.\n• The people demand a sign and deny him.\n• Allah punishes the disbelievers.\n• The story serves as a reminder of past destructions.\n• Disbelievers face punishment."
            },
            {
              "reference": "Ayat 59–66: Exalted Status of Allah and His Guidance",
              "text": "• Allah’s superiority over false deities is highlighted.\n• His power and creative signs are manifested.\n• Disbelievers' misplaced hopes are refuted.\n• True guidance comes only from Allah.\n• Signs in nature produce reflection."
            },
            {
              "reference": "Ayat 67–82: Disbelief in Resurrection and Allah’s Judgment",
              "text": "• Disbelievers mock the concept of resurrection.\n• They are urged to reflect on the fate of past nations who rejected messengers.\n• Allah’s knowledge of hearts and His judgment based on deeds are emphasized.\n• Disbelievers are unable to benefit others or defend their actions."
            },
            {
              "reference": "Ayat 83–93: Gathering on the Day of Judgment and Reward/Punishment",
              "text": "• Every nation will be gathered, and disbelievers questioned.\n• Their deeds will be accounted for, and they will face consequences.\n• The attendance of right and duty of the messengers are important witnesses of Allah’s greatness.\n• Rewards await those who do good deeds, while evildoers face punishment."
                }
              ]
            },
            {
          "surah": "28. Al-Qasas",
          "posts": [
            {
              "reference": "Ayat 1–13: Introduction of Musa (AS) and Pharaoh",
              "text": "• Introduction to Musa (AS) and Pharaoh, highlighting oppression, Allah’s intent to free the oppressed, and the Pharaoh’s tyranny.\n• Musa’s (AS) mother is inspired to put him in the river, leading to his adoption.\n• Allah strengthens Musa’s (AS) mother’s heart and protects him.\n• Musa (AS) returns to his mother to fulfil Allah’s promise."
            },
            {
              "reference": "Ayat 14–28: Prophethood and Flight",
              "text": "• Musa (AS) gains prophethood and wisdom after maturity.\n• He accidentally kills a man, seeks forgiveness, and flees the city.\n• Musa (AS) helps two women at a well and seeks exile in a safe land.\n• He agrees to work for a man in exchange for marriage."
            },
            {
              "reference": "Ayat 29–42: Divine Encounter and Confrontation",
              "text": "• Musa (AS) witnesses a divine call and is given miracles by Allah.\n• Musa (AS) expresses fear and is reassured.\n• Musa (AS) and Harun (AS) confront Pharaoh.\n• Pharaoh challenges Allah’s signs and faces punishment."
            },
            {
              "reference": "Ayat 43–60: Revelation and Disbelief",
              "text": "• Musa (AS) received divine scriptures.\n• Disbelievers question the Quran’s truth and Prophet Muhammad’s (PBUH) role.\n• Allah addresses the Prophet (PBUH) to guide the believers.\n• Stories of the past declare the truth and expose the disbelievers’ rejection."
            },
            {
              "reference": "Ayat 61–75: Promises and Accountability",
              "text": "• The rewards of the Hereafter contrast with worldly luxuries.\n• Disbelievers who desire false gods face judgment.\n• Every nation will have witnesses, exposing falsehood."
            },
            {
              "reference": "Ayat 76–88: Arrogance and Wisdom",
              "text": "• Qarun’s arrogance leads to his punishment.\n• The harm and wealth he owned were emphasised.\n• Reminders for those who follow truth and show compassion.\n• Musa (AS) is reminded of his return to Allah and warned against supporting disbelievers."
                }
              ]
            },
            {
              "surah": "29. Al-‘Ankabut",
              "posts": [
                {
                  "reference": "Ayat 1–13: Trials and True Faith",
                  "text": "• Believers are tested to prove the truth of their faith.\n• Trials separate true believers from hypocrites.\n• Disbelievers try to lead believers astray.\n• Emphasis on individual accountability for actions.\n• Warning against burdening others with sins."
                },
                {
                  "reference": "Ayat 14–27: Stories of Past Prophets",
                  "text": "• Story of Nuh (AS): long struggle with his people and their eventual destruction.\n• Stories of Ibrahim (AS): rejection of idols, arguments with his people, and Allah’s deliverance.\n• Mention of Lut (AS) and his escape from punishment with divine aid.\n• Theme of deliverance for the righteous and punishment for the wrongdoers."
                },
                {
                  "reference": "Ayat 28–40: Destruction of Wicked Nations",
                  "text": "• Lut’s (AS) people warned against immorality and punished.\n• Mention of the destruction of ‘Aad, Thamud, Qarun, Pharaoh, and Haman.\n• Repeated theme: rejecting messengers leads to downfall.\n• Allah’s justice prevails throughout history."
                },
                {
                  "reference": "Ayat 41–55: The Weakness of False Gods",
                  "text": "• Parable of the spider’s web to illustrate the frailty of false deities.\n• Call to reflect on Allah’s signs in nature and creation.\n• Quran as a sign for believers.\n• Evidence of truth in the revelations for those with knowledge."
                },
                {
                  "reference": "Ayat 56–69: Migration and Striving in Allah’s Cause",
                  "text": "• Encouragement to migrate for the sake of Allah if persecuted.\n• Allah’s mercy and provisions on Earth.\n• Promise of reward for those who strive in His cause.\n• Allah guides the righteous towards the right path."
                }
              ]
            },
            {
              "surah": "30. Ar-Rum",
              "posts": [
                {
                  "reference": "Ayat 1–19: Signs and Cycles in Creation",
                  "text": "• Prophecy of the Romans’ defeat and later victory.\n• Signs of Allah in the creation of the heavens and the earth.\n• Reflection on opposites: life and death, day and night.\n• Belief in resurrection affirmed by natural cycles.\n• Allah initiates creation and repeats it."
                },
                {
                  "reference": "Ayat 20–32: Reflection and Rejection",
                  "text": "• Allah’s signs in human creation, diversity of languages and colours.\n• The purpose of companionship and love.\n• Disbelievers reject these signs despite clarity.\n• Islam calls for monotheism and rejection of division in religion.\n• Warning against those who follow their desires and sectarianism."
                },
                {
                  "reference": "Ayat 33–45: Gratitude and Consequences",
                  "text": "• People call on Allah in hardship but forget Him in ease.\n• Examples of His blessings: rain, ships, provision.\n• Warning of worldly trials and misfortunes due to sins.\n• Believers are told to be patient and grateful.\n• Reward for faith and righteous action is assured."
                },
                {
                  "reference": "Ayat 46–60: Evidence and Warning",
                  "text": "• Signs in wind, rain, and life-giving processes.\n• Disbelievers mocked messengers despite these signs.\n• Quran confirms earlier scriptures and is a mercy.\n• Encouragement to reflect, be patient, and trust in Allah’s promise.\n• The Hour is certain; disbelief will not benefit on that Day."
                }
              ]
            },
            {
              "surah": "31. Luqman",
              "posts": [
                {
                  "reference": "Ayat 1–11: Wisdom and Signs",
                  "text": "• Introduction to the Quran as guidance and mercy for the righteous.\n• Condemnation of those who mock and reject it.\n• Creation of the heavens and earth as signs of Allah’s power.\n• Encouragement to reflect on nature and be grateful.\n• Warning against arrogance and heedlessness."
                },
                {
                  "reference": "Ayat 12–19: Luqman’s Advice to His Son",
                  "text": "• Luqman is granted wisdom by Allah.\n• He advises his son against associating partners with Allah (shirk).\n• Teaches gratitude, prayer, humility, and patience.\n• Emphasises respect for parents but prioritising Allah’s commands.\n• Encourages modesty in speech and behaviour."
                },
                {
                  "reference": "Ayat 20–34: Accountability and Knowledge of Allah",
                  "text": "• Allah’s blessings are countless and undeniable.\n• Disbelievers deny signs out of arrogance.\n• The truth of resurrection is affirmed.\n• Knowledge of the Hour, rain, wombs, future deeds, and place of death belongs solely to Allah.\n• Emphasis on trusting Allah’s wisdom and sovereignty."
                }
              ]
            },
            {
              "surah": "32. As-Sajdah",
              "posts": [
                {
                  "reference": "Ayat 1–11: Revelation and Creation",
                  "text": "• Quran’s revelation from the Lord of creation offers guidance and warning.\n• Allah’s power as Creator of heavens, earth, and everything in between.\n• Creation of man from clay and semen, ungratefulness despite blessings.\n• Disbelief in resurrection and meeting with Allah leads to inevitable soul retrieval."
                },
                {
                  "reference": "Ayat 12–22: Regret, Differentiation, and Reward",
                  "text": "• Criminals expressing regret in the Hereafter but denied another chance.\n• Believers’ distinction through prostration, glorification, charity, belief in the unseen, and humility.\n• Reward: Paradise for believers, punishment for disobedience.\n• Hell filled with jinn and mankind, contrasting believers and disbelievers."
                },
                {
                  "reference": "Ayat 23–30: Guidance, Judgment, and Reflection",
                  "text": "• Torah was given to Musa (AS) as guidance for the Children of Israel.\n• Appointment of leaders among the patient believers in Allah’s signs.\n• Allah’s judgment on the Day of Resurrection regarding people’s differences.\n• Reflecting on the destruction of past generations as signs from Allah.\n• Signs in nature like water provision."
                }
              ]
            },
            {
              "surah": "33. Al-Ahzab",
              "posts": [
                {
                  "reference": "Ayat 1–20: Obedience, Trust, and Battle",
                  "text": "• Obedience to Allah is emphasized.\n• Believers are urged to trust in Allah, who is sufficient as a Trustee and Disposer of affairs.\n• The Battle of the Trench showcases believers’ faith amid fear.\n• Hypocrisy’s consequences include miserliness and a lack of courage during adversity."
                },
                {
                  "reference": "Ayat 21–34: Example, Reward, and Support",
                  "text": "• Believers are encouraged to follow Prophet Muhammad’s (PBUH) example.\n• Allah fulfills His promises, strengthening believers’ faith and submission.\n• True believers remain steadfast, while hypocrites face punishment.\n• The Prophet’s (PBUH) wives are given guidance on chastity, obedience, and gratitude for revelation."
                },
                {
                  "reference": "Ayat 35–52: Qualities and Commands",
                  "text": "• Believers are encouraged to follow Prophet Muhammad’s (PBUH) example.\n• Allah’s support leads to victory and success against enemies.\n• Wives of the Prophet (PBUH) are given guidance on chastity, obedience, and gratitude for revelation."
                },
                {
                  "reference": "Ayat 53–68: Respect and Modesty",
                  "text": "• Proper etiquette in the Prophet’s (PBUH) house involves modesty and respect.\n• Allah’s omniscience encompasses all revealed and concealed matters.\n• Sending blessings upon the Prophet and respecting him are encouraged."
                },
                {
                  "reference": "Ayat 69–73: Admonition and Trust",
                  "text": "• An admonition from Musa (AS) story warns against annoying Allah’s chosen prophets.\n• Fear of Allah, truthfulness, and obedience lead to success and forgiveness.\n• Humanity accepted the trust of Allah, yet many act unjustly and ignorantly, facing consequences."
                }
              ]
            },
            {
              "surah": "34. Saba",
              "posts": [
                {
                  "reference": "Ayat 1–9: Praise and Certainty",
                  "text": "• Allah is praised as the Creator and Possessor of all things.\n• His knowledge encompasses all, including the certainty of the Hour.\n• Believers are promised forgiveness and provision, while disbelievers face torment.\n• Signs in the universe indicate Allah’s power and the truth of Muhammad’s revelation."
                },
                {
                  "reference": "Ayat 10–21: Blessings and Warnings",
                  "text": "• Prophet Dawud (AS) and Sulaiman (AS) received blessings and control over natural elements.\n• Disbelievers face severe consequences, as seen in the story of Solomon and the people of Sheba.\n• Allah’s power is demonstrated in punishment for defiance."
                },
                {
                  "reference": "Ayat 22–30: Oneness and Judgment",
                  "text": "• Believers are instructed to call upon Allah alone, as nothing else possesses power or authority.\n• Allah provides sustenance from the heavens and earth, and believers are not held accountable for the sins of disbelievers.\n• On the Day of Resurrection, all will be gathered, and Allah will judge."
                },
                {
                  "reference": "Ayat 31–36: Response and Criteria",
                  "text": "• Disbelievers reject the Quran and mock the believers, but on the Day of Judgment, they will blame each other for their disbelief.\n• Those who believe and do good deeds will receive twofold reward and dwell in Paradise, while those who oppose Allah’s signs will face torment."
                },
                {
                  "reference": "Ayat 37–45: Provision and Gathering",
                  "text": "• Nearness to Allah is attained through faith and righteous deeds, not through wealth or children.\n• Allah provides for whom He wills and replaces what is spent in His cause.\n• On the Day of Resurrection, people will be asked about their worship, and the truth will be made clear."
                },
                {
                  "reference": "Ayat 46–54: Call and Recognition",
                  "text": "• Believers are urged to stand for Allah’s sake and reflect on the Prophet’s life.\n• Disbelievers will regret their disbelief on the Day of Judgment.\n• Past disbelief led to a barrier between disbelievers and faith."
                }
              ]
            },
            {
              "surah": "35. Fatir",
              "posts": [
                {
                  "reference": "Ayat 1–7: Praise and Reminder",
                  "text": "• Allah is praised as the Creator of the heavens and earth.\n• People are reminded of Allah’s grace and the uniqueness of His provision.\n• Disbelief in Muhammad (PBUH) follows a pattern seen with previous messengers.\n• Warning against deception and consequences for disbelievers and believers are highlighted."
                },
                {
                  "reference": "Ayat 8–14: Guidance and Creation",
                  "text": "• Allah guides whom He wills.\n• His control over nature and power to create are demonstrated.\n• The distinctiveness of various entities is highlighted.\n• Muhammad (PBUH) is reminded of his duty as a warner.\n• Punishment for disbelievers is emphasized."
                },
                {
                  "reference": "Ayat 15–26: Dependence and Individual Responsibility",
                  "text": "• Humanity’s dependence on Allah is stressed.\n• Allah’s power to destroy and recreate humanity is mentioned.\n• Each person is accountable for their deeds.\n• The distinction between believers and disbelievers is highlighted.\n• Muhammad’s (PBUH) role as a warner and punishment for disbelievers are reiterated."
                },
                {
                  "reference": "Ayat 27–37: Signs and Reward",
                  "text": "• Allah’s signs in nature and rewards for the righteous are discussed.\n• The Quran is presented as truth and guidance for humanity.\n• Different responses to guidance are noted.\n• Description of Paradise and punishment for disbelievers are outlined."
                },
                {
                  "reference": "Ayat 38–45: Allah’s Knowledge and Challenge",
                  "text": "• Allah’s knowledge of the unseen and the consequences of disbelief are mentioned.\n• A challenge is posed to polytheists regarding their gods’ creations.\n• Disbelievers’ responses to warnings and lessons from history are discussed.\n• Respite given by Allah and accountability for deeds are emphasized."
                }
              ]
            },
            {
              "surah": "36. Ya-Sin",
              "posts": [
                {
                  "reference": "Ayat 1–12: Introduction and Warning",
                  "text": "• Introduction with “Ya-Sin” and declaration of the Quran’s wisdom.\n• Muhammad’s (PBUH) task was to warn the heedless.\n• Description of the punishment for those who reject the truth.\n• Warning of resurrection and accountability before Allah.\n• Recognition of Allah’s power to give life and record deeds."
                },
                {
                  "reference": "Ayat 13–32: Story of Messengers to a Town",
                  "text": "• The tale of messengers sent to a town and their initial rejection.\n• The messengers face mockery and threats from the townspeople.\n• Disbelievers are destroyed, reminiscent of past events.\n• Humanity is urged to reflect on history and heed warnings.\n• All will face Allah’s judgment."
                },
                {
                  "reference": "Ayat 33–50: Signs and Warnings",
                  "text": "• Signs of Allah’s power in the revival of dead land.\n• A believer warns of the consequences of disbelief.\n• Disbelievers face punishment unless Allah shows mercy.\n• Mockery and disbelief despite warnings.\n• Final warning of sudden punishment."
                },
                {
                  "reference": "Ayat 51–67: Resurrection and Justice",
                  "text": "• The trumpet is blown, signaling resurrection and accountability.\n• People realize the truth and face justice.\n• Reward for the righteous and punishment for the criminals.\n• Reminder not to worship Satan.\n• Deeds are witnessed by one’s own limbs.\n• Glorification of Allah’s power and exaltation."
                },
                {
                  "reference": "Ayat 68–83: Purpose and Creation",
                  "text": "• Allah grants life and reverses strength, showing His power.\n• The Quran serves as a reminder and justification.\n• Creation of animals for humanity’s benefit.\n• Rejection of truth despite clear signs.\n• Promise of resurrection.\n• Recognition of Allah’s supreme power over all as the Creator."
                }
              ]
            },
            {
              "surah": "37. As-Saffat",
              "posts": [
                {
                  "reference": "Ayat 1–21: Oaths and Affirmations",
                  "text": "• Oaths by angelic ranks and creations of Allah.\n• Affirmation of Allah’s oneness as the Lord of everything.\n• Adornment of the heavens with stars and angelic guards.\n• Mockery and denial of resurrection by disbelievers.\n• Realization of truth and regret on the Day of Judgment."
                },
                {
                  "reference": "Ayat 22–74: Accountability and Punishment",
                  "text": "• Wrongdoers assembled and led to Hellfire.\n• Blame shifting among companions but acknowledging self-transgression.\n• Punishment in Hellfire as recompense for deeds.\n• Description of Paradise for chosen slaves of Allah.\n• Questioning and regret among disbelievers.\n• Punishment and sharing torment with misguided fathers.\n• Ignoring warnings from past prophets."
                },
                {
                  "reference": "Ayat 75–113: Rewards and Trials of the Righteous",
                  "text": "• Invocation of Nuh (AS) and Allah’s rescue from the flood.\n• Reward for good-doers is exemplified through Nuh’s (AS) story.\n• Ibrahim’s (AS) pure faith and trial with the command to sacrifice his son.\n• Submission to Allah’s command.\n• Legacy of righteousness in Ibrahim (AS) and Ishaq (AS) despite deviations."
                },
                {
                  "reference": "Ayat 114–138: Grace and Legacy of Messengers",
                  "text": "• Allah’s grace upon Musa (AS) and Harun (AS), saving and guiding them.\n• Legacy of Musa (AS) and Harun (AS) among later generations.\n• Ilyas (AS) warned his people, but they denied him.\n• Reward for the good-doers exemplified through Musa (AS), Harun (AS), and Ilyas (AS)."
                },
                {
                  "reference": "Ayat 139–182: Stories of Other Prophets",
                  "text": "• Yunus (AS) fled but ended up preaching to believers after being swallowed by a fish.\n• Emphasis on sincere worship and threats to those attributing falsehood to Allah.\n• Idolaters disbelieve despite claims they follow the path of nations.\n• Affirmation of triumph for Allah’s messengers.\n• Warning of impending torment for disbelievers."
                }
              ]
            },
            {
              "surah": "38. Sad",
              "posts": [
                {
                  "reference": "Ayat 1–14: Disbelief and Opposition",
                  "text": "• The chapter begins by emphasizing the Quran’s reminder.\n• Disbelievers are described in false pride and opposition.\n• Destruction of past generations due to disbelief.\n• Disbelievers question Prophet Muhammad’s (PBUH) legitimacy.\n• Denial of the Quran’s message and source.\n• Punishment awaits those who reject the Quran."
                },
                {
                  "reference": "Ayat 15–26: Prophetic Trials and Virtues",
                  "text": "• Disbelievers await Judgment Day.\n• Prophet Muhammad (PBUH) is instructed to be patient.\n• Dawud’s (AS) strength and repentance are highlighted."
                },
                {
                  "reference": "Ayat 27–40: Creation and Treatment",
                  "text": "• Creation’s purpose and punishment for disbelief.\n• Distinction between believers and wrongdoers.\n• Quran is described as a blessed reminder.\n• Recounting Dawud’s (AS) repentance and oversight.\n• Sulaiman’s (AS) trial and powers are reiterated."
                },
                {
                  "reference": "Ayat 41–64: Rewards and Punishments",
                  "text": "• Ayyub’s (AS) afflictions and Allah’s mercy are recounted.\n• Virtues of various prophets are mentioned again.\n• Description of Paradise for the righteous.\n• Detailed depiction of hell for disbelievers.\n• Disputes among inhabitants of hell.\n• Consequences of disbelief and reward for righteousness."
                },
                {
                  "reference": "Ayat 65–88: Proclamation of Monotheism",
                  "text": "• Prophet Muhammad (PBUH) commanded to proclaim Allah’s oneness.\n• The creation of man and Iblis’ arrogance.\n• Iblis vows to mislead mankind.\n• Punishment awaits Iblis and his followers.\n• Quran’s purpose as a reminder.\n• Assurance that truth will prevail."
                }
              ]
            },
            {
              "surah": "39. Az-Zumar",
              "posts": [
                {
                  "reference": "Ayat 1–21: Revelation and Guidance",
                  "text": "• The Quran is from Allah, emphasizing the worship of Him alone.\n• Believers are urged to fear Allah, obey Him, and be patient.\n• Muhammad (PBUH) is commanded to worship Allah alone and warn against disbelief.\n• Hell’s torment is described, with glad tidings for the righteous."
                },
                {
                  "reference": "Ayat 22–41: Softening Hearts and Guidance",
                  "text": "• The Quran softens hearts and guides them to the right path.\n• Rejecters face torment on Judgment Day.\n• Disbelievers face disgrace and torment.\n• The Quran provides straightforward guidance and reminders."
                },
                {
                  "reference": "Ayat 42–52: Allah’s Sovereignty and Judgment",
                  "text": "• Allah determines life and death, and intercession belongs to Him alone.\n• Disbelievers show disgust at Allah’s message due to false contentment.\n• Wrongdoers cannot escape, nor win with wealth.\n• Mockers will face consequences, and provision is controlled by Allah."
                },
                {
                  "reference": "Ayat 53–63: Mercy, Repentance, and Remorse",
                  "text": "• Sincere repentance prevents despair of Allah’s mercy.\n• Regret is futile on Judgment Day; accept guidance before it’s too late.\n• Denying Allah’s signs leads to arrogance and loss.\n• The fate of the arrogant is torment in Hell."
                },
                {
                  "reference": "Ayat 64–75: Worship and Resurrection",
                  "text": "• Muhammad (PBUH) is commanded to reject polytheism and worship Allah alone.\n• Joining partners with Allah leads to loss.\n• Worship Allah alone and express gratitude.\n• On Judgment Day, all will be resurrected for reward or punishment."
                }
              ]
            },
            {
              "surah": "40. Ghafir",
              "posts": [
                {
                  "reference": "Ayat 1–20: Revelation and Warning",
                  "text": "• The Quran is revealed from Allah, who forgives and punishes.\n• Disbelievers dispute Allah’s signs facing punishment.\n• Angels seek forgiveness for believers, recognizing Allah’s mercy.\n• Disbelievers acknowledge sins on Judgment Day, regretting disbelief.\n• Allah judges with truth; disbelievers’ false gods cannot judge."
                },
                {
                  "reference": "Ayat 21–37: Reflection on History and Messengers",
                  "text": "• Past nations were punished for sins despite their strength.\n• Musa (AS) faced rejection from Pharaoh, who plotted against him.\n• A believer from Pharaoh’s family questions the wisdom of disbelief.\n• Fear of the Day of Mutual Calling between Hell and Paradise.\n• Yusuf’s (AS) signs were doubted, leading people astray."
                },
                {
                  "reference": "Ayat 38–60: Righteousness and Divine Intervention",
                  "text": "• A believer urges righteousness, contrasting it with disbelief.\n• The Hereafter is fleeting; the Hereafter is everlasting.\n• Evil deeds are repaid likewise; believers enter Paradise.\n• Salvation is contrasted with disbelievers’ path.\n• Trust in Allah leads to salvation; Allah saves the believer."
                },
                {
                  "reference": "Ayat 61–68: Divine Favor and Creator’s Power",
                  "text": "• Allah provides night and day, yet most show ingratitude.\n• Allah created all but people turn away from Him.\n• Disbelievers ignore Allah’s signs and will face punishment.\n• Allah gives life and causes death with a command.\n• Deniers of the Quran and messengers will face torment."
                },
                {
                  "reference": "Ayat 69–85: Punishment of Disbelievers and Signs of Allah",
                  "text": "• Disbelievers will wear iron collars, dragged into boiling water and fire.\n• In torment, disbelievers deny their lies and face consequences.\n• Arrogant sinners exalted on earth without truth, and now face Hell.\n• Muhammad (PBUH) is urged to be patient.\n• Messengers before Muhammad (PBUH) faced disbelief; Allah’s signs are evident."
                }
              ]
            },
            {
              "surah": "41. Fussilat",
              "posts": [
                {
                  "reference": "Ayat 1–8: Introduction and Divine Revelation",
                  "text": "• The chapter begins with “Ha-Mim” and asserts the Quran as Allah’s revelation, detailed in Arabic for understanding.\n• It brings glad tidings to believers and warnings to disbelievers, whose hearts are sealed against truth.\n• Muhammad (PBUH) proclaims Allah’s Oneness and warns against polytheism."
                },
                {
                  "reference": "Ayat 9–18: Challenge and Creation",
                  "text": "• Muhammad (PBUH) challenges disbelievers to consider the creation by Allah and the reason to submission to His will.\n• Allah created the universe in stages, adorning the lowest heaven with stars.\n• The fate of past nations like ‘Aad and Thamud serves as a warning to those who deny the truth."
                },
                {
                  "reference": "Ayat 19–25: Judgment and Realization",
                  "text": "• Disbelievers will be gathered to the Fire, with their own bodies testifying against them.\n• They will regret their denial of the truth and face punishment in the Fire.\n• Those who reject the Quran face severe punishment, while believers will find comfort and assurance."
                },
                {
                  "reference": "Ayat 26–32: Rejection and Punishment",
                  "text": "• Disbelievers reject the Quran and face severe punishment.\n• The Fire will be the eternal home of Allah’s enemies as a just recompense.\n• Believers are comforted by angels at death and assured of Paradise."
                },
                {
                  "reference": "Ayat 33–44: Righteous Actions and Accountability",
                  "text": "• The best speech and action is belief in Allah and righteous deeds.\n• Believers repel evil with good and remain patient.\n• Prostration is reserved for Allah, and disbelievers will be held accountable in the Hereafter."
                },
                {
                  "reference": "Ayat 45–54: Dispute and Recognition",
                  "text": "• Dispute arises over scriptures, but Allah’s decree prevails.\n• Each individual’s deeds will determine their fate, with no injustice from Allah.\n• Disbelievers seek refuge in false deities, but the truth of the Quran will become evident."
                }
              ]
            },
            {
              "surah": "42. Ash-Shuraa",
              "posts": [
                {
                  "reference": "Ayat 1–9: Introduction and Sovereignty",
                  "text": "• The chapter opens with divine revelations to Muhammad (PBUH).\n• Allah’s sovereignty over the heavens and earth is emphasized.\n• Angels seek forgiveness for mankind from Allah.\n• Allah warns against false protectors and asserts His guardianship.\n• The Quran’s purpose is to warn of the Day of Judgment."
                },
                {
                  "reference": "Ayat 10–19: Divine Decree and Guidance",
                  "text": "• Muhammad (PBUH) is commanded to trust in Allah’s decree.\n• Allah is recognized as the Creator and Provider.\n• Islam is the unified religion for all messengers.\n• Muhammad is tasked with inviting people to Islam and standing firm on it.\n• Allah’s authority is absolute, and the Hour may be near."
                },
                {
                  "reference": "Ayat 20–29: Desires and Justice",
                  "text": "• Those seeking the Hereafter’s reward will be rewarded.\n• False religions lead to punishment.\n• On the Day of Resurrection, believers will be rewarded after receiving their desires.\n• Good deeds are rewarded by Allah.\n• Allah’s justice is absolute, and His mercy is widespread."
                },
                {
                  "reference": "Ayat 30–43: Accountability and Signs",
                  "text": "• Misfortunes result from deeds, and Allah’s punishment or protection is absolute.\n• Natural phenomena are signs for the patient and grateful.\n• Allah may punish or forgive based on deeds.\n• Worldly pleasures are transient, while Paradise is eternal.\n• The virtues of the righteous are highlighted."
                },
                {
                  "reference": "Ayat 44–53: Guidance and Sovereignty",
                  "text": "• Allah guides whom He wills and sends astray whom He wills.\n• Wrongdoers will regret their deeds on the Day of Judgment.\n• Muhammad (PBUH) is called to admonish before an inevitable day from Allah.\n• Muhammad’s (PBUH) duty is to convey the message, and the sovereignty of Allah is reiterated."
                }
              ]
            },
            {
              "surah": "43. Az-Zukhruf",
              "posts": [
                {
                  "reference": "Ayat 1–9: Miracle of the Quran",
                  "text": "• The Quran’s clarity in Arabic is emphasized.\n• It’s revered as exalted and full of wisdom.\n• Disbelief is warned against due to extravagance.\n• Historical mockery of prophets is recounted.\n• Allah’s creation of the heavens and earth is acknowledged.\n• All will eventually return to Allah."
                },
                {
                  "reference": "Ayat 10–19: Questioning and Disbelief",
                  "text": "• People question Allah’s wisdom in granting daughters.\n• Disbelievers express displeasure at having daughters.\n• They reject the Quran and Muhammad (PBUH), calling it magic.\n• The truth brought by the Quran is denied.\n• Disbelievers face punishment for rejecting messengers."
                },
                {
                  "reference": "Ayat 20–29: Ibrahim (AS) Legacy",
                  "text": "• Ibrahim (AS) rejects idol worship and trusts Allah.\n• His monotheistic legacy endures among his descendants.\n• Disbelievers reject the Quran as magic.\n• People follow ancestral religions without scriptures.\n• Allah provides worldly goods until the truth is revealed.\n• The Hereafter surpasses temporary worldly enjoyments."
                },
                {
                  "reference": "Ayat 30–35: Quran’s Truth and Disbelief",
                  "text": "• Disbelievers dismiss the Quran due to its conveyer.\n• They believe wealthier individuals should have received revelations.\n• Allah’s wisdom in distributing provision is emphasized.\n• The transient nature of worldly possessions is highlighted.\n• The true value of the Hereafter is emphasized over worldly riches."
                },
                {
                  "reference": "Ayat 36–45: Satan’s Deception and Remembrance of Allah",
                  "text": "• Those who ignore Allah’s remembrance are misled by Satan.\n• Satan deceives, leading people astray.\n• Regret awaits those who follow Satan on Judgment Day.\n• Only Allah can guide the misguided.\n• Vengeance awaits disbelievers, even if Muhammad (PBUH) is gone.\n• Muhammad (PBUH) is instructed to hold fast to the Qur’an."
                },
                {
                  "reference": "Ayat 46–56: Musa (AS) and Pharaoh",
                  "text": "• Musa (AS) faces Pharaoh and his chiefs with signs, but they mock him.\n• Despite severe signs, Pharaoh persists in disbelief.\n• Pharaoh makes false promises to Musa (AS), and then breaks them.\n• Pharaoh boasts of his dominion and belittles Musa (AS).\n• He deceives his people and faces punishment by drowning."
                },
                {
                  "reference": "Ayat 57–67: Isa (AS) and Warning against Deception",
                  "text": "• People mock Isa (AS), debating his status.\n• Isa (AS) is described as a slave of Allah and a sign for Israelites.\n• Allah’s power is highlighted, a warning of the Hour.\n• Satan’s role in deception is emphasized.\n• Isa (AS) clarifies misunderstandings, urging obedience to Allah."
                },
                {
                  "reference": "Ayat 68–89: Reward and Punishment, Muhammad’s (PBUH) Concern",
                  "text": "• Believers are promised safety and Paradise.\n• Wrongdoers face eternal torment in Hell.\n• Allah’s all-knowing nature and exaltation are emphasized.\n• Muhammad (PBUH) is instructed to leave disbelievers to their fate.\n• Allah is the only God, and false deities hold no power.\n• Muhammad (PBUH) expresses concern for his people’s disbelief."
                }
              ]
            },
            {
              "surah": "44. Ad-Dukhan",
              "posts": [
                {
                  "reference": "Ayat 1–29: Revelation and Warning",
                  "text": "• Revealed on a blessed night in Ramadan, the Quran is a warning to disbelievers.\n• Allah decrees all matters on this night, sending mercy through messengers.\n• Disbelievers warned of impending punishment symbolized by a visible smoke.\n• The story of Musa (AS) highlights Pharaoh’s arrogance and punishment."
                },
                {
                  "reference": "Ayat 30–42: Salvation and Mockery",
                  "text": "• Allah saved the Children of Israel from Pharaoh’s tyranny.\n• The wrong chose due to skewed intention as the signs came to them.\n• Disbelievers mock resurrection, preferring proof from their forefathers.\n• Previous nations were destroyed due to disbelief.\n• Creation’s purpose is obedience or disobedience."
                },
                {
                  "reference": "Ayat 43–59: Torment and Reward",
                  "text": "• Sinners face torment with Zaqqum, boiling oil, and scalding water.\n• Punishment in Hell includes blazing fire and boiling water.\n• Pious rewarded with Paradise, gardens, springs, silk attire, and Houris.\n• Enjoyment in Paradise is Allah’s bounty.\n• Quran is made easy to remember; both believers and disbelievers await Judgment Day."
                }
              ]
            },
            {
              "surah": "45. Al-Jathiyah",
              "posts": [
                {
                  "reference": "Ayat 1–11: Revelation and Warning",
                  "text": "• The Quran is a divine revelation from Allah.\n• Signs of Allah’s wisdom are evident in creation, encouraging reflection.\n• Disbelievers who mock Allah’s verses face severe punishment in Hell.\n• The Quran guides and differentiates good from evil deeds.\n• Disbelievers will face unequal treatment in this life and the Hereafter."
                },
                {
                  "reference": "Ayat 12–21: Allah’s Favors and Guidance",
                  "text": "• Believers are urged to forgive and follow Allah’s clear commandments.\n• The Children of Israel were favored but differed after receiving knowledge.\n• The Quran provides clear guidance for those with firm faith.\n• Evil deeds lead to unequal treatment in this life and the Hereafter."
                },
                {
                  "reference": "Ayat 22–26: Purpose and Misguidance",
                  "text": "• Allah created the heavens and the earth with truth and will recompense everyone for their deeds.\n• Idolaters are misled by their desires as gods, and disbelief leads to mockery of the resurrection.\n• Allah gives life, causes death, and will judge mankind on the Day of Resurrection."
                },
                {
                  "reference": "Ayat 27–37: Sovereignty and Record of Deeds",
                  "text": "• Falsehood followers will lose everything on Judgment Day.\n• Allah’s record speaks truthfully, and believers will achieve true success.\n• Disbelievers, proud and mocking, will face punishment for their deeds.\n• Mockery of the Hour leads to eternal punishment."
                }
              ]
            },
            {
              "surah": "46. Al-Ahqaf",
              "posts": [
                {
                  "reference": "Ayat 1–10: Revelation and Challenge",
                  "text": "• The Quran is a divine revelation from Allah, challenging disbelievers to produce its equivalent.\n• Disbelievers mock the Quran and are warned of their stay in ness.\n• Muhammad (PBUH) humbly follows Allah’s revelations.\n• The testimony of a believing Israelite challenges disbelievers."
                },
                {
                  "reference": "Ayat 11–20: Mockery from Disbelievers",
                  "text": "• Disbelievers mock believers and reject the truth despite warnings.\n• The Quran confirms previous scriptures, providing security for believers.\n• Kindness to parents is enjoined upon believers, and Allah accepts their deeds.\n• Disbelievers reject the truth and mock resurrection."
                },
                {
                  "reference": "Ayat 21–26: Warning and Destruction",
                  "text": "• The people of Aad rejected warnings, leading to their destruction.\n• Allah’s punishment obliterated ‘Ad, despite their mockery of signs.\n• Surrounding towns were destroyed as a warning."
                },
                {
                  "reference": "Ayat 27–35: Destruction and Power",
                  "text": "• Disbelievers’ false deities vanish when needed, proving their vanity.\n• Responding to Allah’s call leads to forgiveness.\n• Allah’s power extends to giving life to the dead.\n• Patience is advised for Muhammad (PBUH), as disbelievers will realize the truth too late."
                }
              ]
            },
            {
              "surah": "47. Muhammad",
              "posts": [
                {
                  "reference": "Ayat 1–11: Fate and Command",
                  "text": "• Disbelievers hindering others will find their deeds in vain, while believers following truth have sins expiated.\n• Instructions for fighting disbelievers, with the possibility of being generous or taking ransom.\n• Martyrs will be guided to Paradise.\n• Believers aiding Allah’s cause are promised divine help."
                },
                {
                  "reference": "Ayat 12–19: Promise and Examples",
                  "text": "• Believers will enter Gardens, while disbelievers will suffer in the Fire.\n• Allah destroyed towns stronger than Makkah to drive out believers.\n• Paradise is described as a place of eternal bliss and forgiveness."
                },
                {
                  "reference": "Ayat 20–28: Hypocrisy and Reflection",
                  "text": "• Hypocrites express discomfort with Jihad, but obedience to Allah is better.\n• Allah questions whether one with authority would commit mischief.\n• Cursed hypocrites are made deaf and blind.\n• Disbelievers are urged to reflect on the Quran."
                },
                {
                  "reference": "Ayat 29–38: Trial and Command",
                  "text": "• Believers will be tested to distinguish the truthful from the liars.\n• Believers are commanded to obey Allah and His Messenger.\n• Disbelievers who hinder people from Allah’s path will have their deeds in vain.\n• Believers are urged to stand firm, as Allah is with them."
                }
              ]
            },
            {
              "surah": "48. Al-Fath",
              "posts": [
                {
                  "reference": "Ayat 1–10: Manifest Victory and Mission",
                  "text": "• Allah grants Muhammad (PBUH) a manifest victory and forgives past and future sins.\n• Believers will be admitted to the Gardens of Paradise.\n• Muhammad (PBUH) is sent as a witness, bearer of glad tidings, and warner.\n• Pledging allegiance to Muhammad (PBUH) is akin to pledging to Allah."
                },
                {
                  "reference": "Ayat 11–17: Excuses and Disbelief",
                  "text": "• Bedouins lagging behind ask for forgiveness with insincere tongues.\n• Hypocrites claim Muhammad (PBUH) and believers won’t return to their families, leading to their destruction.\n• Disbelievers face the torment of a blazing Fire for not believing in Allah and His Messenger."
                },
                {
                  "reference": "Ayat 18–26: Pleasure and Assistance",
                  "text": "• Allah is pleased with believers who pledged allegiance to Muhammad (PBUH).\n• Believers are promised abundant spoils and victories with Allah’s assistance.\n• If disbelievers fight believers, they will turn their backs and find no protector."
                },
                {
                  "reference": "Ayat 27–29: Vision and Purpose",
                  "text": "• Allah will fulfill the Prophet’s vision about entering the sacred mosque.\n• Muhammad’s (PBUH) mission is to make Islam superior over all religions.\n• Believers are described as severe against disbelievers and merciful among themselves."
                }
              ]
            },
            {
              "surah": "49. Al-Hujurat",
              "posts": [
                {
                  "reference": "Ayat 1–5: Respect and Patience",
                  "text": "• Believers should not put themselves before Allah and His Messenger.\n• Lower voices in the presence of the Prophet (PBUH) to avoid rendering deeds fruitless.\n• Senseless callers from behind dwellings lack patience and sense.\n• Patience is advised for those seeking the Prophet’s (PBUH) attention, as Allah is forgiving and merciful."
                },
                {
                  "reference": "Ayat 6–10: Verification and Resolution",
                  "text": "• Believers are advised to verify news to avoid harming others in ignorance.\n• Obedience to the Messenger prevents trouble.\n• Good deeds from Allah are acknowledged among believers.\n• Reconciliation should be sought in conflicts among believers with equitable resolution, as Allah loves the equitable."
                },
                {
                  "reference": "Ayat 11–18: Avoidance and Unity",
                  "text": "• Believers are warned against mockery, defamation, and insult, especially among different groups.\n• Avoid suspicion and backbiting, akin to consuming the flesh of one’s dead brother.\n• True faith requires obedience to Allah and His Messenger.\n• Allah is aware of everything, and embracing Islam is a favor from Him."
                }
              ]
            },
            {
              "surah": "50. Qaf",
              "posts": [
                {
                  "reference": "Ayat 1–15: Miraculous Revelation and Disbelief",
                  "text": "• Surah begins with “Qaf”, highlighting the miraculous Quran.\n• Disbelievers question the possibility of resurrection after a warner comes from among them.\n• Signs of Allah’s creation, including past nations’ destruction, are cited.\n• Disbelievers doubt the resurrection, but Allah asserts His power."
                },
                {
                  "reference": "Ayat 16–29: Divine Knowledge and Accountability",
                  "text": "• Allah knows mankind’s thoughts and whispers, recording their deeds.\n• Angels document every word uttered, and disbelievers will realize their fate at the death of one’s soul.\n• On the Day of Judgment, every person will be personally accountable, with angels bearing witness.\n• Sinners will face severe punishment for rejecting guidance."
                },
                {
                  "reference": "Ayat 30–45: Hell and Paradise, Creation, and Resurrection",
                  "text": "• Hell and Paradise will be questioned, and the pious promised entry into Paradise.\n• Destruction of past nations serves as a reminder.\n• Allah created the heavens, earth, and all in six days without fatigue.\n• The Day of Resurrection will be announced by a caller; all return to Allah."
                }
              ]
            },
            {
                "surah": "51. Adh-Dhariyat",
                "posts": [
                  {
                    "reference": "Ayat 1–9: Various Signs and Reactions",
                    "text": "• Allah swears by winds, clouds, ships, and angels, emphasizing Resurrection’s truth.\n• Reactions to Muhammad’s message vary, but turning away means defying Allah’s decree."
                  },
                  {
                    "reference": "Ayat 10–23: Cursing Liars and Reward of the Righteous",
                    "text": "• Liars who disregard the Hereafter are cursed.\n• Disbelievers will face trial by Fire for hastening Judgment Day.\n• The pious will enjoy Gardens and Springs for their good deeds."
                  },
                  {
                    "reference": "Ayat 24–46: Ibrahim's (AS) Guests and Punishment of Disbelieving Nations",
                    "text": "• Ibrahim (AS) hosts angels who predict a son, causing disbelief in his wife.\n• Messengers warn nations of polytheism and disobedience, often facing rejection.\n• Various nations are destroyed for rejecting their messengers."
                  },
                  {
                    "reference": "Ayat 47–60: Creation and Transgressions",
                    "text": "• Allah’s ability to create and expand the universe is highlighted.\n• Everything is created in pairs as a reminder.\n• Muhammad (PBUH) warns of worshipping Allah alone, emphasizing the believers’ reminder.\n• Disbelievers’ rejection signifies transgression.\n• Believers benefit from reminders to increase faith."
                  }
                ]
              },
              {
                "surah": "52. At-Tur",
                "posts": [
                  {
                    "reference": "Ayat 1–12: Swearing by Signs and Inevitability of Judgment",
                    "text": "• Allah swears by Mount Sinai, the Inscribed Book, the House over the heavens, and the filled sea.\n• The torment of Allah is inevitable, with no escape.\n• The Day of Judgment will be dreadful, shaking the heavens and mountains."
                  },
                  {
                    "reference": "Ayat 13–28: Punishment and Rewards",
                    "text": "• Disbelievers will face forceful entry into Hell as punishment.\n• The pious will delight in gardens and enjoy Paradise.\n• Inhabitants of Paradise thank Allah for His mercy.\n• Muhammad (PBUH) is reassured of his prophethood."
                  },
                  {
                    "reference": "Ayat 29–49: Rejection and Warning",
                    "text": "• False claims against Muhammad (PBUH) are refuted.\n• Disbelievers are challenged to produce something similar to the Quran.\n• They are questioned about their beliefs and intentions towards Muhammad (PBUH).\n• Disbelievers are warned of impending punishment.\n• Muhammad (PBUH) is advised to wait patiently and glorify Allah both day and night."
                  }
                ]
              },
              {
                "surah": "53. An-Najm",
                "posts": [
                  {
                    "reference": "Ayat 1–12: Divine Affirmation and Revelation",
                    "text": "• Allah swears by significant creations to emphasize the message’s importance.\n• Prophet Muhammad (PBUH) is praised for being on the right path and receiving divine inspiration.\n• The role of the mighty angel Jibra’il (AS) in conveying revelation is affirmed.\n• The Prophet’s (PBUH) authentic vision of Jibra’il (AS) is described."
                  },
                  {
                    "reference": "Ayat 13–25: Challenge to False Beliefs",
                    "text": "• The Prophet’s (PBUH) vision near Sidrat-ul-Muntaha is confirmed.\n• The Quran challenges pagans regarding idol worship, questioning the validity of their beliefs.\n• Allah’s omniscience and authority are reaffirmed.\n• Limitations of angelic intercession and criticism of false beliefs are highlighted."
                  },
                  {
                    "reference": "Ayat 26–32: Guidance and Accountability",
                    "text": "• The Prophet (PBUH) is instructed to distance himself from rejectors of the Quran.\n• Disbelievers are criticized for false beliefs and prioritizing worldly life.\n• Allah’s comprehensive knowledge is emphasized.\n• Each person is accountable for their actions."
                  },
                  {
                    "reference": "Ayat 33–62: Sovereignty and Reflection",
                    "text": "• Those who reject faith despite receiving knowledge are questioned.\n• Indications of accountability and Allah’s sovereignty over life and judgment are emphasized.\n• Destruction of past nations serves as a reminder of divine punishment.\n• The Day of Resurrection draws near, inviting reflection and submission to Allah."
                  }
                ]
              },
              {
              "surah": "54. Al-Qamar",
              "posts": [
                {
                  "reference": "Ayat 1–8: Signs and Rejection",
                  "text": "• Imminent Day of Judgment signaled by the splitting of the moon.\n• Despite signs, disbelievers persist in rejection.\n• Quran serves as a warning, settling matters by deeds.\n• Prophet (PBUH) instructed to withdraw from rejectors."
                },
                {
                  "reference": "Ayat 9–22: Tales of Warning",
                  "text": "• Narratives of Nuh (AS), Hud (AS), and Saleh (AS) emphasize the consequences of disbelief.\n• Aad and Thamud faced divine punishment for rejecting prophets.\n• Despite the Quran’s clarity, many ignore its message."
                },
                {
                  "reference": "Ayat 23–39: Divine Consequences",
                  "text": "• People of Lut (AS) and Shuaib (AS) rejected prophets and faced consequences.\n• Allah sent punishments like storms and earthquakes as warnings.\n• Quran remains accessible despite warnings and punishments."
                },
                {
                  "reference": "Ayat 40–55: Warning and Accountability",
                  "text": "• Quran warns repeatedly, accessible to seekers of guidance.\n• Disbelievers’ assumptions of victory are challenged; they’ll face divine judgment.\n• Every action is recorded, and accountable on Judgment Day.\n• Righteous rewarded with paradise near the Almighty King."
                }
              ]
            },
            {
              "surah": "55. Ar-Rahman",
              "posts": [
                {
                  "reference": "Ayat 1–13: Divine Blessings",
                  "text": "• Allah, the Most Merciful, gives humanity the Quran.\n• Creation of mankind and eloquent speech.\n• Celestial bodies and vegetation obey Allah’s command.\n• Establishment of balance and justice on earth.\n• Abundance of fruits and crops for sustenance."
                },
                {
                  "reference": "Ayat 14–25: Marvels of Creation",
                  "text": "• Creation of humans from clay and jinn from smokeless flame.\n• Allah’s dominion over the earth’s boundaries.\n• Pearls, coral, and ships as signs of Allah’s wonders.\n• Despite witnessing creation, which blessings will humanity deny?"
                },
                {
                  "reference": "Ayat 26–45: Transience and Accountability",
                  "text": "• Transience of earthly existence contrasted with Allah’s eternal majesty.\n• Allah’s management of daily affairs in the heavens and earth.\n• Humanity is challenged to surpass Allah’s authority.\n• Deniers face punishment and accountability on Judgment Day."
                },
                {
                  "reference": "Ayat 46–61: Reward in Paradise",
                  "text": "• True believers are rewarded with two gardens of paradise.\n• Delights include springs, fruits, and beautiful companions.\n• Denial of Allah’s blessings is questioned in the face of paradise’s rewards."
                },
                {
                  "reference": "Ayat 62–78: Abundance in Paradise",
                  "text": "• Additional gardens are rich with greenery and fruits.\n• Comfortable reclining on green cushions and luxurious mattresses.\n• Houris and fair maidens attend to inhabitants in pavilions.\n• Praise to Allah, the Owner of Majesty and Honor, concludes the passage."
                }
              ]
            },
            {
              "surah": "56. Al-Waqi'ah",
              "posts": [
                {
                  "reference": "Ayat 1–38: The Day of Resurrection",
                  "text": "• Inevitable event of the Day of Resurrection.\n• Fate of the righteous and luxuries of Paradise.\n• Punishment for disbelievers described vividly.\n• Affirmation of resurrection and judgment.\n• Allah’s creative power and call to reflection."
                },
                {
                  "reference": "Ayat 39–74: Assurance and Warning",
                  "text": "• Reassurance for the righteous and warning for disbelievers.\n• Description of Hell’s punishment.\n• Divine questions for reflection and gratitude.\n• Conclusion with glorification of Allah’s name."
                },
                {
                  "reference": "Ayat 75–96: Emphasis and Challenge",
                  "text": "• Oaths affirming the truth of the Qur’an.\n• Challenges to disbelievers regarding denial of signs.\n• Affirmation of death, afterlife, and different destinies.\n• Certainty of truth and glorification of Allah’s name."
                }
              ]
            },
            {
              "surah": "57. Al-Hadid",
              "posts": [
                {
                  "reference": "Ayat 1–10: Magnificence of Allah and Believers’ Duty",
                  "text": "• Glorification of Allah by all in the heavens and the earth.\n• Allah’s sovereignty, creation, and knowledge.\n• Invitation to believe in Allah and spend in His cause.\n• Manifest signs from Allah guiding humanity.\n• Encouragement to spend in charity for Allah’s cause."
                },
                {
                  "reference": "Ayat 11–19: Reward, Hypocrisy, and Punishment",
                  "text": "• Promise of reward for believers and punishment for hypocrites and disbelievers.\n• Invitation to lend a goodly loan to Allah.\n• Fate and regret of hypocrites.\n• Severe punishment for disbelievers and hypocrites in the Hereafter."
                },
                {
                  "reference": "Ayat 20–25: Transience of Worldly Life and Divine Decrees",
                  "text": "• Description of worldly life as transient and deceptive.\n• Encouragement to race towards forgiveness and Paradise.\n• Divine recording of every event and decree."
                },
                {
                  "reference": "Ayat 26–29: Prophets, Messages, and Divine Grace",
                  "text": "• Allah’s sending of prophets like Nuh (AS) and Ibrahim (AS).\n• The message of compassion and mercy through Isa (AS) and the Gospel.\n• Call to fear Allah, believe in Muhammad (PBUH), and receive abundant mercy.\n• Acknowledgement of Allah’s grace and His sovereignty over bestowing it."
                }
              ]
            },
            {
              "surah": "58. Al-Mujadila",
              "posts": [
                {
                  "reference": "Ayat 1-6",
                  "text": "• Allah’s awareness of disputes and complaints.\n• Prohibition and expiation for Zihar.\n• Strengthening faith through prescribed expiations.\n• Humiliation for those opposing Allah.\n• Accountability on Judgment Day."
                },
                {
                  "reference": "Ayat 7-13",
                  "text": "• Allah’s all-knowingness encompasses everything.\n• Condemnation of forbidden secret counsels.\n• Guidance for righteous secret counsels.\n• Influence of Satan on secret counsels.\n• Encouragement for charity and prayers."
                },
                {
                  "reference": "Ayat 14-22",
                  "text": "• Hypocrites befriending enemies of Allah.\n• Severe punishment for evil deeds.\n• Hindrance from the path of Allah.\n• Uselessness of wealth and lineage.\n• False confidence and satanic influence.\n• Humiliation for opposers and victory for Allah."
                }
              ]
            },
            {
              "surah": "59. Al-Hashr",
              "posts": [
                {
                  "reference": "Ayat 1-10",
                  "text": "• Glorification of Allah by everything in the heavens and earth.\n• Exile of disbelievers from their homes by Allah’s decree.\n• Allocation of spoils of war under Allah’s discretion.\n• Exemplary brotherhood among emigrants and supporters.\n• Supplication for forgiveness and removal of hatred."
                },
                {
                  "reference": "Ayat 11-17",
                  "text": "• Hypocritical promises of support to disbelieving Jews.\n• Division and intense enmity among Jews.\n• Deception of Satan leads to disbelief and eternal punishment."
                },
                {
                  "reference": "Ayat 18-24",
                  "text": "• Urging believers to fear Allah, be mindful of deeds, and prepare for the Hereafter.\n• Consequences of forgetting Allah leading to self-forgetfulness.\n• The incomparable power and awe of the Quran compared to a humbled mountain.\n• Mention of various attributes of Allah, emphasizing His knowledge, mercy, sovereignty, holiness, and creative power."
                }
              ]
            },
            {
              "surah": "60. Al-Mumtahanah",
              "posts": [
                {
                  "reference": "Ayat 1-3",
                  "text": "• Believers cautioned against befriending disbelievers who show enmity towards Islam.\n• Consequences highlighted if disbelievers gain dominance, treating believers harshly.\n• Reminder of the Day of Resurrection where familial ties won’t avail, emphasizes Allah’s omnipresence."
                },
                {
                  "reference": "Ayat 4-6",
                  "text": "• Ibrahim’s (AS) loyalty to Allah, severing ties due to disbelief.\n• Ibrahim’s (AS) compassionate plea for his father’s forgiveness.\n• Their conduct serves as a model for believers, trusting in Allah’s mercy."
                },
                {
                  "reference": "Ayat 7-10",
                  "text": "• Allah’s potential to facilitate reconciliation between believers and enemies.\n• Encouragement to treat those who didn’t fight or drive out believers fairly.\n• Exception regarding hostile opponents and instructions regarding emigrant women and marriage."
                },
                {
                  "reference": "Ayat 11-13",
                  "text": "• Compensation if a believer’s wife joins disbelievers.\n• Conditions for allegiance to the Prophet Muhammad.\n• Prohibition against befriending those who incurred Allah’s wrath, such as the despising Jews."
                }
              ]
            },
            {
           
            "surah": "61. As-Saf",
            "posts": [
              {
                "reference": "Ayat 1–5",
                "text": "•  Glorification of Allah by everything in heavens and earth.\n• Admonition against hypocrisy, detested by Allah.\n• Allah’s love for fighters in His cause is compared to disciplined rows.\n• Musa’s (AS) warning to his people for hurting him despite his status as Allah’s Messenger."
              },
              {
                "reference": "Ayat 6–9",
                "text": "• Isa (AS) confirms his status as Allah’s Messenger to the Children of Israel.\n• Consequences of fabricating lies about Allah are mentioned.\n- Assurance that Islam’s light will triumph.\n• Islam faced resistance, yet victory was granted."
              },
              {
                "reference": "Ayat 10–14",
                "text": "• Guidance to a trade saving from torment: belief, striving, and fighting for Allah.\n• Promise of forgiveness, admission to Paradise, and other blessings.\n• Call to be the helpers of Allah, echoing Isa’s (AS) call to his disciples.\n• Despite mixed responses, believers were granted power and dominance against enemies."
              }
            ]
          },
          {
            "surah": "62. Al-Jumu'ah",
            "posts": [
              {
                "reference": "Ayat 1–4",
                "text": "•  All creation in the heavens and earth glorifies Allah, recognizing His sovereignty.\n• Appointment of Prophet Muhammad (PBUH) among unlettered Arabs, purifying them and teaching the Quran.\n• The appointment of Prophet Muhammad (PBUH) and the Quran’s guidance reflect Allah’s grace."
              },
              {
                "reference": "Ayat 5–8",
                "text": "• Jews were entrusted with the Torah but failed, akin to a donkey carrying books.\n• Challenge for Jews: If exclusive friends of Allah, long for death.\n• Regardless of their fear or deeds, they will face it, and be held accountable by Allah."
              },
              {
                "reference": "Ayat 9–11",
                "text": "• Reminder to respond to the Jumu’ah prayer’s call, leaving worldly pursuits.\n• After prayer, believers are allowed to disperse, seeking sustenance from Allah.\n• While some may be distracted by worldly attractions, believers are reminded of Allah’s superior provisions."
              }
            ]
          },
          {
            "surah": "63. Al-Munafiqun",
            "posts": [
              {
                "reference": "Ayat 1–4",
                "text": "• Hypocrites falsely claim belief in Prophet Muhammad (PBUH) but are exposed as liars by Allah.\n• They use oaths to conceal their hypocrisy, obstructing others from Allah’s path.\n• Their sealed hearts result from initially believing and then disbelieving.\n• Despite appearing pleasant, they’re hollow inside, enemies of truth deserving Allah’s curse."
              },
              {
                "reference": "Ayat 5–8",
                "text": "• Allah doesn’t guide those rebellious against His command, whether the Prophet (PBUH) seeks forgiveness for them or not.\n• Hypocrites oppose Prophet’s (PBUH) followers, unaware that Allah owns all treasures.\n• They plot to expel the Prophet (PBUH), deluding themselves with power."
              },
              {
                "reference": "Ayat 9–11",
                "text": "• Believers warned against wealth or children diverting them from Allah, leading to loss.\n• Encouraged to spend from Allah’s wealth before death, avoiding regret.\n• Death brings no respite; Allah knows all actions and intentions."
              }
            ]
          },
          {
            "surah": "64. At-Taghabun",
            "posts": [
              {
                "reference": "Ayat 1–6",
                "text": "• Everything in the universe glorifies Allah, recognizing His dominion.\n• Allah created humanity and knows their actions, both concealed and revealed.\n- The heavens and the earth were created with truth.\n• Allah knows all, including the secrets within hearts.\n• Disbelievers face punishment for their rejection of guidance."
              },
              {
                "reference": "Ayat 7–10",
                "text": "• Disbelievers deny the resurrection, but they will be held accountable.\n• Belief in Allah, His Messenger, and the Quran is urged.\n• On the Day of Gathering, believers will be forgiven and enter Paradise.\n• Disbelievers will dwell in the Fire, the worst destination."
              },
              {
                "reference": "Ayat 11–14",
                "text": "• Calamities occur with Allah’s permission, guiding believers’ hearts.\n• Obedience to Allah and His Messenger is commanded.\n• Trust in Allah alone, for He is the only deity worthy of worship.\n• Beware of family members who may hinder obedience to Allah, but forgiveness is rewarded."
              },
              {
                "reference": "Ayat 15–18",
                "text": "• Wealth and children are trials from Allah, with true reward in Paradise.\n• Fear Allah, obey Him, and spend in charity to overcome covetousness.\n• Spending on Allah’s cause leads to doubled wealth and Allah’s forgiveness.\n• Allah is the All-Knower, All-Mighty, and All-Wise."
              }
            ]
          },
          {
            "surah": "65. At-Talaq",
            "posts": [
              {
                "reference": "Ayat 1–3",
                "text": "• Divorce should be executed with justice and mercy, respecting waiting periods and avoiding unjust expulsion from homes.\n• Allah provides from unexpected sources for those who trust in Him.\n• Trusting in Allah’s plan is sufficient, as He ensures the fulfillment of His purpose."
              },
              {
                "reference": "Ayat 4–7",
                "text": "• Divorced women have prescribed waiting periods, and Allah promises ease for those who fear Him.\n• Kind treatment of divorced women, especially during pregnancy, is emphasized.\n• Spending should be according to one’s means, and Allah promises ease after hardship."
              },
              {
                "reference": "Ayat 8–12",
                "text": "• Disobedient towns faced severe punishment in this world and the Hereafter.\n• Allah warns of severe torment for disbelievers.\n• The Qur’an serves as guidance from darkness to light, promising Paradise for believers.\n• Allah’s power and knowledge are demonstrated through His creation and command over all things."
              }
            ]
          },
          {
          "surah": "66. At-Tahrim",
          "posts": [
            {
              "reference": "Ayat 1–3: Divine Decree and Confidentiality",
              "text": "• The Prophet (PBUH) is questioned about his self-imposed restrictions, which Allah permits.\n• Allah ordains the dissolution of oaths for men, possessing ultimate wisdom and knowledge.\n• The Prophet (PBUH) confided in one wife, but she disclosed it. Allah revealed this, and the Prophet (PBUH) informed part and concealed part."
            },
            {
              "reference": "Ayat 4–7: Repentance and Warning",
              "text": "• Repentance is advised for the Prophet’s (PBUH) wives. If they conspire, Allah, Jibril (AS), righteous believers, and angels will oppose them.\n• Believers are warned to protect themselves from the Fire, with stern angels overseeing it.\n• Disbelievers will find no excuse on Judgment Day."
            },
            {
              "reference": "Ayat 8–12: Sincere Repentance and Striving",
              "text": "• Sincere repentance may lead to forgiveness and admission to Paradise.\n• The Prophet (PBUH) is instructed to strive against disbelievers and hypocrites, as their destination is Hell.\n• Examples of betrayal and righteousness from the wives of Nuh (AS) and Lut (AS), and the wife of Pharaoh and Maryam (RA), offer lessons."
            }
          ]
        },
        {
          "surah": "67. Al-Mulk",
          "posts": [
            {
              "reference": "Ayat 1–7: Creation and Torment",
              "text": "• Allah’s dominion over all is praised, with life and death serving as tests for humanity.\n• Eventful creation of the heavens.\n• Celestial lamps adorn the nearest heaven, serving as missiles against devils.\n• Disbelievers will face the torment of Hell, experiencing its fierce intake of breath."
            },
            {
              "reference": "Ayat 8–14: Hell and Divine Knowledge",
              "text": "• Hell’s fury awaits the disbelievers, who will regret rejecting warnings.\n• Eventually, they’ll confess their sins, but it will be too late.\n• Righteousness will be rewarded, as Allah knows the secrets of hearts.\n• His omniscience demands trust and acknowledgment as the Most Kind."
            },
            {
              "reference": "Ayat 15–22: Divine Sustenance and Guidance",
              "text": "• Allah provides sustenance and warns against divine retribution.\n• Past communities faced severe punishment for disbelief.\n• Disbelievers reject the truth, deluded in their beliefs.\n• Allah’s guidance is likened to a straight path amidst blindness."
            },
            {
              "reference": "Ayat 23–30: Inquiry and Divine Mercy",
              "text": "• Disbelievers mockingly question the timing of the Day of Resurrection.\n• Only Allah knows this, leaving disbelievers in fear and grief.\n• Believers affirm their faith and reliance on Allah, challenging disbelievers about their water sources."
            }
          ]
        },
        {
          "surah": "68. Al-Qalam",
          "posts": [
            {
              "reference": "Ayat 1–9: Prophet Muhammad’s (PBUH) Nobility",
              "text": "• The Surah starts with an oath by the pen, emphasizing knowledge and writing.\n• Prophet Muhammad (PBUH) is assured of his grace from Allah and deserves endless rewards.\n• He is praised for his exalted character, and people are challenged to discern his true state."
            },
            {
              "reference": "Ayat 10–25: Punishment for Disbelief",
              "text": "• Characteristics of the wicked are outlined, and punishment for disbelief is warned.\n• A parable of a garden destroyed due to neglect serves as a reminder of divine punishment.\n• The disbelievers lament their loss, blame each other, and hope for redemption."
            },
            {
              "reference": "Ayat 26–33: Reflection and Redemption",
              "text": "• The people’s regret and acknowledgment of wrongdoing are highlighted.\n• They are advised to acknowledge Allah’s will and seek forgiveness.\n• Despite blaming each other, they hope for redemption and realize the severity of punishment in the Hereafter."
            },
            {
              "reference": "Ayat 34–41: Reward and Day of Resurrection",
              "text": "• The righteous will be rewarded with gardens of delight, distinguishing believers from disbelievers.\n• People are urged to reflect on the judgment and illusions of control.\n• False claims will be exposed on the Day of Resurrection, challenging people’s assumptions."
            },
            {
              "reference": "Ayat 42–52: Divine Respite and Purpose of the Quran",
              "text": "• The Day of Resurrection will reveal the true state of people’s faith.\n• Hypocrites and deniers will face punishment, but Allah’s plan is strong.\n• People are advised to await Allah’s decree with patience and reflect on the purpose of the Quran."
            }
          ]
        },
        {
          "surah": "69. Al-Haqqah",
          "posts": [
            {
              "reference": "Ayat 1–10: Certainty of Resurrection",
              "text": "• The Surah emphasizes the certainty of the Day of Resurrection.\n• Rhetorical questions underscore the significance of this event.\n• The denial of the Day of Judgment by past civilizations led to their destruction.\n• Thamud and Aad were annihilated by natural disasters due to their disbelief.\n• Disobedience to Allah’s messengers results in severe punishment."
            },
            {
              "reference": "Ayat 11–18: Day of Resurrection’s Events",
              "text": "• The Day of Resurrection will commence with the blowing of the Trumpet.\n• Cosmic disturbances will occur, with mountains crushed and the heavens splitting.\n• Angels will support Allah’s Throne, and every individual will be held accountable."
            },
            {
              "reference": "Ayat 19–37: Fate of the Righteous and Wicked",
              "text": "• The righteous will rejoice in Paradise, enjoying the fruits of their deeds.\n• The wicked will regret their disbelief and face severe punishment in Hell.\n• Wealth and power will not avail them on that Day."
            },
            {
              "reference": "Ayat 38–52: Quran’s Divine Revelation",
              "text": "• The Quran is distinguished from poetry and soothsaying.\n• Prophet Muhammad (PBUH) is warned against fabricating falsehood about Allah.\n• The Quran serves as a reminder and will be a source of anguish for deniers on the Day of Resurrection.\n• The Surah concludes with a command to glorify Allah."
            }
          ]
        },
        {
          "surah": "70. Al-Ma'arij",
          "posts": [
            {
              "reference": "Ayat 1–5: Divine Retribution and the Day of Judgment",
              "text": "• A challenger asks about the punishment bound to happen.\n• The Day of Judgment is inevitable, and there is no escape.\n• Its punishment is from Allah, the Owner of the ways of ascent.\n• The angels and the Spirit ascend to Him in a day whose span is fifty thousand years.\n• The Prophet (PBUH) is instructed to be patient with a beautiful patience."
            },
            {
              "reference": "Ayat 6–18: Characteristics of the People of Hell",
              "text": "• The disbelievers will wish they could be saved from the punishment.\n• The Day of Judgment will be a difficult day for the disbelievers.\n• People will be willing to ransom their closest relatives to escape the punishment."
            },
            {
              "reference": "Ayat 19–35: Characteristics of the Righteous",
              "text": "• Human beings are created anxious.\n• The righteous are constant in prayer and those who give a fixed portion of their wealth."
            },
            {
              "reference": "Ayat 36–44: Reassurance and Warning",
              "text": "• Disbelievers mockingly rush towards the Prophet (PBUH).\n• The Surah concludes with a reassurance that the disbelievers will not be left unaccountable."
            }
          ]
        },
        {
        "surah": "71. Nuh",
        "posts": [
          {
            "reference": "Ayat 1–9: Prophet Nuh’s (AS) Mission and Appeal",
            "text": "• Prophet Nuh’s (AS) was sent by Allah to warn his people of impending torment.\n• He straightforwardly informs them of his role and calls them to worship Allah alone.\n• Nuh promises forgiveness and respite, persistently urging his people day and night.\n• Despite his efforts, they reject his message, displaying pride and obstinacy."
          },
          {
            "reference": "Ayat 10–20: Prophet Nuh’s (AS) Advice and Reflection",
            "text": "• Prophet Nuh (AS) advises seeking forgiveness for abundant blessings and questions their disbelief.\n• Reflections on Allah’s creation of humans, skies, and death.\n• Acknowledges Allah’s vast creation, making the earth spacious for travel."
          },
          {
            "reference": "Ayat 21–28: Consequences and Prayers",
            "text": "• Prophet Nuh’s (AS) people disobeyed and followed leaders, leading to their drowning and entry into the Fire.\n• Nuh prays for the destruction of disbelievers to prevent further misguidance.\n• He seeks forgiveness for believers and seeks destruction only for wrongdoers."
          }
        ]
      },
      {
        "surah": "72. Al-Jinn",
        "posts": [
          {
            "reference": "Ayat 1–10: The Encounter with the Quran",
            "text": "• Djinns listened to the Quran, affirmed belief in Allah, and vowed monotheism.\n• They repented past folly, acknowledging Allah’s majesty and humanity’s truthfulness.\n• Attempted ascent to heaven failed; ambush awaits eavesdroppers.\n• Uncertainty shrouds divine messages and earthly intentions."
          },
          {
            "reference": "Ayat 11–19: Diverse Reactions and Destinies",
            "text": "• Among Djinns, righteousness and deviation coexist, with inescapable punishment for disbelievers.\n• Belief in Allah fosters fearlessness; sinners mislead.\n• Mosques are dedicated exclusively to Allah.\n• Disbelievers face torment, while believers are promised abundant rain and protection."
          },
          {
            "reference": "Ayat 20–28: Prophet’s (PBUH) Role and Allah’s Sovereignty",
            "text": "• Prophet Muhammad (PBUH) invokes Allah alone, unable to guide or harm others.\n• Disobedience leads to eternal punishment; Allah’s knowledge encompasses the unseen.\n• Messengers are guarded until their mission’s completion, surrounded by Allah’s encompassing knowledge."
          }
        ]
      },
      {
        "surah": "73. Al-Muzzammil",
        "posts": [
          {
            "reference": "Ayat 1–7: Call to Night Prayer",
            "text": "• Allah addresses the Prophet Muhammad (PBUH) as “the one wrapped in garments” and instructs him to spend a significant part of the night in prayer and recitation of the Quran.\n• This period of night worship is highlighted as beneficial for developing spiritual strength and sincerity."
          },
          {
            "reference": "Ayat 8–14: Devotion and Patience",
            "text": "• These verses emphasize devoting oneself exclusively to Allah and being patient with the opposition from disbelievers.\n• The Prophet (PBUH) is advised to dedicate himself to the worship of Allah and to be patient with what is said by the disbelievers."
          },
          {
            "reference": "Ayat 15–19: Warning to Disbelievers and Day of Judgment",
            "text": "• The surah references the story of Musa (AS) and Pharaoh to illustrate the fate of those who oppose divine messengers.\n• It warns disbelievers of the severe consequences they will face on the Day of Judgment, encouraging them to heed the warnings."
          },
          {
            "reference": "Ayah 20: Ease in Worship",
            "text": "• The final verse offers a concession, recognizing the difficulty of maintaining long hours of nightly prayer.\n• Encouraging to recite what is easy for them from the Quran.\n• Allah emphasizes the importance of consistency.\n• Believers are to pray and recite the Quran as much as they can manage, balancing their spiritual duties with practical life, and are reminded to perform regular prayers, give charity, and seek Allah’s forgiveness."
          }
        ]
      },
      {
        "surah": "74. Al-Muddaththir",
        "posts": [
          {
            "reference": "Ayat 1–12: Command to Warn",
            "text": "• Muhammad (PBUH) is commanded to rise and warn the people.\n• He (PBUH) is instructed to magnify his Lord and purify his garments.\n• The Day of Judgment is described as hard, especially for disbelievers.\n• Arrogance and denial of the truth are highlighted, leading to severe punishment."
          },
          {
            "reference": "Ayat 13–25: Consequences of Disbelief",
            "text": "• Those ungrateful for Allah’s blessings face severe punishment.\n• Disbelievers are cursed for their arrogance and opposition.\n• They refuse to accept the truth, attributing it to magic.\n• Their plotting and denial lead to their downfall."
          },
          {
            "reference": "Ayat 26–31: Divine Punishment",
            "text": "• Disbelievers will be cast into Hellfire, an intense punishment.\n• Hell-fire causes sinners regret, remorse, and immense suffering.\n• Angels guarding Hell-fire serve as a trial and confirmation of truth.\n• Oaths by the natural phenomena emphasize the severity of Hell-fire."
          },
          {
            "reference": "Ayat 32–40: Warning and Accountability",
            "text": "• Hellfire serves as a warning and reminder for humanity.\n• Every person is accountable for their deeds.\n• Righteous believers will be rewarded in Paradise.\n• Oaths by the moon, night, and dawn emphasize the severity of Hellfire."
          },
          {
            "reference": "Ayat 41–56: Questioning in Hell-fire",
            "text": "• Inhabitants of Hell-fire will be questioned about their deeds.\n• Reasons for damnation include not attending to prayer and denying the Day of Reckoning.\n• Disbelievers won’t benefit from intercession.\n• The Qur’an serves as admonition and reminder, but guidance is for those whom Allah wills."
          }
        ]
      },
      {
        "surah": "75. Al-Qiyamah",
        "posts": [
          {
            "reference": "Ayat 1–11: Emphasis on Resurrection",
            "text": "• Oaths by the Day of Resurrection underscore its seriousness.\n• The self-reproaching believer highlights consciousness of actions and repentance.\n• Allah asserts His power over resurrection, even reconstructing fingertips perfectly.\n• Disbelievers persist in sin despite the denial of the resurrection."
          },
          {
            "reference": "Ayat 12–21: Accountability and Excuses",
            "text": "• Individuals will be informed of their deeds and act as witnesses against themselves.\n• Attempts to offer excuses for deeds will be denied.\n• The Quran’s revelation and recitation to Muhammad show divine control.\n• Disbelievers’ love for the worldly life leads to denial of resurrection."
          },
          {
            "reference": "Ayat 22–30: Reactions on Resurrection Day",
            "text": "• Some faces will shine while others darken, reflecting individual fates.\n• Fear and panic will fill those facing doom.\n• The stages of death approaching the dead lead to the realization of its inevitability.\n• Ultimately, all souls will submit to divine authority."
          },
          {
            "reference": "Ayat 31–40: Warning and Disbelief",
            "text": "• Disbelievers neglected religious obligations like belief in the Qur’an and prayer.\n• Despite disbelief, they walk proudly among family, admiring themselves.\n• Warnings emphasize the consequences of disbelief and neglect.\n• Allah’s ability to create and resurrect is underscored, highlighting His power."
          }
        ]
      },
      {
          "surah": "76. Al-Insan",
          "posts": [
            {
              "reference": "Ayat 1-12: Creation and Rewards",
              "text": "• Man’s creation from a humble beginning highlights his faculties and choice.\n• Disbelievers face severe punishment; the pious are promised abundant rewards.\n• Pious traits include fulfilling vows and feeding the needy.\n• Allah intervenes to save the pious, granting them Paradise’s luxuries."
            },
            {
              "reference": "Ayat 13-22: Description of Paradise",
              "text": "• Detailed descriptions of Paradise emphasize its comforts and beauty.\n• Eternal youth, shade, and delights await its inhabitants.\n• They will be served drinks in vessels of silver and crystal.\n• Paradise offers everlasting delights as rewards for believers’ efforts."
            },
            {
              "reference": "Ayat 23-31: Revelation and Guidance",
              "text": "• The Qur’an’s gradual revelation stresses patience and obedience.\n• Believers are urged to remember Allah consistently, maintaining a divine connection.\n• Disbelievers prioritize worldly pleasures over the Day of Judgment.\n• Allah’s will determines mercy and punishment, guiding those who heed admonition."
            }
          ]
        },
        {
          "surah": "77. Al-Mursalat",
          "posts": [
            {
              "reference": "Ayat 1-13: Oaths and Promised Day",
              "text": "• Various natural phenomena are sworn upon, highlighting Allah’s power.\n• The Day of Judgment is inevitable, with celestial signs and a gathering of messengers.\n• These signs serve as a reminder of the Sorting Out Day."
            },
            {
              "reference": "Ayat 14-23: Warning and Creation",
              "text": "• Deniers are warned of their fate, referencing past generations.\n• Human creation and gestation in the womb showcase Allah’s wisdom.\n• Provision of sustenance on earth underscores Allah’s benevolence."
            },
            {
              "reference": "Ayat 24-31: Consequences and Hellfire",
              "text": "• Denial of the Day of Resurrection leads to Hell’s torment.\n• Hellfire’s intensity and residence are vividly described.\n• Disbelievers will lack shade and face fierce flames."
            },
            {
              "reference": "Ayat 32-40: Day of Judgment and Invitation",
              "text": "• The Day of Judgment brings accountability with no escape.\n• Pious believers are invited to shade, springs, and fruits as rewards.\n• Disbelievers’ rejection of prayer highlights ingratitude towards Allah."
            },
            {
              "reference": "Ayat 41-50: Reward and Challenge",
              "text": "• Pious believers are promised comfort and rewards, contrasting with disbelievers’ woe.\n• Disbelievers are urged to enjoy worldly pleasures briefly.\n• A rhetorical question challenges deniers to find belief after the Quran."
            }
          ]
        },
        {
          "surah": "78. An-Naba",
          "posts": [
            {
              "reference": "Ayat 1-5: Question of Great News",
              "text": "• Introduction with a question about the “great news”, encompassing Islamic Monotheism, the Qur’an, and the Day of Resurrection.\n• Despite the disagreement, eventual knowledge of the truth is asserted."
            },
            {
              "reference": "Ayat 6-17: Divine Creations and Provisions",
              "text": "• Description of Allah’s creations and provisions, including the earth, mountains, sleep, night, and day.\n• Mention of the seven-strong heavens, the sun, rain, and vegetation."
            },
            {
              "reference": "Ayat 18-30: Day of Decision and Recompense",
              "text": "• Description of the Day of Judgment, trumpet blowing, resurrection, opening heavens, and moving mountains.\n• Hell is depicted as punishment for transgressors, facing torment for denying Allah’s signs."
            },
            {
              "reference": "Ayat 31-40: Success for the Righteous and Warning",
              "text": "• Success promised to the righteous in Paradise, with gardens, grape-yards, and companionship.\n• Reward from Allah on the Day of Truth, warning of impending torment for disbelievers, leading to regret."
            }
          ]
        },
        {
          "surah": "79. An-Nazi'at",
          "posts": [
            {
              "reference": "Ayat 1-7: Oaths by Angels and the Day of Judgment",
              "text": "• Oaths by various groups of angels emphasize their roles in the cosmic order.\n• Descriptions of the earthquake and resurrection depict the terror of the Day of Judgment.\n• Trumpet-blowing signals events like death and resurrection."
            },
            {
              "reference": "Ayat 8-14: Fear and Resurrection",
              "text": "• Disbelievers experience fear and anxiety on the Day of Judgment.\n• Some express skepticism about resurrection but are confronted with its reality."
            },
            {
              "reference": "Ayat 15-26: Story of Prophet Musa (AS) and Pharaoh",
              "text": "• Pharaoh’s arrogance and disobedience lead to divine punishment.\n• Despite witnessing miraculous signs, Pharaoh denies it and faces consequences.\n• The story serves as a cautionary tale against arrogance and disobedience."
            },
            {
              "reference": "Ayat 27-37: Divine Creation and Provision",
              "text": "• Reflection on Allah’s majestic creation and blessings like water and mountains.\n• Warning about the impending catastrophe of the Day of Recompense."
            },
            {
              "reference": "Ayat 38-46: Outcome of Choices, Paradise, and Hell",
              "text": "• Destiny contrasts between those who feared Allah and those who indulged in worldly desires.\n• Paradise awaits the righteous, while Hell-fire awaits transgressors.\n• Prophet Muhammad (PBUH) is reminded of his role as a warner, and the suddenness of the Day of Judgment is emphasized."
            }
          ]
        },
        {
          "surah": "80. Abasa",
          "posts": [
            {
              "reference": "Ayat 1-7: Reproach of the Prophet (PBUH)",
              "text": "• Incident of the Prophet Muhammad (PBUH) not attending to a blind man seeking guidance.\n• Questioning the Prophet’s (PBUH) reaction, emphasizing his duty to convey the message to all.\n• Reminder of the Prophet’s (PBUH) duty regardless of the listener’s status."
            },
            {
              "reference": "Ayat 8-17: Reprimand and Admonition",
              "text": "• Admonishment of the Prophet (PBUH) for neglecting the blind man in favor of the Quraysh leaders.\n• Emphasis on the Qur’an’s value as a source of admonition and guidance.\n• Condemnation of those who reject the Qur’an’s message."
            },
            {
              "reference": "Ayat 18-32: Creation and Provision",
              "text": "• Reflection on the stages of human creation and Allah’s provision for humanity.\n• Description of various grains, fruits, and vegetation provided by Allah."
            },
            {
              "reference": "Ayat 33-42: Day of Resurrection",
              "text": "• Description of the chaos and abandonment on the Day of Resurrection.\n• Contrast between the bright faces of believers and the dark faces of disbelievers.\n• Rejoicing of believers at the news of Paradise and despair of disbelievers."
            }
          ]
        },
        {
        "surah": "81. At-Takwir",
        "posts": [
          {
            "reference": "Ayat 1–7: Cosmic Signs of the Last Day",
            "text": "• Description of apocalyptic events like the sun losing light and stars falling.\n• Indications of the impending Day of Judgment through natural upheavals.\n• Even steadfast mountains and creatures experience turmoil.\n• Symbolic imagery of seas turning into fire or overflowing.\n• Resurrection and accountability before Allah."
          },
          {
            "reference": "Ayat 8–14: Justice and Reckoning",
            "text": "• Condemnation of burying female infants alive as an injustice to be accounted for.\n• Reckoning of every person's deeds before Allah.\n• Dramatic cosmic changes herald the Day of Judgment.\n• Awareness of deeds and their consequences."
          },
          {
            "reference": "Ayat 15–21: Swearing Oaths and Honorable Messenger",
            "text": "• Solemn swearing by cosmic phenomena.\n• The Quran is the word of the honorable messenger Jibril (AS), sent by Allah.\n• Jibril’s (AS) obedience and trustworthiness validate the Quranic message."
          },
          {
            "reference": "Ayat 22–29: Validation of Prophet Muhammad (PBUH)",
            "text": "• Assurance to companions regarding Prophet Muhammad’s (PBUH) sanity and vision of Gabriel.\n• Muhammad (PBUH) does not withhold knowledge and speaks only what is revealed by Allah.\n• The Quran is a divine revelation, not from Satan, serving as a reminder and guidance dependent on Allah’s will."
          }
        ]
      },
      {
        "surah": "82. Al-Infitar",
        "posts": [
          {
            "reference": "Ayat 1–5: Dramatic Signs",
            "text": "• Depiction of cosmic events heralding the Day of Judgment.\n• Splitting of the heavens, falling stars, bursting seas, and upheaval of graves.\n• Precursor to the accountability of every individual for their deeds.\n• Awareness of actions and consequences on the Day of Judgment."
          },
          {
            "reference": "Ayat 6–12: Reminder of Creation and Denial",
            "text": "• Reminder of humanity’s creation by the Most Generous.\n• Despite blessings and signs, denial of recompense is common.\n• Angels are appointed to record human deeds meticulously.\n• Recording of both good and bad deeds for accountability."
          },
          {
            "reference": "Ayat 13–19: Destinies and Punishment",
            "text": "• Righteous enjoy Paradise, while the wicked suffer in Hell.\n• Inescapable punishment for the wicked on the Day of Recompense.\n• Emphasis on the significance of the Day of Judgment.\n• All decisions on that day are solely in Allah’s hands."
          }
        ]
      },
      {
        "surah": "83. Al-Mutaffifin",
        "posts": [
          {
            "reference": "Ayat 1–9: Warning Against Injustice",
            "text": "• Woe to those who cheat in measurements and weights, depriving others.\n• They demand full measure but give less when it’s their turn.\n• Misdeeds are recorded in Sijjin, a register of evildoers."
          },
          {
            "reference": "Ayat 10–16: Doom for Deniers",
            "text": "• Woe on Judgment Day for those denying Allah’s existence and divine judgment.\n• Dismissing the Quran as ancient tales.\n• Veiled hearts from recognizing truth due to past sins.\n• Inescapable punishment awaits, veiled from seeing the Lord."
          },
          {
            "reference": "Ayat 17–28: Recognition and Reward",
            "text": "• Deniers are confronted with the reality they denied.\n• Deeds of the righteous recorded in ‘Illiyyun, closest to Allah.\n• Reward in Paradise: thrones, pure wine, musk fragrance, Tasnim water."
          },
          {
            "reference": "Ayat 29–36: Mockery and Retribution",
            "text": "• Criminals mock believers in worldly life.\n• Believers will laugh at disbelievers on Judgment Day.\n• Retribution awaits disbelievers for their deeds."
          }
        ]
      },
      {
        "surah": "84. Al-Inshiqaq",
        "posts": [
          {
            "reference": "Ayat 1–6: Signs and Obedience",
            "text": "• Signs of the Hour include the sky splitting and the earth stretching.\n• The heavens and earth obey Allah unquestioningly.\n• Humanity will return to their Lord, facing the consequences of their deeds."
          },
          {
            "reference": "Ayat 7–19: Reckoning and Misjudgment",
            "text": "• Those with records in their right hand will rejoice.\n• Regret awaits those with records behind their backs.\n• Deluded by disbelief, they thought they wouldn’t return to Allah."
          },
          {
            "reference": "Ayat 20–25: Unbelief and Warning",
            "text": "• Disbelievers reject the Quran and Prophet Muhammad (PBUH).\n• They deny accountability for their deeds.\n• A painful punishment awaits, except for the believers promised Paradise."
          }
        ]
      },
      {
        "surah": "85. Al-Buruj",
        "posts": [
          {
            "reference": "Ayat 1–3: Divine Oaths",
            "text": "• Allah swears by the towering sky and the Day of Resurrection, highlighting the significance of the message.\n• Oaths are taken by the sky containing great stars and the Day of Resurrection, emphasizing their importance."
          },
          {
            "reference": "Ayat 4–7: Persecution",
            "text": "• The cursed people of the ditch tormented believers and kindled fires to harm them.\n• Despite witnessing the cruelty, they did nothing to stop it.\n• Innocent believers faced persecution solely for their faith in Allah."
          },
          {
            "reference": "Ayat 8–12: Belief and Reward",
            "text": "• Believers endured persecution for their faith in Allah, the Sovereign of the heavens and the earth.\n• Torment awaits persecutors who refuse to repent, while believers will be rewarded with Gardens beneath which rivers flow.\n• Allah’s punishment is severe, but His mercy is also abundant for the righteous."
          },
          {
            "reference": "Ayat 13–16: Divine Authority",
            "text": "• Allah initiates punishment and repeats it in the Hereafter, yet He is forgiving and compassionate to believers.\n• He is the Possessor of the glorious throne, acting according to His will."
          },
          {
            "reference": "Ayat 17–22: Historical Lessons",
            "text": "• Stories of Pharaoh’s host and the people of Thamud serve as reminders of the consequences of disbelief.\n• Despite warnings and signs, disbelievers persist, yet Allah is fully aware of their deeds.\n• The Quran is described as glorious and preserved, emphasizing its divine origin and significance."
          }
        ]
      },
      {
      "surah": "86. At-Tariq",
      "posts": [
        {
          "reference": "Ayat 1–3: Divine Oath and Bright Star",
          "text": "• Allah swears by the sky and At-Tariq, the bright star that illuminates the night.\n• Readers are prompted to ponder the nature of this star, emphasizing its brilliance."
        },
        {
          "reference": "Ayat 4–7: Human Creation",
          "text": "• Each individual is assigned protectors and urged to reflect on their creation.\n• Humans originate from gushing fluid, originating between the backbone and ribs."
        },
        {
          "reference": "Ayat 8–13: Divine Power and Judgment Day",
          "text": "• Allah affirms His power to resurrect the dead and warns of a Day of Judgment.\n• On that day, humans will be powerless and their deeds scrutinized."
        },
        {
          "reference": "Ayat 14–17: Gravity of the Quran",
          "text": "• Allah swears by natural phenomena, emphasizing His power, and highlights the Quran as a criterion of truth.\n• The Quran is not to be trivialized but taken seriously.\n• Disbelievers plot against the Prophet, but Allah also has a plan.\n• Despite opposition, the Prophet is instructed to show patience towards disbelievers for a while longer."
        }
      ]
    },
    {
      "surah": "87. Al-A'la",
      "posts": [
        {
          "reference": "Ayat 1–5: Glory to the Most High",
          "text": "• Allah is glorified as the Most High, who created and proportioned His creation.\n• He brings forth vegetation, then makes it decayed stubble."
        },
        {
          "reference": "Ayat 6–11: Purpose of Revelation",
          "text": "• The Prophet is reassured that he will remember the Quran unless Allah wills otherwise.\n• The reminder benefits those who fear Allah, while the wretched avoid it.\n• The wicked will enter the greatest Fire, where they will neither die nor live."
        },
        {
          "reference": "Ayat 12–19: Eternal Success",
          "text": "• Success belongs to those who purify themselves, remember Allah, and pray.\n• People prefer worldly life, but the Hereafter is better and more lasting.\n• The message is consistent with the scriptures of Ibrahim and Musa."
        }
      ]
    },
    {
      "surah": "88. Al-Ghashiyah",
      "posts": [
        {
          "reference": "Ayat 1–7: Scenes from Hell",
          "text": "• Humiliated faces will be weary from striving.\n• They will enter a blazing fire and drink from a boiling spring.\n• Their food will be bitter thorns, neither nourishing nor satisfying."
        },
        {
          "reference": "Ayat 8–16: Joy in Paradise",
          "text": "• Joyful faces will be in elevated gardens.\n• They will hear no idle talk and enjoy flowing springs, raised couches, and spread-out cushions."
        },
        {
          "reference": "Ayat 17–26: Reminder and Accountability",
          "text": "• Reflection on camels, the sky, the mountains, and the earth.\n• The Prophet’s role is to remind, not compel.\n• All return to Allah, who will judge them."
        }
      ]
    },
    {
      "surah": "89. Al-Fajr",
      "posts": [
        {
          "reference": "Ayat 1–14: Warnings from History",
          "text": "• Oaths by the dawn, ten nights, even and odd, and the departing night.\n• Reference to the destruction of ‘Aad, Thamud, and Pharaoh.\n• Allah is ever watchful and capable of punishing wrongdoing."
        },
        {
          "reference": "Ayat 15–20: Misjudging Tests",
          "text": "• People think blessings mean honour and trials mean disgrace.\n• They fail to honour orphans and feed the poor.\n• They consume inheritance greedily and love wealth excessively."
        },
        {
          "reference": "Ayat 21–30: Regret and Reward",
          "text": "• On the Day of Judgment, Hell will be brought forth and people will regret their neglect.\n• The righteous soul will be invited: “Return to your Lord…”\n• Entry into Paradise is the reward for the tranquil soul."
        }
      ]
    },
    {
      "surah": "90. Al-Balad",
      "posts": [
        {
          "reference": "Ayat 1–10: The Human Condition",
          "text": "• Allah swears by Makkah and by parent and child.\n• Man is created for struggle and thinks no one has power over him.\n• He is given faculties and shown the two paths."
        },
        {
          "reference": "Ayat 11–20: The Uphill Path",
          "text": "• The difficult path is to free slaves, feed the poor, and believe.\n• Believers support truth and patience.\n• Disbelievers will be surrounded by Fire."
        }
      ]
    },
    {
        "surah": "91. Ash-Shams",
        "posts": [
          {
            "reference": "Ayat 1-7: Swearing by Creation",
            "text": "• The surah begins with oaths sworn by celestial bodies such as the sun, moon, heaven, and earth.\n• These oaths highlight the grandeur and orderliness of Allah’s creation.\n• An oath is also taken by Nafs (soul), underlining the significance of human creation and Allah’s perfection in proportioning it."
          },
          {
            "reference": "Ayat 8-10: Guidance and Success",
            "text": "• Allah guides humanity towards righteousness, warning against corruption.\n• Success is attained through purifying oneself, remembering Allah, and performing righteous deeds.\n• Failure results from corruption, disobedience, and rejection of Islamic Monotheism."
          },
          {
            "reference": "Ayat 11-15: Warning from History",
            "text": "• The people of Thamud rejected their Prophet.\n• The most wicked among them tried to kill the she-camel, a sign from Allah.\n• The Messenger, Saleh (AS), warned them against harming the she-camel.\n• Their denial and evil deeds led to their destruction."
          }
        ]
      },
      {
        "surah": "92. Al-Layl",
        "posts": [
          {
            "reference": "Ayat 1-4: Oaths and Diversity in Creation",
            "text": "• Sworn oaths by night, day, and the Creator of male and female signify the passage of time and diversity in creation.\n• Acknowledgment of diverse human efforts and deeds reflects various aims and purposes in life."
          },
          {
            "reference": "Ayat 5-10: Virtue and Ease",
            "text": "• Charitable acts, fulfillment of duties to Allah, and belief in Al-Husna ensure a smooth path towards goodness.\n• Allah promises ease and facilitation for the virtuous.\n• Greed, miserliness, and rejection of the best reward lead to a path of evil."
          },
          {
            "reference": "Ayat 11-21: Wealth’s Futility and Divine Guidance",
            "text": "• Wealth holds no benefit in facing destruction in the Hereafter.\n• Guidance solely comes from Allah, who holds authority over both worlds.\n• Severe warning about Hellfire’s punishment is issued for the wretched, while the righteous will find pleasure in Paradise."
          }
        ]
      },
      {
        "surah": "93. Ad-Duhaa",
        "posts": [
          {
            "reference": "Ayat 1-2: Oaths by Time",
            "text": "• Oaths are sworn by the forenoon (ad-Duha) and the night when it darkens, symbolizing the passage of time and the alternation of day and night."
          },
          {
            "reference": "Ayat 3-5: Divine Assurance and Promise",
            "text": "• Prophet Muhammad (PBUH) is assured of Allah’s presence and favor, with a promise of a better Hereafter.\n• Allah pledges continuous blessings and satisfaction for Prophet Muhammad (PBUH)."
          },
          {
            "reference": "Ayat 6-7: Divine Protection and Guidance",
            "text": "• Allah recounts His protection of Prophet Muhammad as an orphan and his guidance despite ignorance of the Quran and prophethood."
          },
          {
            "reference": "Ayat 8-11: Elevation and Commands",
            "text": "• Prophet Muhammad’s (PBUH) elevation from poverty to wealth is highlighted.\n• He is commanded to treat orphans and the needy justly and to proclaim Allah’s blessings and grace."
          }
        ]
      },
      {
        "surah": "94. Ash-Sharh",
        "posts": [
          {
            "reference": "Ayat 1-2: Divine Comfort and Assistance",
            "text": "• Allah rhetorically assures Prophet Muhammad (PBUH) of divine assistance by opening his heart and providing comfort, strength, and guidance.\n• The removal of burdens signifies Allah alleviating Muhammad’s (PBUH) worries or responsibilities in conveying Islam."
          },
          {
            "reference": "Ayat 3-4: Relief from Heavy Burdens",
            "text": "• Allah reminds Muhammad (PBUH) of the relief from heavy burdens, symbolizing the alleviation of challenges and the elevation of his status.\n• This highlights Allah’s support in overcoming difficulties and enhancing Muhammad’s (PBUH) reputation."
          },
          {
            "reference": "Ayat 5-6: Relief After Hardship",
            "text": "• Emphasizing the pattern of hardship followed by relief, it offers reassurance to Muhammad (PBUH) and believers.\n• Consolation is provided, encouraging patience during trials with the certainty of eventual ease."
          },
          {
            "reference": "Ayat 7-8: Call to Worship and Turning to Allah",
            "text": "• Prophet Muhammad (PBUH) is urged to worship Allah after hardship, underscoring prayer as a source of solace and guidance.\n• Turning attention solely to Allah reinforces reliance on Him, emphasizing devotion and trust in divine support."
          }
        ]
      },
      {
        "surah": "95. At-Tin",
        "posts": [
          {
            "reference": "Ayat 1-3: Swearing by Symbols",
            "text": "• Allah swears by significant symbols: the fig, olive, Mount Sinai, and the city of Makkah.\n• These symbols represent blessings, revelation, and sanctity, emphasizing their significance in the Islamic faith and history."
          },
          {
            "reference": "Ayat 4-5: Creation and Degradation",
            "text": "• Humans are reminded of their noble origin but acknowledged for their decline due to disobedience.\n• Despite being created in excellence, deviation leads them to the lowest state."
          },
          {
            "reference": "Ayat 6-8: Promise of Reward",
            "text": "• Believers who perform righteous deeds are promised eternal reward in Paradise.\n• Allah questions disbelievers about denying the Day of Resurrection, asserting His authority as the ultimate and just judge."
          }
        ]
      },
      {
        "surah": "96. Al-Alaq",
        "posts": [
          {
            "reference": "Ayat 1-5: Revelation and Creation",
            "text": "• Prophet Muhammad (PBUH) receives the command to read and learn in the name of Allah.\n• Acknowledgement of Allah as the Creator of humanity from a clinging clot.\n• Emphasis on Allah’s generosity and bestowal of knowledge through the pen.\n• Recognition of the human capacity to acquire knowledge."
          },
          {
            "reference": "Ayat 6-12: Human Transgression and Accountability",
            "text": "• Despite the guidance, humans often transgress, influenced by a sense of self-sufficiency.\n• Reminder of the ultimate return to Allah and accountability.\n• Questions challenging disobedience and towards Abu Jahl, a prominent disbeliever of Makkah."
          },
          {
            "reference": "Ayat 13-19: Warning and Divine Consequences",
            "text": "• Abu Jahl is warned of consequences if he persists in denying the truth.\n• Allah warns of the seizure by the forelock, symbolising humiliation and punishment.\n• Summoning of the guards of Hell indicates severe consequences for disbelief.\n• Muhammad (PBUH) is instructed to prostrate, emphasising obedience to divine commands."
          }
        ]
      },
      {
        "surah": "97. Al-Qadr",
        "posts": [
          {
            "reference": "Ayah 1: Revelation of the Quran",
            "text": "• The Quran was revealed on the Night of Al-Qadr, a profoundly significant occasion in Islamic tradition."
          },
          {
            "reference": "Ayah 2: Significance of the Night",
            "text": "• This verse rhetorically underscores the immense importance and greatness of the Night of Al-Qadr."
          },
          {
            "reference": "Ayah 3: Excellence of Al-Qadr",
            "text": "• The Night of Al-Qadr is extolled as superior to a thousand months in terms of blessings and rewards for worship."
          },
          {
            "reference": "Ayah 4: Angelic Descent",
            "text": "• Angels, including Jibril (AS), descend to Earth on the Night of Al-Qadr, delivering divine decrees and blessings by Allah’s permission."
          },
          {
            "reference": "Ayah 5: Tranquil Blessings",
            "text": "• The Night of Al-Qadr is characterized by tranquility and peace, with Allah bestowing blessings upon His faithful servants until dawn breaks."
          }
        ]
      },
      {
        "surah": "98. Al-Bayyinah",
        "posts": [
          {
            "reference": "Ayat 1-2: Clear Evidence and the Messenger (PBUH)",
            "text": "• Disbelievers persisted until clear evidence, embodied by the Messenger Muhammad (PBUH), was presented to them.\n• Muhammad (PBUH) recited purified pages, devoid of falsehood, as the conclusive evidence."
          },
          {
            "reference": "Ayat 3-4: Divine Laws and Disagreements",
            "text": "• The purified pages contained straight laws from Allah.\n• Disagreements among the People of the Scripture arose only after the clear evidence, referencing Muhammad’s (PBUH) arrival and revelations."
          },
          {
            "reference": "Ayat 5-6: Command and Consequences",
            "text": "• The command was to worship Allah alone, establish prayer, give zakat, and follow the right religion.\n• Disbelievers among the People of the Scripture and polytheists face eternal residence in Hell, deemed the worst of creatures."
          },
          {
            "reference": "Ayat 7-8: Virtue and Reward",
            "text": "• Believers, who fulfill Islamic obligations, are considered the best of creatures.\n• Their reward is Paradise, with eternal abode and Allah’s pleasure, reserved for those who fear their Lord."
          }
        ]
      },
      {
        "surah": "99. Az-Zalzalah",
        "posts": [
          {
            "reference": "Ayat 1-3: Earthquake and Confusion",
            "text": "• The Day of Judgment will witness a great earthquake, causing the earth to throw out its burdens.\n• Humans will be bewildered, questioning the extraordinary occurrences."
          },
          {
            "reference": "Ayat 4-6: Declaration and Accountability",
            "text": "• The earth will disclose all events that occurred on it, following Allah’s inspiration.\n• Mankind will be divided into scattered groups, awaiting their deeds’ revelation."
          },
          {
            "reference": "Ayat 7-8: Just Recompense",
            "text": "• Even the smallest deeds, good or evil, will be brought forth for scrutiny.\n• Allah ensures that every action, no matter how insignificant, will have its consequences unveiled."
          }
        ]
      },
      {
        "surah": "100. Al-Adiyat",
        "posts": [
          {
            "reference": "Ayat 1-5: Oaths by Steeds",
            "text": "• The surah starts with vivid oaths sworn by panting, fire-sparking warhorses racing into battle at dawn.\n• These oaths vividly depict the vigor and urgency of the message conveyed."
          },
          {
            "reference": "Ayat 6-8: Man’s Ingratitude",
            "text": "• Despite the evident signs, humanity displays ingratitude towards its Creator.\n• Man’s actions bear witness to his ungratefulness and excessive attachment to worldly wealth."
          },
          {
            "reference": "Ayat 9-11: Day of Resurrection",
            "text": "• A reminder of the impending Day of Resurrection, when graves will disgorge their contents and concealed secrets will be revealed.\n• On that Day, every deed, no matter how concealed, will be brought into the light, and divine justice will prevail."
          }
        ]
      },
      {
      "surah": "101. Al-Qari'ah",
      "posts": [
        {
          "reference": "Ayat 1-3: Introduction to the Day of Resurrection",
          "text": "• The surah emphasizes the significance of the Day of Resurrection, known as Al-Qari’ah, or the Striking Hour.\n• Through rhetorical questions, it highlights the incomprehensible nature of this Hour, underscoring its uncertainty and magnitude."
        },
        {
          "reference": "Ayat 4-7: Description of the Day",
          "text": "• Humanity on that Day is depicted as scattered moths, symbolizing confusion and disarray.\n• The situation of mountains is contrasted, with their immensity likened to carded wool.\n• The righteous will be rewarded with a pleasant life in Paradise, proportionate to their good deeds."
        },
        {
          "reference": "Ayat 8-11: Punishment for the Wicked",
          "text": "• Those whose bad deeds outweigh their good will face punishment in Hawiyah, a pit or Hell.\n• Hawiyah is described as a blazing fire, emphasizing its intense heat and torment.\n• Listeners are challenged to comprehend the severity of this punishment, reaffirming Hell’s nature as a scorching fire."
        }
      ]
    },
    {
      "surah": "102. At-Takathur",
      "posts": [
        {
          "reference": "Ayat 1-2: Warning Against Worldly Distractions",
          "text": "• Humanity is chastised for their excessive focus on worldly possessions, detracting them from life’s true purpose.\n• A visit to the graves serves as a stark reminder of human mortality and the fleeting nature of worldly pursuits."
        },
        {
          "reference": "Ayat 3-5: Assurance of Coming Knowledge",
          "text": "• Certainty is emphasized regarding a future realization or understanding despite present heedlessness.\n• The repetition of “Nay!” underlines the unreliability of this realization; had people possessed true insight, true knowledge would have led to different priorities, lessening indulgence in worldly pursuits."
        },
        {
          "reference": "Ayat 6-8: Vision of Hellfire",
          "text": "• A warning is issued about encountering the blazing fire of Hell, contrasting sharply with worldly indulgence.\n• The certainty of witnessing Hellfire is stressed, leaving no room for doubt.\n• Individuals will be held accountable on Judgment Day for their worldly pleasures, underscoring the importance of moderation and accountability."
        }
      ]
    },
    {
      "surah": "103. Al-Asr",
      "posts": [
        {
          "reference": "Ayat 1-2: Swearing by Time",
          "text": "• The verses open with an oath by time, highlighting its profound significance and the fleeting nature of human existence.\n• Humanity is declared to be in a state of loss, underscoring the gravity of this condition and the urgent need for redemption."
        },
        {
          "reference": "Ayah 3: Exception to Loss",
          "text": "• Highlights the characteristics of those who are exceptions to the general state of loss mentioned in the previous verses. These individuals are described as possessing four key qualities:\n  - Sincere Faith in Islamic Monotheism\n  - Consistent Engagement in Righteous Deeds\n  - Promotion of Truth\n  - Demonstrating Patience and Perseverance"
        }
      ]
    },
    {
      "surah": "104. Al-Humazah",
      "posts": [
        {
          "reference": "Ayat 1-3: Warning Against Slander and Materialism",
          "text": "• Severe warning against slander and backbiting, emphasizing their grave consequences.\n• Individuals are depicted as obsessed with accumulating wealth, prioritizing material possessions over spiritual growth.\n• Their false sense of security in wealth reflects their misplaced priorities and delusion."
        },
        {
          "reference": "Ayat 4-6: Severe Punishment and Hellfire",
          "text": "• Despite their expectations, they will face severe punishment in the Hellfire.\n• The punishment’s unfathomable severity is emphasized; no word could adequately convey its true nature.\n• Hellfire, kindled by Allah Himself, is described as an intense, terrifying fire."
        },
        {
          "reference": "Ayat 7-9: Intense Torment and Eternal Punishment",
          "text": "• The fire’s intensity is depicted as leaping over their hearts, symbolizing its overwhelming nature.\n• They will be enclosed and surrounded by this fire, with no escape or respite.\n• The imagery of fire stretching forth in pillars reinforces the idea of their eternal suffering in Hell."
        }
      ]
    },
    {
      "surah": "105. Al-Fil",
      "posts": [
        {
          "reference": "Ayah 1: Reflecting on Historical Events",
          "text": "• The verse recalls the “Event of the Elephant”, highlighting a significant historical incident involving an army’s attempt to attack the Kaaba with an elephant."
        },
        {
          "reference": "Ayat 2-3: Divine Intervention",
          "text": "• Allah’s intervention is emphasized, thwarting the aggressors’ plans despite their formidable army and intentions.\n• Flocks of birds are sent by Allah, serving as a miraculous intervention to overwhelm the invaders unexpectedly."
        },
        {
          "reference": "Ayat 4-5: Divine Retribution and Destruction",
          "text": "• The invaders face divine retribution as the birds strike them with stones, known as “Sijjil”, inflicting significant harm.\n• The defeat leaves the invaders utterly devastated, likened to a barren field stripped of its crops, symbolizing the completeness of their destruction."
        }
      ]
    },
    {
      "surah": "106. Quraysh",
      "posts": [
        {
          "reference": "Ayah 1: Divine Favor upon the Quraysh",
          "text": "• The verse highlights Allah’s immense blessing and protection bestowed upon the Quraysh tribe.\n• It signifies a special grace from Allah towards this community, underscoring their favored status."
        },
        {
          "reference": "Ayah 2: Safe Journey for Caravans",
          "text": "• Allah’s favor extends to ensuring the safety and security of the Quraysh caravans during their travels.\n• Whether in winter or summer, they embark on journeys without fear or concern for their safety, emphasizing Allah’s continuous protection."
        },
        {
          "reference": "Ayah 3: Call to Worship",
          "text": "• Acknowledging Allah’s blessings, the verse directs the Quraysh to devote themselves to His worship.\n• They are urged to recognize and honor Allah as the Lord of the Kaaba in Makkah, emphasizing the importance of worshiping the divine source of their blessings."
        },
        {
          "reference": "Ayah 4: Provision and Security",
          "text": "• Allah is praised for providing sustenance to the Quraysh, ensuring they are fed and nourished even in times of hunger.\n• Additionally, He grants them security and protection from fear, allowing them to live without constant apprehension, demonstrating His benevolence and care."
        }
      ]
    },
    {
      "surah": "107. Al-Ma'un",
      "posts": [
        {
          "reference": "Ayah 1: Denial of the Hereafter",
          "text": "• This verse questions the disbelief in the Day of Recompense, emphasizing accountability for deeds in the Hereafter.\n• It challenges those who reject the concept of judgment after death, highlighting the fundamental belief in divine justice."
        },
        {
          "reference": "Ayah 2: Ill-Treatment of Orphans",
          "text": "• Condemns the mistreatment of orphans, exposing the cruelty of neglecting vulnerable members of society.\n• It underscores the moral obligation to protect and care for those who lack parental guidance and support."
        },
        {
          "reference": "Ayah 3: Neglect of the Poor",
          "text": "• Criticizes neglect of the needy, emphasizing the duty to provide sustenance and support to the impoverished.\n• It highlights the importance of compassion and assistance towards those experiencing hardship and deprivation."
        },
        {
          "reference": "Ayah 4: Warning to Hypocrites",
          "text": "• Pronounces woe upon hypocrites who perform prayers superficially, lacking sincerity in their faith.\n• It warns against the hypocrisy of outwardly practicing religious rituals while lacking genuine belief and devotion."
        },
        {
          "reference": "Ayah 5: Neglect of Prayer Timings",
          "text": "• Censures delaying prayers from their prescribed times, reflecting negligence and disrespect towards worship.\n• It stresses the importance of observing prayer timings as a fundamental aspect of devotion and submission to Allah."
        },
        {
          "reference": "Ayah 6: Seeking Attention",
          "text": "• Rebukes performing good deeds for the sake of praise and recognition from others rather than seeking Allah’s pleasure.\n• It underscores the importance of sincerity and purity of intention in all actions and worship."
        },
        {
          "reference": "Ayah 7: Refusal of Basic Kindness",
          "text": "• Condemns refusal to perform simple acts of kindness and generosity towards others, such as offering basic necessities.\n• It emphasizes the significance of compassion and benevolence in interpersonal relationships and societal interactions."
        }
      ]
    },
    {
      "surah": "108. Al-Kawthar",
      "posts": [
        {
          "reference": "Ayah 1: Grant of Al-Kawthar",
          "text": "• Allah grants Prophet Muhammad (PBUH) abundant blessings, symbolized by Al-Kawthar, a river in Paradise.\n• This verse underscores Allah’s favor upon His Messenger (PBUH), assuring him of a rich reward in the Hereafter."
        },
        {
          "reference": "Ayah 2: Instruction to Worship and Sacrifice",
          "text": "• Believers are commanded to turn to Allah in prayer and offer sacrifices solely for His sake.\n• It emphasizes devotion to Allah through acts of worship and sacrifice as expressions of obedience and gratitude."
        },
        {
          "reference": "Ayah 3: Warning Against Opposition",
          "text": "• Those who oppose or provoke the Prophet Muhammad (PBUH) are warned of severe consequences.\n• The verse highlights the gravity of opposing Allah’s chosen Messenger (PBUH) and the detrimental effects it brings in both worldly life and the Hereafter."
        }
      ]
    },
    {
      "surah": "109. Al-Kafirun",
      "posts": [
        {
          "reference": "Ayah 1: Addressing the Disbelievers",
          "text": "• Prophet Muhammad (PBUH) is directed to disassociate himself from the beliefs and practices of the disbelievers and polytheists.\n• He declares his rejection of their faith and asserts his adherence to monotheism."
        },
        {
          "reference": "Ayat 2–5: Rejection of Polytheism",
          "text": "• The Prophet Muhammad (PBUH) firmly rejects polytheism and affirms his exclusive worship of Allah.\n• He emphasizes the contrast between monotheism and polytheism, refusing to compromise his beliefs."
        },
        {
          "reference": "Ayah 6: Respect for Religious Differences",
          "text": "• Prophet Muhammad (PBUH) acknowledges the separation of beliefs, asserting that each has their own religion, and he will remain steadfast in his worship of Allah.\n• While the verse promotes a form of tolerance by leaving others to their beliefs without interference, it upholds Islamic monotheism and does not validate polytheistic beliefs."
        }
      ]
    },
    {
      "surah": "110. An-Nasr",
      "posts": [
        {
          "reference": "Ayah 1: Anticipation of Victory",
          "text": "• This verse heralds the imminent help and triumph from Allah, particularly referencing the conquest of Makkah.\n• It signifies a pivotal moment in Islamic history, where Prophet Muhammad (PBUH) and his companions would achieve a decisive victory over their adversaries."
        },
        {
          "reference": "Ayah 2: Mass Conversion to Islam",
          "text": "• The verse portrays the widespread acceptance of Islam by the people of Makkah, following its conquest.\n• It underscores the rapid and significant momentum of the Muslim community resulting from this event, as large numbers embraced Islam."
        },
        {
          "reference": "Ayah 3: Gratitude and Seeking Forgiveness",
          "text": "• Believers are instructed to extol and seek forgiveness from Allah in response to the victory and mass conversion.\n• This verse underscores the importance of expressing gratitude for Allah’s blessings and seeking His forgiveness for any shortcomings, highlighting His mercy and readiness to accept repentance."
        }
      ]
    },
    {
      "surah": "111. Al-Masad",
      "posts": [
        {
          "reference": "Ayah 1: Curse on Abu Lahab",
          "text": "• This verse invokes a curse upon Abu Lahab, emphasizing his imminent destruction due to his hostility towards Islam and persecution of Prophet Muhammad (PBUH).\n• It underscores the severity of his actions and the consequences he will face as a result."
        },
        {
          "reference": "Ayah 2: Material Wealth Won’t Save Him",
          "text": "• Despite Abu Lahab’s wealth and status, this verse asserts that they will not provide him any protection or benefit on the Day of Judgment.\n• It highlights the insignificance of worldly possessions in the face of divine justice and accountability."
        },
        {
          "reference": "Ayah 3: Punishment in Hellfire",
          "text": "• Abu Lahab’s fate is vividly depicted as being cast into a blazing fire, symbolizing the intense torment awaiting him.\n• The verse underscores the severity of his rejection of the truth and enmity towards the Prophet (PBUH), leading to his eternal punishment."
        },
        {
          "reference": "Ayah 4: Curse on His Wife",
          "text": "• Similar condemnation is extended to Abu Lahab’s wife for her complicity in opposing Prophet Muhammad (PBUH).\n• It emphasizes accountability for one’s actions and highlights the repercussions of contributing to persecution and hostility towards the Prophet (PBUH)."
        },
        {
          "reference": "Ayah 5: Twisted Rope Around Her Neck",
          "text": "• Metaphorically, this verse describes Abu Lahab’s wife as being bound with a twisted rope and a fibered noose around her neck.\n• It symbolizes the entanglement of the consequences of her actions and her eventual fate of being dragged into the punishment of Hellfire alongside her husband."
        }
      ]
    },
    {
      "surah": "112. Al-Ikhlas",
      "posts": [
        {
          "reference": "Ayah 1: Declaration of Tawheed",
          "text": "• This verse affirms the concept of Tawheed, emphasizing the oneness and uniqueness of Allah.\n• It asserts that Allah is the sole deity worthy of worship, without any partners or associates."
        },
        {
          "reference": "Ayah 2: Description of Allah as As-Samad",
          "text": "• Allah is described as As-Samad, the Self-Sufficient Master, highlighting His independence and eternity.\n• The verse emphasizes that Allah is not reliant on anyone or anything, while all of creation depends entirely on Him for sustenance and support."
        },
        {
          "reference": "Ayah 3: Rejection of Offspring",
          "text": "• This verse categorically denies any notion of Allah having children or being born from anyone.\n• It underscores Allah’s eternal existence and refutes the concept of divine parentage attributed to Him."
        },
        {
          "reference": "Ayah 4: Uniqueness and Incomparability of Allah",
          "text": "• The verse asserts that there is nothing comparable to Allah, emphasizing His absolute uniqueness and incomparability.\n• It rejects the idea of associating partners with Allah and emphasizes His unparalleled status as the Supreme Being."
        }
      ]
    },
    {
      "surah": "113. Al-Falaq",
      "posts": [
        {
          "reference": "Ayah 1: Seeking Refuge with Allah",
          "text": "• This verse commands seeking refuge with Allah, specifically invoking Him as the Lord of the daybreak.\n• It signifies seeking protection from the potential harms and challenges that may arise as the day begins."
        },
        {
          "reference": "Ayah 2: Protection from Created Evils",
          "text": "• The verse seeks protection from the evil inherent in all of Allah’s creations.\n• It acknowledges that all forms of harm ultimately originate from Allah’s creations and we must ask His safeguarding from them."
        },
        {
          "reference": "Ayah 3: Safeguarding from Darkness and Lunar Phenomena",
          "text": "• Here, protection is sought from the evil of darkness when it settles.\n• It underscores the need for protection during periods of darkness."
        },
        {
          "reference": "Ayah 4: Seeking Refuge from Witchcraft",
          "text": "• Protection is sought from the harm caused by witchcraft or sorcery, particularly when practitioners blow on knots as part of their rituals.\n• This verse highlights the need for protection from the harmful effects of magic and occult practices."
        },
        {
          "reference": "Ayah 5: Protection from Envious Individuals",
          "text": "• The final verse seeks refuge from the harm caused by envy or jealousy.\n• It need for protection from the negative energies and intentions of those who envy others, highlighting the spiritual dangers posed by envy."
        }
      ]
    },
    {
      "surah": "114. An-Nas",
      "posts": [
        {
          "reference": "Ayah 1: Seeking Refuge with Allah",
          "text": "• Commands seeking refuge with Allah, invoking Him as the Lord of mankind.\n• Signifies seeking protection from the various challenges and trials faced by humanity."
        },
        {
          "reference": "Ayah 2: Recognition of Allah’s Sovereignty",
          "text": "• Describes Allah as the King or Sovereign of mankind.\n• Emphasizes His absolute authority and power over all human affairs."
        },
        {
          "reference": "Ayah 3: Affirmation of Monotheism",
          "text": "• Recognizes Allah as the Ilah or God of mankind.\n• Reaffirms monotheism and the exclusive worship of Allah."
        },
        {
          "reference": "Ayah 4: Seeking Protection from Shaytan’s Whispers",
          "text": "• Seeks refuge from the evil whispers of Shaytan."
        },
        {
          "reference": "Ayah 5: Warning Against Shaytan’s Influence",
          "text": "• Describes Shaytan whispering evil thoughts into the hearts and minds of mankind.\n• Emphasizes the subtle and insidious nature of Shaytan’s whispers."
        },
        {
          "reference": "Ayah 6: Universality of Shaytan’s Influence",
          "text": "• Highlights that Shaytan’s whispers affect both humans and jinn.\n• Emphasizes the universal nature of Shaytan’s temptation and deception."
        }
      ]
    }
  ]

























