[
  {
    "surah": "1. Al-Fatiha",
    "posts": [
      {
        "text": "• Known as al-Sab‘ al-Mathani (seven oft-repeated verses).\n• Called umm al-kitab (Mother of the Book) as it is the foundation of the Quran.\n• Recited in every unit of the five daily prayers.\n• A divine format of prayer taught by Allah.\n• Allah responds to each segment of the surah.\n• Emphasises supplication and its etiquettes."
      },
      {
        "text": "• Al-Fatiha covers central themes of belief, worship, and guidance.\n• Serves as a prayer, and the rest of the Quran is the answer from Allah."
      }
    ]
  },
  {
    "surah": "2. Al-Baqarah",
    "posts": [
      {
        "text": "• Declares the Quran as a book free from doubt.\n• Discusses creation of Adam and mankind’s nature.\n• Addresses the Children of Israel and their history.\n• Story of the golden calf and the Sabbath violation.\n• Lessons from Ibrahim and Ismail building the Kabah."
    },
    {
        "text": "• Change of Qiblah to Makkah.\n• Commands on belief, timekeeping, hypocrisy, Ayat al-Kursi.\n• Guidelines on social laws: marriage, trade, justice, fasting, pilgrimage.\n• Emphasises writing contracts, avoiding usury, and justice.\n• States non-compulsion in religion."
      }
    ]
  },
  {
    "surah": "3. Al-Imran",
    "posts": [
      {
        "text": "• Allah testifies about His Oneness.\n• The Quran contains both clear and allegorical verses.\n• Islam is the only acceptable religion to Allah.\n• Emphasis on dying as a Muslim.\n• History of Maryam, Isa and Yahya.\n• Those martyred in Allah’s cause are alive.\n• Lessons from the Battle of Uhud.\n• The Kabah as the first House of Worship."
      }
    ]
  },
  {
    "surah": "4. An-Nisa",
    "posts": [
      {
        "text": "• Laws on marriage, inheritance, and women’s rights.\n• Repentance guidelines.\n• Forbidden relations for marriage.\n• Arbitration in family disputes.\n• Prohibitions on alcohol.\n• Obedience to the Prophet equals obedience to Allah.\n• Guidelines for greeting, prayer timings, travel prayers.\n• Warning against hypocrisy and polytheism.\n• Jesus was not crucified but raised by Allah.\n• Family and societal laws established."
      }
    ]
  },
  {
    "surah": "5. Al-Ma’idah",
    "posts": [
      {
        "text": "• Defines halal and haram foods.\n• Permits food and marriage with People of the Book.\n• Ablution, ghusl, and tayammum instructions.\n• Reminds Jews and Christians of earlier obligations.\n• Warns against corruption and abuse of power.\n• Punishments for theft and rebellion.\n• Strict prohibition on alcohol and gambling.\n• Miracles of Isa and his human status."
      }
    ]
  },
  {
    "surah": "6. Al-An'am",
    "posts": [
      {
        "text": "• Emphasises tawhid and rebukes shirk.\n• Refutes baseless religious laws.\n• Responds to accusations against the Prophet.\n• Comfort for believers during hardship.\n• Warns disbelievers and prohibits religious sectarianism.\n• Proclaims that life and death are for Allah."
      }
    ]
  },
  {
    "surah": "7. Al-A'raf",
    "posts": [
      {
        "text": "• Invitation to People of the Book.\n• Warnings to those who rejected past prophets.\n• Importance of wise da'wah.\n• Dialogue of Paradise, Hell, and A'raf dwellers.\n• Command to wear modest clothing and eat pure food.\n• Mention of Prophet Muhammad ﷺ in the Torah and Gospel.\n• Unity of mankind from a single soul."
      }
    ]
  },
  {
    "surah": "8. Al-Anfal",
    "posts": [
      {
        "text": "• Battle of Badr: truth versus falsehood.\n• Emphasises fighting for justice, not gains.\n• Rules for warfare and treaties."
      }
    ]
  },
  {
    "surah": "9. At-Tawbah",
    "posts": [
      {
        "text": "• Final policy on polytheists.\n• Laws on war, peace, and hypocrisy.\n• Campaign of Tabuk and exposing hypocrites.\n• Zakah as a means of purification.\n• Allah purchases the lives of believers."
      }
    ]
  },
  {
    "surah": "10. Yunus",
    "posts": [
      {
        "text": "• Allah is the sole Creator.\n• False gods have no power or awareness.\n• Messengers sent to all nations.\n• Quran is a cure for spiritual illness.\n• Stories of Nuh, Musa, and Yunus.\n• Prohibition of forced conversion."
      }
    ]
  },
  {
    "surah": "11. Hud",
    "posts": [
      {
        "text": "• Allah sustains all beings.\n• Quran is the unforgeable message.\n• Stories of Nuh, his son, and other prophets.\n• Warning to rejecters of divine message.\n• Good deeds erase sins.\n• Freedom of choice given to mankind."
      }
    ]
  },
  {
    "surah": "12. Yusuf",
    "posts": [
      {
        "text": "• All messengers were human.\n• Story of Yusuf and his dua.\n• All prophets had one unified message.\n• Contrast between believers and disbelievers.\n• Trust in Allah leads to success.\n• Yusuf’s moral strength shines under trial."
      }
    ]
  },
  {
    "surah": "13. Ar-Ra’d",
    "posts": [
      {
        "text": "• Quran is Allah’s revelation.\n• Nature reflects Allah’s signs.\n• Allah changes not the condition of a people unless they act.\n• Dhikr brings peace to hearts.\n• Messengers perform miracles only with Allah’s permission."
      }
    ]
  },
  {
    "surah": "14. Ibrahim",
    "posts": [
      {
        "text": "• Messengers spoke the language of their people.\n• Allah is unaffected by disbelief.\n• Satan only seduces, has no real power.\n• Story of Ibrahim’s prayer in Muslim rituals.\n• Warning to rejecters of revelation."
      }
    ]
  },
  {
    "surah": "15. Al-Hijr",
    "posts": [
      {
        "text": "• Quran is safeguarded by Allah.\n• Disbelievers’ regret on Judgement Day.\n• Story of Adam and Satan’s refusal.\n• Ibrahim receives news of a son.\n• Al-Fatiha mentioned as ‘seven oft-repeated verses’."
      }
    ]
  },
  {
    "surah": "16. An-Nahl",
    "posts": [
      {
        "text": "• Signs of Allah in creation.\n• Quran gives life to the soul.\n• Commands justice, generosity, and modesty.\n• Rights and wrongs of halal/haram are for Allah to decide.\n• Ibrahim praised as a nation himself."
      }
    ]
  },
  {
    "surah": "17. Al-Isra",
    "posts": [
      {
        "text": "• Night Journey (Isra) of the Prophet.\n• Quran and the Children of Israel.\n• Adam and Iblis story.\n• Allah’s blessings and scenes from the Hereafter.\n• Miraculous nature and guidance of the Quran."
      }
    ]
  },
  {
    "surah": "18. Al-Kahf",
    "posts": [
      {
        "text": "• Praise for Allah and guidance.\n• Stories: People of the Cave, Musa and Khidr, Dhul-Qarnayn.\n• Themes: trials of faith, wealth, knowledge, power.\n• Endurance and reliance on divine help."
      }
    ]
  },
  {
    "surah": "19. Maryam",
    "posts": [
      {
        "text": "• Stories of Zakariya, Yahya, Maryam and Isa.\n• Isa’s human status clarified.\n• Ibrahim’s da’wah to his father.\n• Life of believers vs disbelievers.\n• Condemnation of attributing a son to Allah."
      }
    ]
  },
  {
    "surah": "20. Ta-Ha",
    "posts": [
      {
        "text": "• Quran as a reminder for the God-fearing.\n• Stories of Musa and Pharaoh.\n• Satan’s temptation of Adam.\n• Message of patience, prayer, and knowledge.\n• Do not envy worldly riches."
      }
    ]
  },
  {
    "surah": "21. Al-Anbiya",
    "posts": [
      {
        "text": "• Creation has purpose, not play.\n• Unity of God, refuting polytheism.\n• All prophets were mortal.\n• Ibrahim’s challenge to idolatry.\n• All mankind is one brotherhood."
      }
    ]
  },
  {
    "surah": "22. Al-Hajj",
    "posts": [
      {
        "text": "• Reality of the Last Hour.\n• Rights in Masjid al-Haram.\n• Hajj commanded by Ibrahim.\n• Importance of sincerity in sacrifice.\n• Permission for self-defence granted.\n• Believers named Muslims in prior scriptures too."
      }
    ]
  },
  {
    "surah": "23. Al-Mu’minun",
    "posts": [
      {
        "text": "• Characteristics of successful believers.\n• Creation stages of humans.\n• Prophets Nuh and Hud.\n• Guidance to respond to evil with good.\n• Life of this world is brief."
      }
    ]
  },
  {
    "surah": "24. An-Nur",
    "posts": [
      {
        "text": "• Laws on adultery, slander, and Lian.\n• Incident of Aisha and her innocence.\n• Encouragement to marry and free slaves.\n• Modesty for men and women.\n• Allah is the Light of the heavens and earth."
      }
    ]
  },
  {
    "surah": "25. Al-Furqan",
    "posts": [
      {
        "text": "• Quran distinguishes truth from falsehood.\n• Disbelievers regret their rejection on the Day of Judgement.\n• Quran revealed gradually with wisdom.\n• Command to strive with the Quran.\n• Description of righteous believers."
      }
    ]
  },
  {
    "surah": "26. Ash-Shu'ara",
    "posts": [
      {
        "text": "• Allah’s address to Prophet Muhammad ﷺ that he should not fret himself to death with grief for the people’s disbelief.\n• Story of Musa, Pharaoh and deliverance of the children of Israel.\n• Story of Ibrahim and his arguments against idol worshipping.\n• The polytheists and their gods will both be toppled into Hellfire.\n• Stories of Prophets Nuh, Hud, Saleh, Lut, Shuayb and their people.\n• The Quran is revealed in the Arabic language.\n• Satans descend on slandering sinners who listen to hearsay and are liars."
      }
    ]
  },
  {
    "surah": "27. An-Naml",
    "posts": [
      {
        "text": "• The Quran is a guide and good news to the believers.\n• Prophet Musa’s nine miracles were shown to Pharaoh and his people.\n• Story of Prophet Sulayman and the Queen of Sheba.\n• Stories of Prophets Saleh, and Lut and their people.\n• The disbelievers actually doubt Allah’s power of creation.\n• A sign from the signs, and a scene from the scenes of Doomsday.\n• Those who accept guidance do so for their own good and those who reject and go astray, do so at their own peril.\n• Three character types have been presented in this surah:\n  • Pharaoh, his chiefs, the nation of Thamud and the people of Prophet Lut\n  • Prophet Sulayman\n  • Queen of Sheba"
      }
    ]
  },
  {
    "surah": "28. Al-Qasas",
    "posts": [
      {
        "text": "• The story of Pharaoh who plotted to kill all the male children of the Israelites.\n• How Allah saved Musa and arranged for him to be brought up in Pharaoh’s own household.\n• Prophet Musa as a youth, accidental killing of a man, his escape to Madyan, his marriage, his seeing a fire at Mount Tur, and his assignment as a messenger.\n• The stories of previous generations are related in the Quran as an eye opener for the disbelievers to learn a lesson.\n• The prophets cannot give guidance; it is Allah who gives guidance.\n• On the Day of Judgement, disbelievers will wish that they had accepted guidance and become Muslims.\n• Allah has not allowed the polytheists to assign His powers to whom they want.\n• The story of Qarun, the legendary rich man.\n• Allah’s commandment that the revelation of the Quran is His mercy; a believer should let no one turn him away from it."
      }
    ]
  },
  {
    "surah": "29. Al-Ankabut",
    "posts": [
      {
        "text": "• Allah tests the believers to see who is truthful and who is a liar.\n• Be kind to parents but do not obey them in matters of polytheism.\n• Those who say: ‘Follow us, we will bear your burden on the Day of Judgement,’ are liars.\n• Prophet Nuh admonished his people for 950 years not to engage in polytheism.\n• Prophet Ibrahim admonished his people not to engage in polytheism, for which they tried to burn him alive, but Allah saved him.\n• The nations of Ad, Thamud, Madyan and Pharaoh rejected the messengers of Allah, as a result Allah destroyed them all.\n• Parable of those who take protectors other than Allah, is that of the dwelling of a spider and the fact that the weakest of all the dwellings is the dwelling of a spider."
      }
    ]
  },
  {
    "surah": "30. Ar-Rum",
    "posts": [
      {
        "text": "• The defeat of the Romans (Christians) at the hands of the Persians (Pagans) was considered by Makkans a sign of the Muslims’ defeat at the hands of Arab disbelievers.\n• Prophecy of the Roman victory against the Persians and the Muslim victory against the disbelievers.\n• Allah has originated the creation and He will resurrect the dead for the Final Judgement.\n• Creation of man, his consort, heaven, earth, language, colours, sleep, quest for work, lightning, rain and growth of vegetation – all are signs from Allah.\n• Wrongdoers are those who are led by their own desires without real knowledge.\n• True faith versus sects and polytheism.\n• Commandment to give relatives their due and take care of the poor and travellers in need.\n• Mischief on earth is due to man’s own misdeeds.\n• Allah tells the Prophet: ‘O Prophet! You cannot make the dead hear you.’"
      }
    ]
  },
  {
    "surah": "31. Luqman",
    "posts": [
      {
        "text": "• The Quran is a book of wisdom and a blessing for the righteous.\n• Luqman’s advice to his son not to commit shirk.\n• Rights of the mother and the parents.\n• Not to obey parents if they ask you to commit shirk.\n• Islamic moral behaviour and interaction.\n• The main reason for misguidance is the blind following of one’s forefathers.\n• If all trees were pens and oceans ink, Allah’s words could not be put to writing.\n• Allah is the only Reality. All others whom people invoke besides Him are false.\n• Mankind, fear that Day when not even a father shall avail his son, nor a son his father, let not Satan deceive you concerning this fact."
      }
    ]
  },
  {
    "surah": "32. As-Sajda",
    "posts": [
      {
        "text": "• The Quran is beyond all doubt and is sent to warn those people to whom no warner has come before.\n• On the Day of Judgement, the disbelievers shall believe but that belief will be of no benefit to them.\n• There is a special reward for those who forsake their beds and invoke their Lord with fear and hope, and spend in charity.\n• The Quran is similar to the book which was given to Prophet Musa."
      }
    ]
  },
  {
    "surah": "33. Al-Ahzab",
    "posts": [
      {
        "text": "• Fear Allah and do not obey the disbelievers and the hypocrites.\n• Laws relating to divorce and status of an adopted son.\n• By word of mouth, neither your wives become your real mothers nor your adopted sons your real sons.\n• Prophet’s wives are declared to be the mothers of all believers.\n• Blood relations have greater claims than others in the Book of Allah.\n• Battle of the Trench (Ahzab).\n• Favours of Allah.\n• Attitudes of the hypocrites.\n• Non participants are declared to have no faith at all and that all their deeds are void.\n• The life of Prophet Muhammad ﷺ is declared to be a model for all.\n• Admonition to the wives of the Prophet.\n• It is not befitting for the believers to have options in what has been decided by Allah and His Messenger.\n• Commandment to the Prophet to marry the divorced wife of his adopted son.\n• Prophet Muhammad ﷺ is not the father of any of your men but a messenger and seal of prophethood.\n• Etiquettes concerning the visits to the Prophet’s household.\n• Allah Himself and His angels send blessings on the Prophet, and the believers are instructed to do the same.\n• Dress code for women.\n• The trust of Allah was presented to the heavens, the earth and the mountains: they refused to take that responsibility but man took it."
      }
    ]
  },
  {
    "surah": "34. Saba",
    "posts": [
      {
        "text": "• The Day of Resurrection is sure to come for Allah’s judgement to reward the believers and punish the disbelievers.\n• Those who do not believe in the Hereafter are doomed.\n• The mountains and birds used to sing Allah’s praises with Prophet Dawud.\n• Allah subjected the winds and jinns to Prophet Sulayman.\n• Intercession before Allah can not avail anyone except for whom He permits.\n• Muhammad ﷺ is sent as a messenger for the whole of mankind.\n• Wealth and children are a test to whom they are given.\n• Whatever you spend in charity, Allah will pay you back in full.\n• The truth has come, falsehood neither originates nor restores anything.\n• On the Day of Judgement disbelievers will wish that they were believers."
      }
    ]
  },
  {
    "surah": "35. Fatir",
    "posts": [
      {
        "text": "• None can award or withhold blessings besides Allah.\n• Satan is your enemy, so take him as such.\n• The person who considers his evil deeds to be good deeds cannot be guided to the right path.\n• Real honour is in being obedient to Allah.\n• Mankind is in need of Allah while He is not in need of anyone.\n• None can make those who are buried in the grave hear you.\n• Those who recite the Quran, establish salah and give zakah may hope for Allah’s blessings and reward.\n• Allah has not sent any Book which has a provision of shirk.\n• Plotting evil recoils none but the author of it.\n• If Allah was to punish people for their wrongdoing, He would have not left even an animal around them."
      }
    ]
  },
  {
    "surah": "36. Ya-Sin",
    "posts": [
      {
        "text": "• The Quran is revealed by Allah to warn people and establish charge-sheet against the disbelievers.\n• Allah has created all things in pairs.\n• The day, night, sun and moon, all are being regulated by Allah.\n• Scenes from the Day of Judgement:\n  • Allah’s greetings to the residents of Paradise\n  • Allah’s address to the sinners\n  • Hands and feet shall bear witness\n• All human beings shall be raised back to life again on the Day of Judgement for accountability of their deeds.\n• Inspiration for those engaged in daawah and reform."
      }
    ]
  },
  {
    "surah": "37. As-Saffat",
    "posts": [
      {
        "text": "• Allah Himself testifies that your God is one and the satans do not have any access to the exalted assembly of angels.\n• Life in the Hereafter and the Day of Judgement are real.\n• Scenes from the Day of Judgement:\n  • A dialogue between the followers and the leaders who mislead them\n  • A view from the scenes of Paradise\n  • A conversation between the residents of Paradise\n  • A view from the scenes of Hellfire\n• Prayer of Prophet Nuh and Allah’s response.\n• The story of Prophet Ibrahim:\n  • He questioned his people for worshipping idols\n  • His people threw him the furnace, but Allah saved him\n  • He prayed for a son and Allah granted him a son\n  • Allah tested Ibrahim by asking him to offer the sacrifice of his only son and he passed the test\n• Prophethood of Musa, Harun, Ilyas and Lut.\n• Story of Prophet Yunus.\n• Allah has promised to help His messengers."
      }
    ]
  },
  {
    "surah": "38. Sad",
    "posts": [
      {
        "text": "• The Quran is full of admonition. The disbelievers are in sheer arrogance for calling the Prophet a liar.\n• Story of Prophet Dawud:\n  • The mountains and birds used to sing with him, glorifying Allah\n  • The litigants who came to him for a decision\n• Allah has not created the heavens and earth in vain.\n• Story of Prophet Sulayman:\n  • His inspection of steeds which were to be used in warfare\n  • His prayer to grant him a kingdom which has not been granted to any one\n• Story of Ayub, his sickness, patience and relief.\n• Story of Adam and disobedience of Satan."
      }
    ]
  },
  {
    "surah": "39. Az-Zumar",
    "posts": [
      {
        "text": "• The polytheists justify their worship of idols saying: ‘It brings us closer to Allah.’\n• On the Day of Judgement no one shall bear the burden of others.\n• Believers who cannot practise their faith should migrate to places where they can.\n• Real losers are those who lose their souls and families on the Day of Judgement.\n• No one can rescue the one against whom a punishment has been decreed.\n• The Quran is consistent yet it repeats the teachings in different ways.\n• Allah has cited every kind of example in the Quran so that people may clearly understand and reflect.\n• Who can be more wicked than the one who invents a lie against Allah.\n• Those who have transgressed against their souls should not despair of Allah’s mercy, they should repent while they can.\n• On the Day of Judgement, everyone’s book of deeds shall be laid open and justice shall be done with all fairness."
      }
    ]
  },
  {
    "surah": "40. Ghafir",
    "posts": [
      {
        "text": "• The angels who bear the throne of Allah pray for those humans who repent and follow the right way.\n• A scene from the Day of Judgement.\n• Allah knows the furtive looks and secret thoughts.\n• Story of Prophet Musa, Pharaoh, Haman and Qarun.\n• An excellent speech of one of the relatives of Pharaoh in favour of Prophet Musa.\n• Pharaoh plotted against that relative, who was a believer, but Allah saved him and destroyed the people of Pharaoh, and now they are presented before the fire of Hell every morning and evening.\n• Allah says: ‘Call me, I will answer your prayers.’\n• No one has the right to be worshipped except Allah.\n• Those who argue about the revelations of Allah will soon find out the Truth.\n• Allah has sent many messengers before Muhammad ﷺ: of them some are mentioned in the Quran and some are not.\n• Belief after seeing the punishment of Allah is of no avail to the disbelievers."
      }
    ]
  },
  {
    "surah": "41. Fussilat",
    "posts": [
      {
        "text": "• The Quran was revealed to give admonition.\n• Woe to those who deny the Hereafter and do not pay zakah.\n• Story of the creation of earth, mountains, seas, skies and heavens.\n• Example of Allah’s scourge upon the nations of Ad and Thamud.\n• On the Day of Judgement, man’s own ears, eyes and skin will bear witness against him relating to his misdeeds.\n• Those who say their God is Allah and stay firm on it, have angels assigned for their protection.\n• The best in speech is the one who calls people towards Allah, does good deeds and says, ‘I am a Muslim.’\n• The message which is revealed to Prophet Muhammad ﷺ is the same message which was revealed to previous prophets.\n• The Quran is a guide and healing for the believers. It is similar to the Scripture given to Prophet Musa."
      }
    ]
  },
  {
    "surah": "42. Ash-Shura",
    "posts": [
      {
        "text": "• The heaven might have broken apart from above those who elevate Allah’s creatures to His level if angels were not begging for forgiveness for them.\n• Islam is the same religion which was enjoined on Nuh, Ibrahim, Musa and Isa.\n• He who desires the harvest in the Hereafter shall be given manifold and he who desires it in this life shall be given a portion here but shall have no share in the Hereafter.\n• Whatever misfortune befall people, are the result of their own misdeeds.\n• True believers are those who establish salah, give charity and defend themselves when oppressed.\n• The real losers are those who will lose on the Day of Resurrection.\n• It is Allah who gives daughters and sons as He pleases.\n• It is not for any human being that Allah should speak to him face to face."
      }
    ]
  },
  {
    "surah": "43. Az-Zukhruf",
    "posts": [
      {
        "text": "• The Quran is a transcript from the Mother-Book which is in Allah’s keeping.\n• Supplication before riding a conveyance.\n• Creed of the polytheists that angels are female divinities is false.\n• An example of Prophet Ibrahim who recognised the oneness of Allah and rejected polytheism using his common sense and observing His signs in nature.\n• If it were not that all mankind will become one race of disbelievers, Allah would have given the disbelievers houses which were made with sterling silver.\n• He who turns away from the remembrance of Allah, Allah appoints a satan to be his intimate friend.\n• Hold fast to the Quran if you want to be rightly guided.\n• Isa was no more than a mortal whom Allah favoured and made an example for the Children of Israel.\n• Prophet Muhammad instructed to tell the Christians: ‘If Allah had a son, I would have been the first one to worship him.’"
      }
    ]
  },
  {
    "surah": "44. Ad-Dukhan",
    "posts": [
      {
        "text": "• Allah has revealed this Quran in the blessed night (Laylat-ul-Qadr).\n• The Quran itself bears testimony that it is from Allah.\n• Lessons to be learned from the story of Prophet Musa and the people of Pharaoh.\n• Allah saved the Children of Israel and chose them over the nations of the world in spite of their weaknesses.\n• Food and drink for the sinners in Hell compared to food and entertainment for the righteous in Paradise."
      }
    ]
  },
  {
    "surah": "45. Al-Jathiyah",
    "posts": [
      {
        "text": "• If the disbelievers do not believe in Allah and His revelations then in what report will they believe!\n• Allah has subjected the seas and all that is between the heavens and the earth for human beings.\n• Israelites made sects in their religion even after knowledge had come to them through the Torah.\n• Allah is the Protector of righteous people.\n• He that makes his own desires as his god, Allah will let him go astray and set a seal upon his ears and heart.\n• Allah’s address to the disbelievers on the Day of Judgement."
      }
    ]
  },
  {
    "surah": "46. Al-Ahqaf",
    "posts": [
      {
        "text": "• The deities whom polytheists invoke are not even aware that they are being invoked.\n• The Quran is the word of Allah, not of Prophet Muhammad ﷺ.\n• The Prophet is but a plain warner.\n• The Quran confirms the revelation of the Torah given to Prophet Musa.\n• Those who treat their parents with kindness shall be rewarded and those who rebuke their parents shall be punished.\n• No deity can save people from the wrath of Allah.\n• A group of jinns embraced Islam after hearing the Quran.\n• Proclaim the message of Allah and bear with the disbelievers patiently."
      }
    ]
  },
  {
    "surah": "47. Muhammad",
    "posts": [
      {
        "text": "• Allah invalidates the deeds of the disbelievers.\n• In war, thoroughly subdue the unbelievers before taking them as prisoners of war.\n• If you help the cause of Allah, Allah will help and protect you.\n• True believers do not follow their own desires in matters of faith.\n• Promise of obedience and good talk which is not followed by action is disliked.\n• War captives should be freed unconditionally or after giving ransom.\n• Allah put the believers to test to know the valiant and the resolute.\n• In cases of war, Allah is on the side of the true believers.\n• Do not be miserly if you are asked to give in the cause of Allah."
      }
    ]
  },
  {
    "surah": "48. Al-Fath",
    "posts": [
      {
        "text": "• Allah granted the Muslims a clear victory through the Treaty of Hudaibiyah.\n• Swearing allegiance to the Prophet was considered swearing allegiance to Allah and Allah was well pleased with their actions.\n• Only the blind, lame and sick are exempt from war.\n• A vision to conquer Makkah was shown to the Prophet.\n• Characteristics of Prophet Muhammad ﷺ and his followers.\n• Strategy of peace and stability."
      }
    ]
  },
  {
    "surah": "49. Al-Hujurat",
    "posts": [
      {
        "text": "• Instruction to lower one’s voice in the presence of the Prophet.\n• Make peace between the believers if they fight among themselves.\n• Islamic etiquettes of moral behaviour:\n  • Do not laugh at one another\n  • Do not defame one another through sarcastic remarks\n  • Do not call one another by offensive nicknames\n  • Avoid immoderate suspicions, for in some cases it is a sin\n  • Do not spy on one another\n  • Do not backbite one another\n• All mankind is created from one man and one woman, therefore, no one has superiority over another and noblest is he who is the most righteous.\n• A true believer is he who believes in Allah, His message and strives in the path of Islam with his wealth and person in the way of Allah."
      }
    ]
  },
  {
    "surah": "50. Qaf",
    "posts": [
      {
        "text": "• Life after death is a reality and there is nothing strange about it.\n• Allah has assigned two angels to each person for noting down every single word that he utters.\n• Every disbeliever will be thrown into Hellfire and Hellfire shall be asked, ‘Are you full.’ Hell will answer, ‘Are there some more!?’\n• Admonish people with the Quran and bear with them in patience."
      }
    ]
  },
  {
    "surah": "51. Adh-Dhariyat",
    "posts": [
      {
        "text": "• Surely the Day of Judgement shall come to pass.\n• There is a lesson in the stories of Pharaoh, Ad, Thamud and people of Nuh.\n• Allah, who built the heavens and spread out the earth, has assigned Prophet Muhammad ﷺ to be a warner for mankind.\n• Allah is independent of people and all needs.\n• Reflecting on the signs of Allah within ourselves and in creation itself."
      }
    ]
  },
  {
    "surah": "52. At-Tur",
    "posts": [
      {
        "text": "• The reward for the righteous will be Paradise in which they will show gratitude for Allah’s graciousness while the deniers of truth will be put in Hellfire.\n• Mission of the Prophet is admonition.\n• Response to the disbelievers’ disbelief:\n  • If they doubt the Quran, let them produce a scripture like it\n  • Were they created without a Creator?\n  • Do they possess the treasures of Allah?\n  • Do they have other means to hear the facts about Allah?\n  • Do they have the knowledge of the unseen? If so let them produce their proof"
      }
    ]
  },
  {
    "surah": "53. An-Najm",
    "posts": [
      {
        "text": "• Scene of the first revelation, brought by Angel Gabriel to Prophet Muhammad ﷺ.\n• Allah gave the Prophet a tour of the heavens, Paradise and other great signs.\n• Lat, Uzza and Manat (goddesses of Arabs) are nothing but names invented by pagan Arabs.\n• Angels have no share in divinity, nor can they even intercede without the permission of Allah.\n• Do not claim piety for yourselves, Allah knows who is god-fearing and pious.\n• No soul shall bear the burden of another; there shall be nothing for a person except what he strived for."
      }
    ]
  },
  {
    "surah": "54. Al-Qamar",
    "posts": [
      {
        "text": "• The Day of Judgement is drawing near yet the disbelievers are not paying heed to the signs of Allah.\n• ‘We have made the Quran easy to understand the admonition, so is there any who would take the admonition?’ This is mentioned four times.\n• The story of Thamud and Lut who called their prophet liars to show how terrible was Allah’s scourge and how clear was His warning.\n• Pharaoh’s people were seized for disbelieving Allah’s warning. The same warning has come to you, will you not take admonition?"
      }
    ]
  },
  {
    "surah": "55. Ar-Rahman",
    "posts": [
      {
        "text": "• It is Allah who created man, taught him the Quran and taught him how to convey his feelings and thoughts.\n• Allah is the Lord of the East and West. It is He who made the laws to regulate the oceans, its products and ships.\n• All that exists will perish except Allah.\n• No one can run away from the jurisdiction of Allah.\n• Sinners will be punished in Hell and the righteous will be awarded Paradise.\n• ‘Which of the favours of your Lord will you deny?’ has been repeated thirty one times."
      }
    ]
  },
  {
    "surah": "56. Al-Waqi’ah",
    "posts": [
      {
        "text": "• Scenes of Judgement Day when:\n  • Some will be abased and some exalted\n  • The earth will be shaken up\n  • The mountains will be crumbled to scattered dust\n  • Mankind will be divided into three groups: the foremost in rank and position, the common righteous people and the disbelievers\n• Admonition to the disbelievers with the examples of creation.\n• The testimony of Allah about the Quran."
      }
    ]
  },
  {
    "surah": "57. Al-Hadid",
    "posts": [
      {
        "text": "• Allah created the heavens and the earth in six periods and has knowledge of everything.\n• On that Day, the true believers will have their light shining before them while the hypocrites will have a fate similar to the disbelievers.\n• Those who spend in charity will be repaid manifold and also be given a generous reward besides it.\n• The life of this world is but play, amusement and illusion.\n• Do not grieve for the things that you miss, nor be overjoyed at what you gain.\n• Prophets Nuh, Ibrahim and Isa were sent for guidance to the right path, as for monasticism, people instituted it themselves."
      }
    ]
  },
  {
    "surah": "58. Al-Mujadilah",
    "posts": [
      {
        "text": "• The rules of zihar (1–4).\n• Warning the enemies of Allah and His Messenger (5–6).\n• Etiquettes of private discussions and gatherings (7–11).\n• Giving charity before conversing privately with the Messenger (12–13).\n• Warning against allying with those who oppose Allah and His Messenger (14–21)."
      }
    ]
  },
  {
    "surah": "59. Al-Hashr",
    "posts": [
      {
        "text": "• The Jewish tribe of Banu Nadir is given the order of exile for their mutiny against the Madinan Muslim community.\n• Distribution of the belongings of Banu Nadir.\n• Historical background of the Jews.\n• Good qualities of true Emigrants and Ansar (the residents of Madinah).\n• Conspiracy of the hypocrites.\n• The parable of a satan versus a disbeliever.\n• Let each soul see what it is sending for the Hereafter.\n• If the Quran was sent down upon a mountain it would have crumbled into pieces from the fear of disobedience to Allah.\n• Fifteen attributes of Allah in three verses: the God, the Knower of the Seen and the Unseen, the Compassionate, the Merciful, the King, the Holy, the Giver of Peace, the Grantor of Security, the Guardian, the Almighty, the Irresistible, the Supreme, the Creator, the Evolver and the Shaper."
      }
    ]
  },
  {
    "surah": "60. Al-Mumtahina",
    "posts": [
      {
        "text": "• Do not befriend those who are the enemies of Allah and the Muslims.\n• Prophet Ibrahim and his companions are an excellent example for the believers.\n• Exception to the prohibition of friendship with disbelievers is made for those who had neither fought against the believers nor expelled them from their homes.\n• For women who become believers, test their faith, and if you find them truthful do not return them to their disbelieving husbands.\n• Women’s oath of allegiance in Islam is based on their commitment that they will not commit shirk, steal, commit adultery, kill their children, give any cause for scandal, or disobey the Prophet.\n• Three issues on which this surah provides guidance:\n  • Ethics of engagement during warfare and peace\n  • Migration of Muslim women to Madinah and the status of their marriages\n  • Women pledging to refrain from major evils prevalent among pre-Islamic Arabia"
      }
    ]
  },
  {
    "surah": "61. As-Saff",
    "posts": [
      {
        "text": "• Believers are commanded not to say something that they won’t do.\n• Prophet Isa gave good news of a messenger coming after him whose name would be Ahmad (Muhammad).\n• A bargain to save oneself from Hellfire is to believe in Allah, His Messenger and strive your utmost in the cause of Allah with one’s wealth and person.\n• Believers are commanded to be the helpers of Allah like the disciples of Isa."
      }
    ]
  },
  {
    "surah": "62. Al-Jumu'ah",
    "posts": [
      {
        "text": "• Allah has appointed Muhammad ﷺ as His Messenger.\n• Allah rebutted the claim of Jews to be the favourites of God to the exclusion of others.\n• Commandment relating to the obligation of Friday prayers."
      }
    ]
  },
  {
    "surah": "63. Al-Munafiqun",
    "posts": [
      {
        "text": "• Hypocrisy is such a sin against Islam and Muslims that even the Messenger’s prayer cannot obtain forgiveness for the hypocrites from Allah.\n• Let not your riches or children divert you from the remembrance of Allah, lest you become a real loser."
      }
    ]
  },
  {
    "surah": "64. At-Taghabun",
    "posts": [
      {
        "text": "• To Allah belongs the kingdom of the heavens and the earth, and He knows all that you conceal and reveal.\n• Surely there will be life after death, the Day of Judgement and reward for good and bad deeds.\n• No affliction can ever befall anyone except by the permission of Allah.\n• Among your wives and children there are some who are your enemies, be aware of them."
      }
    ]
  },
  {
    "surah": "65. At-Talaq",
    "posts": [
      {
        "text": "• Laws of divorce.\n• Iddah (waiting period before the divorce takes effect) is commanded to be three menstrual periods, or three months if menstruation does not apply, and in case of pregnancy it is the delivery of the child.\n• Rebellion against Allah’s commandment may bring stern reckoning or exemplary punishment, so fear Allah and adhere to His laws."
      }
    ]
  },
  {
    "surah": "66. At-Tahrim",
    "posts": [
      {
        "text": "• Do not make something unlawful which Allah has made lawful.\n• Wives of the Prophet are admonished on their behaviour with him.\n• Believers are commanded to turn to Allah in sincere repentance if they want to be forgiven.\n• Example of the wives of Nuh and Lut who will go to Hellfire and the example of Pharaoh’s wife and Maryam who will go to Paradise."
      }
    ]
  },
  {
    "surah": "67. Al-Mulk",
    "posts": [
      {
        "text": "• The kingdom of the universe belongs to Allah.\n• The lower heaven is decorated with stars.\n• The dwellers of Hellfire will wish: ‘Had we only listened to the call of Islam, we would have not been among the inmates of Hellfire.’\n• No one can help you against Allah, nor can any one save you from the punishment of Allah."
      }
    ]
  },
  {
    "surah": "68. Al-Qalam",
    "posts": [
      {
        "text": "• Allah declared Muhammad ﷺ to be of the highest moral character.\n• Commandment of not yielding to any disbelieving oath monger, slanderer and wicked person.\n• Example of the arrogant and miserly owners of a garden who did not want to pay charity and as a result their garden was destroyed.\n• Allah is not going to treat the Muslims as He will treat the guilty.\n• Those who do not believe in Allah’s revelations are led step by step towards destruction and loss.\n• Three important themes of this surah:\n  • Response to the opponents’ objections\n  • Warning and admonition to the disbelievers\n  • Advising the Prophet to be patient"
      }
    ]
  },
  {
    "surah": "69. Al-Haqqah",
    "posts": [
      {
        "text": "• Description of the Day of Resurrection and the Day of Judgement.\n• Righteous people and their reward.\n• Sinful people and their punishment.\n• The Quran is the word of Allah and not of the Prophet, and that it is a reminder for those who fear Allah."
      }
    ]
  },
  {
    "surah": "70. Al-Ma'arij",
    "posts": [
      {
        "text": "• The Day of Judgement will be equal to fifty thousand years.\n• Disbelievers will wish to save themselves from the punishment at the expense of their children, wives, brothers and relatives, but it will not happen.\n• Paradise is not for the disbelievers.\n• Human beings have been created as anxious creatures."
      }
    ]
  },
  {
    "surah": "71. Nuh",
    "posts": [
      {
        "text": "• Prophet Nuh’s preaching and submission to Allah after exhausting all his efforts.\n• Prophet Nuh’s prayer not to leave any disbeliever on the surface of the earth and Allah granted his prayer."
      }
    ]
  },
  {
    "surah": "72. Al-Jinn",
    "posts": [
      {
        "text": "• A beautiful speech of the jinn who embraced Islam after hearing the Quran.\n• Jinns also have different religions and sects, some are Muslims and some are deviators from the truth.\n• Messengers do not have the power to harm or benefit anyone, their mission is only to convey Allah’s message.\n• Only Allah knows the unseen, He reveals what He wants to whom He chooses from the messengers."
      }
    ]
  },
  {
    "surah": "73. Al-Muzzammil",
    "posts": [
      {
        "text": "• Allah ordered the Prophet not to stand in prayer the whole night.\n• Those who oppose the Prophet will be treated with heavy fetters and blazing fire.\n• The Quran is a reminder for those who want to find the right way.\n• Read from the Quran as much as you easily can.\n• Whatever you spend in the way of Allah, you will find it in the Hereafter."
      }
    ]
  },
  {
    "surah": "74. Al-Muddaththir",
    "posts": [
      {
        "text": "• Instructions to the Prophet for cleanliness and patience.\n• The Day of Judgement will be very difficult especially for those who deny Allah’s revelations and oppose His Cause.\n• Actions which lead to the Hellfire are: not offering salah, not feeding the poor, wasting time in vain talk and denying the Day of Judgement."
      }
    ]
  },
  {
    "surah": "75. Al-Qiyamah",
    "posts": [
      {
        "text": "• The Day of Judgement is certain, there is no escape from it.\n• Allah Himself took the responsibility of preserving the Quran.\n• The last moments of a disbeliever’s death.\n• Take Allah’s warning about the Day of Judgement seriously."
      }
    ]
  },
  {
    "surah": "76. Al-Insan",
    "posts": [
      {
        "text": "• The universe was there before mankind existed, then Allah created man, provided him with guidance and let him use his free will: either to believe or to disbelieve.\n• An exemplary life in Paradise for those who choose to believe.\n• Allah gradually sent this Quran according to the issues faced by mankind.\n• This Quran is an admonition for those who want to adopt the way to their God."
      }
    ]
  },
  {
    "surah": "77. Al-Mursalat",
    "posts": [
      {
        "text": "• Allah swears in the name of life giving winds, rain and angels that the Day of Judgement will be established.\n• On that Day, the disbelievers will be asked to walk towards Hell which they used to deny, and the righteous will be given all that they want in Paradise.\n• A warning to the disbelievers and a question as to what statement after this Quran (the last revelation) will they believe?"
      }
    ]
  },
  {
    "surah": "78. An-Naba",
    "posts": [
      {
        "text": "• The creation of the heavens, earth, mountains and vegetation point to inevitability of the Day of Judgement.\n• Resurrection and man’s accountability in the court of Allah.\n• The righteous will be well pleased, while the disbelievers will be put in Hellfire where they will be treated with scalding water and decaying filth."
      }
    ]
  },
  {
    "surah": "79. An-Nazi'at",
    "posts": [
      {
        "text": "• Death, the Day of Resurrection and life after death.\n• The story of Prophet Musa when he called Pharaoh to believe in Allah.\n• Pharaoh denied Allah and was subsequently punished.\n• The creation of man is not harder than the creation of the heavens, earth and everything that exists therein.\n• Punishment and reward on the Day of Judgement."
      }
    ]
  },
  {
    "surah": "80. Abasa",
    "posts": [
      {
        "text": "• Commandment that the seekers of guidance should be given preference in conveying Allah’s message.\n• Man is reminded to recognise his Creator.\n• On the Day of Judgement man will be so concerned about himself that he will not even care about his own mother, father, brother or children."
      }
    ]
  },
  {
    "surah": "81. At-Takwir",
    "posts": [
      {
        "text": "• A scene from the scenes of Judgement Day.\n• The Quran is conveyed to the Prophet through angel Gabriel.\n• This message of the Quran is for all the people of the world."
      }
    ]
  },
  {
    "surah": "82. Al-Infitar",
    "posts": [
      {
        "text": "• A description as to what will happen on the Day of Judgement.\n• Guardian angels are assigned to each individual who are recording each and every word and action.\n• Allah Himself will be the Judge on the Day of Judgement."
      }
    ]
  },
  {
    "surah": "83. Al-Mutaffifin",
    "posts": [
      {
        "text": "• Defrauders will be called to account and punished while the righteous will be rewarded with soft couches, the choicest wine and special spring water.\n• Disbelievers laugh at the believers, a Day will come when they themselves will be laughed at."
      }
    ]
  },
  {
    "surah": "84. Al-Inshiqaq",
    "posts": [
      {
        "text": "• On Judgement Day, the heavens will split asunder and earth will be spread out.\n• The books of deeds will be distributed and the righteous will be happy while disbelievers will be calling for death.\n• The people are asked to believe while they have time during their life on earth."
      }
    ]
  },
  {
    "surah": "85. Al-Buruj",
    "posts": [
      {
        "text": "• Those who torture the believers will be given the punishment of conflagration on the Day of Judgement.\n• He who created you for the first time will bring you back to life once again for accountability and judgement.\n• The story of the People of the Ditch who had burnt the believers to death by casting them into pits full of fire is related.\n• By means of this story the believers and the disbelievers taught a few lessons:\n   1. Just as the People of the Ditch became worthy of Allah’s curse and punishment, the chiefs of Makkah are also becoming worthy of it.\n   2. Just as the believers at that time had willingly accepted to sacrifice their lives by being burnt to death in the pits of fire instead of turning away from their faith, so the believers should also now endure persecution and never give up faith.\n   3. That Allah, to whom belongs the Kingdom of the earth and heavens, is Praiseworthy and is watching what the two groups are striving for."
      }
    ]
  },
  {
    "surah": "86. At-Tariq",
    "posts": [
      {
        "text": "• Allah has appointed a guardian angel over each soul.\n• The Quran is the decisive word of Allah.\n• Man has to appear before Allah after death."
      }
    ]
  },
  {
    "surah": "87. Al-A'la",
    "posts": [
      {
        "text": "• Allah is Almighty, always glorify Him.\n• Allah has eased the responsibility of Prophet Muhammad’s ﷺ memorisation of the Quran by assuring him that he will not forget any portion of it.\n• Those who heed Allah’s reminders will be successful in the Hereafter."
      }
    ]
  },
  {
    "surah": "88. Al-Ghashiyah",
    "posts": [
      {
        "text": "• The condition of the disbelievers and the believers on the Day of Judgement.\n• The wonders of nature, admonition and accountability."
      }
    ]
  },
  {
    "surah": "89. Al-Fajr",
    "posts": [
      {
        "text": "• The admonition for social welfare through the examples of past nations.\n• What should be avoided in realising social welfare?\n• The Day of Judgement will be too late to heed the admonition."
      }
    ]
  },
  {
    "surah": "90. Al-Balad",
    "posts": [
      {
        "text": "• An admonition to the disbelievers.\n• Allah has given you two eyes, one tongue and two lips to control your tongue.\n• The qualities of a righteous person: freeing a slave, feeding the hungry, being patient, advising others about piety and compassion."
      }
    ]
  },
  {
    "surah": "91. Ash-Shams",
    "posts": [
      {
        "text": "• Success depends on keeping the soul pure and failure depends on corrupting it; the people of Thamud were levelled to the ground for that very reason.\n• Just as the sun and the moon, the day and the night, the earth and the sky, are different from each other and contradictory in their effects and results, so are good and evil different from each other and contradictory in their effects and results; they are neither alike in their outward appearance nor can they be alike in their results.\n• Allah, after giving the human his body, sense and mind has not left him uninformed in the world, but has instilled into his subconscious, by means of a natural inspiration, the distinction between good and evil, right and wrong.\n• The future of man depends on recognising these differences, developing the good and suppressing the evil tendencies of the self.\n• If he develops good inclinations and frees himself of evil inclinations, he will attain eternal success, and if, on the contrary, he suppresses good and promotes evil, he will meet with disappointments and failures."
      }
    ]
  },
  {
    "surah": "92. Al-Layl",
    "posts": [
      {
        "text": "• For good people, Allah will facilitate the easy way and for the wicked, the hard way.\n• What benefit will one get from his wealth if he himself is doomed?"
      }
    ]
  },
  {
    "surah": "93. Ad-Duha",
    "posts": [
      {
        "text": "• Good news to the Prophet Muhammad ﷺ that the later period will be better for him than the earlier.\n• The theme of this surah is to console the Prophet ﷺ and its objective is to remove his anxiety and distress, which was caused by the suspension of revelation."
      }
    ]
  },
  {
    "surah": "94. Ash-Sharh",
    "posts": [
      {
        "text": "• Allah expanded the chest of the Prophet, relieved his burden and exalted his fame.\n• This surah is also to console and encourage the Prophet.\n• This surah states that Allah has bestowed three major favours on the Prophet:\n  • The blessing of sharh sadr (opening up of the heart)\n  • Removing from him the heavy burden that was weighing down his back before the call\n  • Exalting his status the like of which has never been granted to any man before"
      }
    ]
  },
  {
    "surah": "95. At-Tin",
    "posts": [
      {
        "text": "• Man is the best creature of all, except the disbelievers.\n• Mention of rewards and punishments in the Hereafter.\n• Man has been blessed with such excellent capabilities that he can attain the highest position which has not been attained by any other creature.\n• There are two kinds of men:\n  • Those who despite having been created in the finest of moulds, become inclined to evil and their moral degeneration causes them to be reduced to the lowest of the low.\n  • Those, who by adopting the way of faith and righteousness, remain secure from degeneration and are consistent with their status of being created in the best of moulds."
      }
    ]
  },
  {
    "surah": "96. Al-Alaq",
    "posts": [
      {
        "text": "• The very first revelation: ‘Read in the name of your Lord who created – what he did not know.’\n• Importance of reading and acquiring knowledge.\n• Those who forbid others from the worship of Allah will be dragged to Hell by their forelock."
      }
    ]
  },
  {
    "surah": "97. Al-Qadr",
    "posts": [
      {
        "text": "• The Night of Power in which the Quran was revealed is better than one thousand months.\n• The theme of this surah is to acquaint man with the value, worth and importance of the Quran.\n• The angels and specifically angel Gabriel descend on this blessed night."
      }
    ]
  },
  {
    "surah": "98. Al-Bayyinah",
    "posts": [
      {
        "text": "• Jews and Christians did not divide into sects until after receiving guidance.\n• The People of the Book were also commanded to establish salah and pay zakah as it is commanded in the Quran."
      }
    ]
  },
  {
    "surah": "99. Az-Zalzalah",
    "posts": [
      {
        "text": "• On the Day of Judgement, the earth will report whatever happened on her and human beings shall be shown their books of deeds.\n• Every action will be accounted for – good or evil."
      }
    ]
  },
  {
    "surah": "100. Al-Adiyat",
    "posts": [
      {
        "text": "• An example that horses are more grateful to their owners than men are to their Lord.\n• People’s love of wealth and their ingratitude to their Lord.\n• On the Day of Judgement, everyone’s secrets will be revealed."
      }
    ]
  },
  {
    "surah": "101. Al-Qari'ah",
    "posts": [
      {
        "text": "• A scene explaining the Day of Judgement.\n• People will be rewarded or punished according to their deeds.\n• People will be at total loss and helpless as if they were scattered moths."
      }
    ]
  },
  {
    "surah": "102. At-Takathur",
    "posts": [
      {
        "text": "• The cause of man’s destruction is mutual rivalry for worldly gains, and real success lies in working for the life Hereafter.\n• People are warned about the evil consequences of worldly worship.\n• Rivalry with one another, bragging and boasting about their acquisitions is not going to end until death."
      }
    ]
  },
  {
    "surah": "103. Al-Asr",
    "posts": [
      {
        "text": "• Everyone will be a loser of the Day of Judgement except those who embody certain principles of faith.\n• The way to salvation is to become a believer, do good deeds, be truthful and patient and advise the same to others."
      }
    ]
  },
  {
    "surah": "104. Al-Humazah",
    "posts": [
      {
        "text": "• The slanderer, defamer and raiser shall be thrown into the blazing fire.\n• Piling up wealth without spending it in good causes is reprimanded."
      }
    ]
  },
  {
    "surah": "105. Al-Fil",
    "posts": [
      {
        "text": "• An example that Allah can save His House (Kabah) by destroying an army of elephants, through a flock of birds.\n• Allah’s plan is always victorious.\n• Truth will always prevail."
      }
    ]
  },
  {
    "surah": "106. Quraysh",
    "posts": [
      {
        "text": "• An admonition to believe in Allah, who is the provider of our sustenance.\n• Allah bestowed upon the Quraysh blessing of status, power, and security and economic stability."
      }
    ]
  },
  {
    "surah": "107. Al-Ma'un",
    "posts": [
      {
        "text": "• Disbelief in the Hereafter is the main cause of moral decay.\n• God consciousness, social welfare and caring about other people’s necessities of life are the main purposes of salah."
      }
    ]
  },
  {
    "surah": "108. Al-Kawthar",
    "posts": [
      {
        "text": "• Allah has made Prophet Muhammad’s ﷺ name everlasting.\n• The Prophet is reassured that the disbeliever’s enmity and spite will not harm him."
      }
    ]
  },
  {
    "surah": "109. Al-Kafirun",
    "posts": [
      {
        "text": "• Allah’s commandment not to compromise in matters of faith.\n• Co-existence of religions."
      }
    ]
  },
  {
    "surah": "110. An-Nasr",
    "posts": [
      {
        "text": "• Victory is not an occasion of exultation, but an occasion to glorify Allah.\n• Victory comes with the help of Allah.\n• Indication is given that the mission of the Prophet has been fulfilled."
      }
    ]
  },
  {
    "surah": "111. Al-Masad",
    "posts": [
      {
        "text": "• Allah has cursed Abu Lahab and his wife who were the arch enemies of the Prophet.\n• Abu Lahab’s wealth will be of no use to him on the Day of Judgement."
      }
    ]
  },
  {
    "surah": "112. Al-Ikhlas",
    "posts": [
      {
        "text": "• The unique attributes of Allah.\n• He neither begets nor is born.\n• There is none like Allah."
      }
    ]
  },
  {
    "surah": "113. Al-Falaq",
    "posts": [
      {
        "text": "• Seek refuge with Allah from all evils.\n• Seek refuge with Allah from the slinking whisperers.\n• Seek refuge with Allah from those who envy."
      }
    ]
  },
  {
    "surah": "114. An-Nas",
    "posts": [
      {
        "text": "• Seek refuge with Allah from evil whisperers.\n• Seek refuge with Allah from the slinking whisperers.\n• Acknowledge Allah as the Lord of mankind."
      }
    ]
  }
]

