[
  {
    "surah": "1. Al-Fatiha",
    "posts": [
      {
        "title": "1:1 | Allah's beautiful names",
        "arabic": "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ",
        "transliteration": "Bismillah ir-Rahman ir-Raheem",
        "translation": "In the name of Allah, the Entirely Merciful, the Especially Merciful."
      },
      {
        "title": "1:2 | Praise is only to him",
        "arabic": "ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَـٰلَمِينَ",
        "transliteration": "Alhamdulillahi Rabbil 'Alamin",
        "translation": "All praise is due to Allah, Lord of the worlds."
      },
      {
        "title": "1:4 | First mention of the hereafter",
        "arabic": "مَالِكِ يَوْمِ ٱلدِّينِ",
        "transliteration": "Maliki Yawm id-Deen",
        "translation": "Sovereign of the Day of Recompense."
      },
      {
        "title": "1:5 | Sincerity",
        "arabic": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
        "transliteration": "Iyyaka na'budu wa iyyaka nasta'een",
        "translation": "It is You we worship and You alone we ask for help."
      },
      {
        "title": "1:6 | Steadfastness",
        "arabic": "ٱهْدِنَا ٱلصِّرَٰطَ ٱلْمُسْتَقِيمَ",
        "transliteration": "Ihdinas-sirat al-mustaqeem",
        "translation": "Guide us to the Straight Path."
      },
      {
        "title": "1:7 | Seeking good companionship",
        "arabic": "صِرَٰطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِمْ وَلَا ٱلضَّآلِّينَ",
        "transliteration": "Sirat alladhina an'amta 'alayhim ghayril-maghdubi 'alayhim wa la-dhaalleen",
        "translation": "The path of those upon whom You have favoured, not those who have earned Your anger nor of those who went astray."
      }
    ]
  },
  {
    "surah": "2. Al-Baqarah",
    "posts": [
      {
        "title": "2:2 | A Guide for the God-fearing people",
        "arabic": "ذَٰلِكَ ٱلۡكِتَٰبُ لَا رَيۡبَۛ فِيهِۛ هُدٗى لِّلۡمُتَّقِينَ",
        "transliteration": "Dhalika al-kitabu la rayba fihi hudan lil-muttaqeen",
        "translation": "This is the Book about which there is no doubt, a guidance for those conscious of Allah."
      },
      {
        "title": "2:3 | Belief in the unseen, establish prayer and spend in charity",
        "arabic": "ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ",
        "transliteration": "Allatheena yuminoona bilghaybi wayuqeemoona assalata wamimma razaqnahum yunfiqoon",
        "translation": "Who believe in the unseen, establish prayer, and spend out of what We have provided for them"
      },
      {
          "title": "2:4 | Belief in previous scriptures",
          "arabic": "وَٱلَّذِينَ يُؤۡمِنُونَ بِمَآ أُنزِلَ إِلَيۡكَ وَمَآ أُنزِلَ مِن قَبۡلِكَ وَبِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ",
          "transliteration": "Wallatheena yuminoona bima onzila ilayka wama onzila min qablika wabilakhirati hum yooqinoon",
          "translation": "And who believe in what has been revealed to you, [O Muhammad], and what was revealed before you, and of the Hereafter they are certain [in faith]."
      },
      {
          "title": "2:21 | Commandment to worship",
          "arabic": "يَٰٓأَيُّهَا ٱلنَّاسُ ٱعۡبُدُواْ رَبَّكُمُ ٱلَّذِي خَلَقَكُمۡ وَٱلَّذِينَ مِن قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُونَ",
          "transliteration": "Ya-ayyuha annasu oAAbudoo rabbakumu allathee khalaqakum wallatheena min qablikum laAAallakum tattaqoon",
          "translation": "O mankind, worship your Lord, who created you and those before you, that you may become righteous"
      },
      {
          "title": "2:37 | Repentance of Prophet Adam",
          "arabic": "فَتَلَقَّىٰٓ ءَادَمُ مِن رَّبِّهِۦ كَلِمَٰتٖ فَتَابَ عَلَيۡهِۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
          "transliteration": "Fatalaqqa adamu min rabbihi kalimatin fataba AAalayhi innahu huwa attawwabu arraheem",
          "translation": "Then Adam received from his Lord [some] words, and He accepted his repentance. Indeed, it is He who is the Accepting of repentance, the Merciful."
      },
      {
          "title": "2:138 | Moulded by Allah",
          "arabic": "صِبۡغَةَ ٱللَّهِ وَمَنۡ أَحۡسَنُ مِنَ ٱللَّهِ صِبۡغَةٗۖ وَنَحۡنُ لَهُۥ عَٰبِدُونَ",
          "transliteration": "Sibghata Allahi waman ahsanu mina Allahi sibghatan wanahnu lahu AAabidoon",
          "translation": "[And say,Ours is] the religion of Allah. And who is better than Allah in [ordaining] religion? And we are worshippers of Him."
      },
      {
          "title": "2:151 | Four functions of prophethood",
          "arabic": "كَمَآ أَرۡسَلۡنَا فِيكُمۡ رَسُولٗا مِّنكُمۡ يَتۡلُواْ عَلَيۡكُمۡ ءَايَٰتِنَا وَيُزَكِّيكُمۡ وَيُعَلِّمُكُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَيُعَلِّمُكُم مَّا لَمۡ تَكُونُواْ تَعۡلَمُونَ",
          "transliteration": "Kama arsalna feekum rasoolan minkum yatloo AAalaykum ayatina wayuzakkeekum wayuAAallimukumu alkitaba walhikmata wayuAAallimukum ma lam takoonoo taAAlamoon",
          "translation": "Just as We have sent among you a messenger from yourselves reciting to you Our verses and purifying you and teaching you the Book and wisdom and teaching you that which you did not know."
      },
      {
          "title": "2:152 | Consequence of remembrance",
          "arabic": "فَٱذۡكُرُونِيٓ أَذۡكُرۡكُمۡ وَٱشۡكُرُواْ لِي وَلَا تَكۡفُرُونِ",
          "transliteration": "Fathkuroonee athkurkum washkuroo lee wala takfuroon",
          "translation": "So remember Me; I will remember you. And be grateful to Me and do not deny Me."
      },
      {
          "title": "2:155 | Test by fear, hunger and depletion of wealth and lives",
          "arabic": "وَلَنَبۡلُوَنَّكُم بِشَيۡءٖ مِّنَ ٱلۡخَوۡفِ وَٱلۡجُوعِ وَنَقۡصٖ مِّنَ ٱلۡأَمۡوَٰلِ وَٱلۡأَنفُسِ وَٱلثَّمَرَٰتِۗ وَبَشِّرِ ٱلصَّٰبِرِينَ",
          "transliteration": "Walanabluwannakum bishayin mina alkhawfi waljooAAi wanaqsin mina alamwali walanfusi waththamarati wabashshiri assabireen",
          "translation": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient."
      },
      {
          "title": "2:168 | Concept of halal and tayyib - law and ethics",
          "arabic": "يَٰٓأَيُّهَا ٱلنَّاسُ كُلُواْ مِمَّا فِي ٱلۡأَرۡضِ حَلَٰلٗا طَيِّبٗا وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٌ",
          "transliteration": "Ya-ayyuha annasu kuloo mimma fee alardi halalan tayyiban wala tattabiAAoo khutuwati ashshaytani innahu lakum AAaduwwun mubeen",
          "translation": "O mankind, eat from whatever is on earth [that is] lawful and good and do not follow the footsteps of Satan. Indeed, he is to you a clear enemy."
      },
      {
          "title": "2:183 | Obligation of fasting",
          "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُتِبَ عَلَيۡكُمُ ٱلصِّيَامُ كَمَا كُتِبَ عَلَى ٱلَّذِينَ مِن قَبۡلِكُمۡ لَعَلَّكُمۡ تَتَّقُونَ",
          "transliteration": "Ya-ayyuha allatheena amanoo kutiba AAalaykumu assiyamu kama kutiba AAala allatheena min qablikum laAAallakum tattaqoon",
          "translation": "O you who have believed, decreed upon you is fasting as it was decreed upon those before you that you may become righteous."
      },
      {
          "title": "2:186 | Supplicating to Allah - dua",
          "arabic": "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌۖ أُجِيبُ دَعۡوَةَ ٱلدَّاعِ إِذَا دَعَانِۖ فَلۡيَسۡتَجِيبُواْ لِي وَلۡيُؤۡمِنُواْ بِي لَعَلَّهُمۡ يَرۡشُدُونَ",
          "transliteration": "Waitha saalaka AAibadee AAannee fainnee qareebun ojeebu daAAwata addaAAi itha daAAani falyastajeeboo lee walyuminoo bee laAAallahum yarshudoon",
          "translation": "And when My servants ask you, [O Muhammad], concerning Me - indeed I am near. I respond to the invocation of the supplicant when he calls upon Me. So let them respond to Me [by obedience] and believe in Me that they may be [rightly] guided."
      },
      {
          "title": "2:255 | Ayat-ul Kursi: The greatest verse in the Quran",
          "arabic": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ",
          "transliteration": "Allahu la ilaha illa huwa alhayyu alqayyoomu la takhuthuhu sinatun wala nawmun lahu ma fee assamawati wama fee alardi man tha allathee yashfaAAu AAindahu illa biithnihi yaAAlamu ma bayna aydeehim wama khalfahum wala yuheetoona bishayin min AAilmihi illa bima shaa wasiAAa kursiyyuhu assamawati walarda wala yaooduhu hifthuhuma wahuwa alAAaliyyu alAAatheem",
          "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great."
      },
      {
          "title": "2:265 | Metaphor of giving",
          "arabic": "وَمَثَلُ ٱلَّذِينَ يُنفِقُونَ أَمۡوَٰلَهُمُ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِ وَتَثۡبِيتٗا مِّنۡ أَنفُسِهِمۡ كَمَثَلِ جَنَّةِۭ بِرَبۡوَةٍ أَصَابَهَا وَابِلٞ فَـَٔاتَتۡ أُكُلَهَا ضِعۡفَيۡنِ فَإِن لَّمۡ يُصِبۡهَا وَابِلٞ فَطَلّٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٌ",
          "transliteration": "Wamathalu allatheena yunfiqoona amwalahumu ibtighaa mardati Allahi watathbeetan min anfusihim kamathali jannatin birabwatin asabaha wabilun faatat okulaha diAAfayni fain lam yusibha wabilun fatallun wallahu bima taAAmaloona baseer",
          "translation": "And the example of those who spend their wealth seeking means to the approval of Allah and assuring [reward for] themselves is like a garden on high ground which is hit by a downpour - so it yields its fruits in double. And [even] if it is not hit by a downpour, then a drizzle [is sufficient]. And Allah, of what you do, is Seeing."
      },
      {
          "title": "2:269 | Importance of wisdom",
          "arabic": "يُؤۡتِي ٱلۡحِكۡمَةَ مَن يَشَآءُۚ وَمَن يُؤۡتَ ٱلۡحِكۡمَةَ فَقَدۡ أُوتِيَ خَيۡرٗا كَثِيرٗاۗ وَمَا يَذَّكَّرُ إِلَّآ أُوْلُواْ ٱلۡأَلۡبَٰبِ",
          "transliteration": "Yutee alhikmata man yashao waman yuta alhikmata faqad ootiya khayran katheeran wama yaththakkaru illa oloo alalbab",
          "translation": "He gives wisdom to whom He wills, and whoever has been given wisdom has certainly been given much good. And none will remember except those of understanding."
      },
      {
          "title": "2:275 | Warning against taking riba (usury)",
          "arabic": "ٱلَّذِينَ يَأۡكُلُونَ ٱلرِّبَوٰاْ لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ ٱلَّذِي يَتَخَبَّطُهُ ٱلشَّيۡطَٰنُ مِنَ ٱلۡمَسِّۚ ذَٰلِكَ بِأَنَّهُمۡ قَالُوٓاْ إِنَّمَا ٱلۡبَيۡعُ مِثۡلُ ٱلرِّبَوٰاْۗ وَأَحَلَّ ٱللَّهُ ٱلۡبَيۡعَ وَحَرَّمَ ٱلرِّبَوٰاْۚ فَمَن جَآءَهُۥ مَوۡعِظَةٞ مِّن رَّبِّهِۦ فَٱنتَهَىٰ فَلَهُۥ مَا سَلَفَ وَأَمۡرُهُۥٓ إِلَى ٱللَّهِۖ وَمَنۡ عَادَ فَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ",
          "transliteration": "Allatheena yakuloona arriba la yaqoomoona illa kama yaqoomu allathee yatakhabbatuhu ashshaytanu mina almassi thalika biannahum qaloo innama albayAAu mithlu arriba waahalla Allahu albayAAa waharrama arriba faman jaahu mawAAithatun min rabbihi fantaha falahu ma salafa waamruhu ila Allahi waman AAada faolaika ashabu annari hum feeha khalidoon",
          "translation": "Those who consume interest cannot stand [on the Day of Resurrection] except as one stands who is being beaten by Satan into insanity. That is because they say, \"Trade is [just] like interest.\" But Allah has permitted trade and has forbidden interest. So whoever has received an admonition from his Lord and desists may have what is past, and his affair rests with Allah. But whoever returns to [dealing in interest or usury] - those are the companions of the Fire; they will abide eternally therein."
      }
    ]
  },
  {
              "surah": "3. Al-Imran",
              "posts": [
                {
                  "title": "3:14 | Temptations of the dunya (the world)",
                  "arabic": "زُيِّنَ لِلنَّاسِ حُبُّ ٱلشَّهَوَٰتِ مِنَ ٱلنِّسَآءِ وَٱلۡبَنِينَ وَٱلۡقَنَٰطِيرِ ٱلۡمُقَنطَرَةِ مِنَ ٱلذَّهَبِ وَٱلۡفِضَّةِ وَٱلۡخَيۡلِ ٱلۡمُسَوَّمَةِ وَٱلۡأَنۡعَٰمِ وَٱلۡحَرۡثِۗ ذَٰلِكَ مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَٱللَّهُ عِندَهُۥ حُسۡنُ ٱلۡمَـَٔابِ",
                  "transliteration": "Zuyyina linnasi hubbu ashshahawati mina annisai walbaneena walqanateeri almuqantarati mina aththahabi walfiddati walkhayli almusawwamati walanAAami walharthi thalika mataAAu alhayati addunya wallahu AAindahu husnu almaab",
                  "translation": "Beautified for people is the love of that which they desire - of women and sons, heaped-up sums of gold and silver, fine branded horses, and cattle and tilled land. That is the enjoyment of worldly life, but Allah has with Him the best return."
                },
                {
                    "title": "3:26 | Source of all power and sovereignty",
                    "arabic": "قُلِ ٱللَّهُمَّ مَٰلِكَ ٱلۡمُلۡكِ تُؤۡتِي ٱلۡمُلۡكَ مَن تَشَآءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُۖ بِيَدِكَ ٱلۡخَيۡرُۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ",
                    "transliteration": "Quli allahumma malika almulki tutee almulka man tashao watanziAAu almulka mimman tashao watuAAizzu man tashao watuthillu man tashao biyadika alkhayru innaka AAala kulli shayin qadeer",
                    "translation": "Say, O Allah, Owner of Sovereignty, You give sovereignty to whom You will and You take sovereignty away from whom You will. You honor whom You will and You humble whom You will. In Your hand is [all] good. Indeed, You are over all things competent."
                },
                {
                    "title": "3:97 | Obligation of Hajj",
                    "arabic": "فِيهِ ءَايَٰتُۢ بَيِّنَٰتٞ مَّقَامُ إِبۡرَٰهِيمَۖ وَمَن دَخَلَهُۥ كَانَ ءَامِنٗاۗ وَلِلَّهِ عَلَى ٱلنَّاسِ حِجُّ ٱلۡبَيۡتِ مَنِ ٱسۡتَطَاعَ إِلَيۡهِ سَبِيلٗاۚ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِيٌّ عَنِ ٱلۡعَٰلَمِينَ",
                    "transliteration": "Feehi ayatun bayyinatun maqamu ibraheema waman dakhalahu kana aminan walillahi AAala annasi hijju albayti mani istataAAa ilayhi sabeelan waman kafara fainna Allaha ghaniyyun AAani alAAalameen",
                    "translation": "In it are clear signs [such as] the standing place of Abraham. And whoever enters it shall be safe. And [due] to Allah from the people is a pilgrimage to the House - for whoever is able to find thereto a way. But whoever disbelieves - then indeed, Allah is free from need of the worlds."
                },
                {
                    "title": "3:104 | Enjoin good and forbid evil",
                    "arabic": "وَلۡتَكُن مِّنكُمۡ أُمَّةٞ يَدۡعُونَ إِلَى ٱلۡخَيۡرِ وَيَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَيَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ",
                    "transliteration": "Waltakun minkum ommatun yadAAoona ila alkhayri wayamuroona bilmaAAroofi wayanhawna AAani almunkari waolaika humu almuflihoon",
                    "translation": "And let there be [arising] from you a nation inviting to [all that is] good, enjoining what is right and forbidding what is wrong, and those will be the successful."
                },
                {
                    "title": "3:134 | Qualities of the God-fearing",
                    "arabic": "ٱلَّذِينَ يُنفِقُونَ فِي ٱلسَّرَّآءِ وَٱلضَّرَّآءِ وَٱلۡكَٰظِمِينَ ٱلۡغَيۡظَ وَٱلۡعَافِينَ عَنِ ٱلنَّاسِۗ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ",
                    "transliteration": "Allatheena yunfiqoona fee assarrai waddarrai walkathimeena alghaytha walAAafeena AAani annasi wallahu yuhibbu almuhsineen",
                    "translation": "Who spend [in the cause of Allah] during ease and hardship and who restrain anger and who pardon the people - and Allah loves the doers of good;"
                },
                {
                    "title": "3:159 | Character and self-discipline",
                    "arabic": "فَبِمَا رَحۡمَةٖ مِّنَ ٱللَّهِ لِنتَ لَهُمۡۖ وَلَوۡ كُنتَ فَظًّا غَلِيظَ ٱلۡقَلۡبِ لَٱنفَضُّواْ مِنۡ حَوۡلِكَۖ فَٱعۡفُ عَنۡهُمۡ وَٱسۡتَغۡفِرۡ لَهُمۡ وَشَاوِرۡهُمۡ فِي ٱلۡأَمۡرِۖ فَإِذَا عَزَمۡتَ فَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَوَكِّلِينَ",
                    "transliteration": "Fabima rahmatin mina Allahi linta lahum walaw kunta faththan ghaleetha alqalbi lanfaddoo min hawlika faAAfu AAanhum wastaghfir lahum washawirhum fee alamri faitha AAazamta fatawakkal AAala Allahi inna Allaha yuhibbu almutawakkileen",
                    "translation": "So by mercy from Allah, [O Muhammad], you were lenient with them. And if you had been rude [in speech] and harsh in heart, they would have disbanded from about you. So pardon them and ask forgiveness for them and consult them in the matter. And when you have decided, then rely upon Allah. Indeed, Allah loves those who rely [upon Him]."
                },
                {
                    "title": "3:164 | Mission of the Prophet Muhammad",
                    "arabic": "لَقَدۡ مَنَّ ٱللَّهُ عَلَى ٱلۡمُؤۡمِنِينَ إِذۡ بَعَثَ فِيهِمۡ رَسُولٗا مِّنۡ أَنفُسِهِمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِهِۦ وَيُزَكِّيهِمۡ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَإِن كَانُواْ مِن قَبۡلُ لَفِي ضَلَٰلٖ مُّبِينٍ",
                    "transliteration": "Laqad manna Allahu AAala almumineena ith baAAatha feehim rasoolan min anfusihim yatloo AAalayhim ayatihi wayuzakkeehim wayuAAallimuhumu alkitaba walhikmata wain kanoo min qablu lafee dalalin mubeen",
                    "translation": "Certainly did Allah confer [great] favor upon the believers when He sent among them a Messenger from themselves, reciting to them His verses and purifying them and teaching them the Book and wisdom, although they had been before in manifest error."
                },
                {
                    "title": "3:173 | Allah is sufficient for us",
                    "arabic": "ٱلَّذِينَ قَالَ لَهُمُ ٱلنَّاسُ إِنَّ ٱلنَّاسَ قَدۡ جَمَعُواْ لَكُمۡ فَٱخۡشَوۡهُمۡ فَزَادَهُمۡ إِيمَٰنٗا وَقَالُواْ حَسۡبُنَا ٱللَّهُ وَنِعۡمَ ٱلۡوَكِيلُ",
                    "transliteration": "",
                    "translation": "Those to whom hypocrites said, \"Indeed, the people have gathered against you, so fear them.\" But it [merely] increased them in faith, and they said, \"Sufficient for us is Allah, and [He is] the best Disposer of affairs.\""
                },
                {
                    "title": "3:200 | Be patient if you want to be successful",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱصۡبِرُواْ وَصَابِرُواْ وَرَابِطُواْ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ",
                    "transliteration": "Ya-ayyuha allatheena amanoo isbiroo wasabiroo warabitoo wattaqoo Allaha laAAallakum tuflihoon",
                    "translation": "O you who have believed, persevere and endure and remain stationed and fear Allah that you may be successful."
                }
              ]
            },
            {
              "surah": "4. An-Nisa",
              "posts": [
                  {
                    "title": "4:48 | Shirk (associating others with Allah): an unforgiveable sin",
                    "arabic": "إِنَّ ٱللَّهَ لَا يَغۡفِرُ أَن يُشۡرَكَ بِهِۦ وَيَغۡفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَآءُۚ وَمَن يُشۡرِكۡ بِٱللَّهِ فَقَدِ ٱفۡتَرَىٰٓ إِثۡمًا عَظِيمًا",
                    "transliteration": "Inna Allaha la yaghfiru an yushraka bihi wayaghfiru ma doona thalika liman yashao waman yushrik billahi faqadi iftara ithman AAatheema",
                    "translation": "Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills. And he who associates others with Allah has certainly fabricated a tremendous sin."
                },
                {
                    "title": "4:75 | Permission to fight againts those who persecute others",
                    "arabic": "وَمَا لَكُمۡ لَا تُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ وَٱلۡمُسۡتَضۡعَفِينَ مِنَ ٱلرِّجَالِ وَٱلنِّسَآءِ وَٱلۡوِلۡدَٰنِ ٱلَّذِينَ يَقُولُونَ رَبَّنَآ أَخۡرِجۡنَا مِنۡ هَٰذِهِ ٱلۡقَرۡيَةِ ٱلظَّالِمِ أَهۡلُهَا وَٱجۡعَل لَّنَا مِن لَّدُنكَ وَلِيّٗا وَٱجۡعَل لَّنَا مِن لَّدُنكَ نَصِيرًا",
                    "transliteration": "Wama lakum la tuqatiloona fee sabeeli Allahi walmustadAAafeena mina arrijali wannisai walwildani allatheena yaqooloona rabbana akhrijna min hathihi alqaryati aththalimi ahluha wajAAal lana min ladunka waliyyan wajAAal lana min ladunka naseera",
                    "translation": "And what is [the matter] with you that you fight not in the cause of Allah and [for] the oppressed among men, women, and children who say, \"Our Lord, take us out of this city of oppressive people and appoint for us from Yourself a protector and appoint for us from Yourself a helper?\""
                    
                },
                {
                    "title": "4:80 | Obeying the Messenger",
                    "arabic": "مَّن يُطِعِ ٱلرَّسُولَ فَقَدۡ أَطَاعَ ٱللَّهَۖ وَمَن تَوَلَّىٰ فَمَآ أَرۡسَلۡنَٰكَ عَلَيۡهِمۡ حَفِيظٗا",
                    "transliteration": "Man yutiAAi arrasoola faqad ataAAa Allaha waman tawalla fama arsalnaka AAalayhim hafeetha",
                    "translation": "He who obeys the Messenger has obeyed Allah; but those who turn away - We have not sent you over them as a guardian."
                },
                {
                    "title": "4:86 | Replying to greetings",
                    "arabic": "وَإِذَا حُيِّيتُم بِتَحِيَّةٖ فَحَيُّواْ بِأَحۡسَنَ مِنۡهَآ أَوۡ رُدُّوهَآۗ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٍ حَسِيبًا",
                    "transliteration": "Waitha huyyeetum bitahiyyatin fahayyoo biahsana minha aw ruddooha inna Allaha kana AAala kulli shayin haseeba",
                    "translation": "And when you are greeted with a greeting, greet [in return] with one better than it or [at least] return it [in a like manner]. Indeed, Allah is ever, over all things, an Accountant."
                },
                {
                    "title": "4:171 | Christians and Jesus",
                    "arabic": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَا تَغۡلُواْ فِي دِينِكُمۡ وَلَا تَقُولُواْ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِيحُ عِيسَى ٱبۡنُ مَرۡيَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥٓ أَلۡقَىٰهَآ إِلَىٰ مَرۡيَمَ وَرُوحٞ مِّنۡهُۖ فَـَٔامِنُواْ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُواْ ثَلَٰثَةٌۚ ٱنتَهُواْ خَيۡرٗا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَٰهٞ وَٰحِدٞۖ سُبۡحَٰنَهُۥٓ أَن يَكُونَ لَهُۥ وَلَدٞۘ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا",
                    "transliteration": "Ya-ahla alkitabi la taghloo fee deenikum wala taqooloo AAala Allahi illa alhaqqa innama almaseehu AAeesa ibnu maryama rasoolu Allahi wakalimatuhu alqaha ila maryama waroohun minhu faaminoo billahi warusulihi wala taqooloo thalathatun intahoo khayran lakum innama Allahu ilahun wahidun subhanahu an yakoona lahu waladun lahu ma fee assamawati wama fee alardi wakafa billahi wakeela",
                    "translation": "O People of the Scripture, do not commit excess in your religion or say about Allah except the truth. The Messiah, Jesus, the son of Mary, was but a messenger of Allah and His word which He directed to Mary and a soul [created at a command] from Him. So believe in Allah and His messengers. And do not say, \"Three\"; desist - it is better for you. Indeed, Allah is but one God. Exalted is He above having a son. To Him belongs whatever is in the heavens and whatever is on the earth. And sufficient is Allah as Disposer of affairs."
                }
              ]
            },
            {
              "surah": "5. Al-Ma'idah",
              "posts": [
                {
                    "title": "5:2 | Co-operation in good acts",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُحِلُّواْ شَعَٰٓئِرَ ٱللَّهِ وَلَا ٱلشَّهۡرَ ٱلۡحَرَامَ وَلَا ٱلۡهَدۡيَ وَلَا ٱلۡقَلَٰٓئِدَ وَلَآ ءَآمِّينَ ٱلۡبَيۡتَ ٱلۡحَرَامَ يَبۡتَغُونَ فَضۡلٗا مِّن رَّبِّهِمۡ وَرِضۡوَٰنٗاۚ وَإِذَا حَلَلۡتُمۡ فَٱصۡطَادُواْۚ وَلَا يَجۡرِمَنَّكُمۡ شَنَـَٔانُ قَوۡمٍ أَن صَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ أَن تَعۡتَدُواْۘ وَتَعَاوَنُواْ عَلَى ٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَلَا تَعَاوَنُواْ عَلَى ٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِۚ وَٱتَّقُواْ ٱللَّهَۖ إِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ",
                    "transliteration": "Ya-ayyuha allatheena amanoo la tuhilloo shaAAaira Allahi wala ashshahra alharama wala alhadya wala alqalaida wala ammeena albayta alharama yabtaghoona fadlan min rabbihim waridwanan waitha halaltum fastadoo wala yajrimannakum shanaanu qawmin an saddookum AAani almasjidi alharami an taAAtadoo wataAAawanoo AAala albirri wattaqwa wala taAAawanoo AAala alithmi walAAudwani wattaqoo Allaha inna Allaha shadeedu alAAiqab",
                    "translation": "O you who have believed, do not violate the rites of Allah or [the sanctity of] the sacred month or [neglect the marking of] the sacrificial animals and garlanding [them] or [violate the safety of] those coming to the Sacred House seeking bounty from their Lord and [His] approval. But when you come out of ihram, then [you may] hunt. And do not let the hatred of a people for having obstructed you from al-Masjid al-Haram lead you to transgress. And cooperate in righteousness and piety, but do not cooperate in sin and aggression. And fear Allah; indeed, Allah is severe in penalty."
                },
                {
                    "title": "5:6 | Obligatory rituals of ablution and the path to ease",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قُمۡتُمۡ إِلَى ٱلصَّلَوٰةِ فَٱغۡسِلُواْ وُجُوهَكُمۡ وَأَيۡدِيَكُمۡ إِلَى ٱلۡمَرَافِقِ وَٱمۡسَحُواْ بِرُءُوسِكُمۡ وَأَرۡجُلَكُمۡ إِلَى ٱلۡكَعۡبَيۡنِۚ وَإِن كُنتُمۡ جُنُبٗا فَٱطَّهَّرُواْۚ وَإِن كُنتُم مَّرۡضَىٰٓ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَآءَ أَحَدٞ مِّنكُم مِّنَ ٱلۡغَآئِطِ أَوۡ لَٰمَسۡتُمُ ٱلنِّسَآءَ فَلَمۡ تَجِدُواْ مَآءٗ فَتَيَمَّمُواْ صَعِيدٗا طَيِّبٗا فَٱمۡسَحُواْ بِوُجُوهِكُمۡ وَأَيۡدِيكُم مِّنۡهُۚ مَا يُرِيدُ ٱللَّهُ لِيَجۡعَلَ عَلَيۡكُم مِّنۡ حَرَجٖ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمۡ وَلِيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ",
                    "transliteration": "Ya-ayyuha allatheena amanoo itha qumtum ila assalati faghsiloo wujoohakum waaydiyakum ila almarafiqi wamsahoo biruoosikum waarjulakum ila alkaAAbayni wain kuntum junuban fattahharoo wain kuntum marda aw AAala safarin aw jaa ahadun minkum mina alghaiti aw lamastumu annisaa falam tajidoo maan fatayammamoo saAAeedan tayyiban famsahoo biwujoohikum waaydeekum minhu ma yureedu Allahu liyajAAala AAalaykum min harajin walakin yureedu liyutahhirakum waliyutimma niAAmatahu AAalaykum laAAallakum tashkuroon",
                    "translation": "O you who have believed, when you rise to [perform] prayer, wash your faces and your forearms to the elbows and wipe over your heads and wash your feet to the ankles. And if you are in a state of janabah, then purify yourselves. But if you are ill or on a journey or one of you comes from the place of relieving himself or you have contacted women and do not find water, then seek clean earth and wipe over your faces and hands with it. Allah does not intend to make difficulty for you, but He intends to purify you and complete His favor upon you that you may be grateful."
                },
                {
                    "title": "5:8 | Establishing justice without bias or discrimination",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ لِلَّهِ شُهَدَآءَ بِٱلۡقِسۡطِۖ وَلَا يَجۡرِمَنَّكُمۡ شَنَـَٔانُ قَوۡمٍ عَلَىٰٓ أَلَّا تَعۡدِلُواْۚ ٱعۡدِلُواْ هُوَ أَقۡرَبُ لِلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ",
                    "transliteration": "Ya-ayyuha allatheena amanoo koonoo qawwameena lillahi shuhadaa bilqisti wala yajrimannakum shanaanu qawmin AAala alla taAAdiloo iAAdiloo huwa aqrabu littaqwa wattaqoo Allaha inna Allaha khabeerun bima taAAmaloon",
                    "translation": "O you who have believed, be persistently standing firm for Allah, witnesses in justice, and do not let the hatred of a people prevent you from being just. Be just; that is nearer to righteousness. And fear Allah; indeed, Allah is Acquainted with what you do."
                },
                {
                    "title": "5:32 | Sactity of human life",
                    "arabic": "... مَن قَتَلَ نَفۡسَۢا بِغَيۡرِ نَفۡسٍ أَوۡ فَسَادٖ فِي ٱلۡأَرۡضِ فَكَأَنَّمَا قَتَلَ ٱلنَّاسَ جَمِيعٗا وَمَنۡ أَحۡيَاهَا فَكَأَنَّمَآ أَحۡيَا ٱلنَّاسَ جَمِيعٗاۚ...",
                    "transliteration": "man qatala nafsan bighayri nafsin aw fasadin fee alardi fakaannama qatala annasa jameeAAan waman ahyaha fakaannama ahya annasa jameeAAan ",
                    "translation": "...whoever kills a soul unless for a soul or for corruption [done] in the land - it is as if he had slain mankind entirely..."
                },
                {
                    "title": "5:74 | Repentance",
                    "arabic": "أَفَلَا يَتُوبُونَ إِلَى ٱللَّهِ وَيَسۡتَغۡفِرُونَهُۥۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ",
                    "transliteration": "Afala yatooboona ila Allahi wayastaghfiroonahu wallahu ghafoorun raheem",
                    "translation": "So will they not repent to Allah and seek His forgiveness? And Allah is Forgiving and Merciful."
                },
                {
                    "title": "5:90 | Prohitation of alcohol",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡخَمۡرُ وَٱلۡمَيۡسِرُ وَٱلۡأَنصَابُ وَٱلۡأَزۡلَٰمُ رِجۡسٞ مِّنۡ عَمَلِ ٱلشَّيۡطَٰنِ فَٱجۡتَنِبُوهُ لَعَلَّكُمۡ تُفۡلِحُونَ",
                    "transliteration": "Ya-ayyuha allatheena amanoo innama alkhamru walmaysiru walansabu walazlamu rijsun min AAamali ashshaytani fajtaniboohu laAAallakum tuflihoon",
                    "translation": "O you who have believed, indeed, intoxicants, gambling, [sacrificing on] stone alters [to other than Allah], and divining arrows are but defilement from the work of Satan, so avoid it that you may be successful."
                }
              ]
            },
            {
              "surah": "6. Al-An'am",
              "posts": [
                {
                    "title": "6:32 | The wordly life and the hereafter",
                    "arabic": "وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا لَعِبٞ وَلَهۡوٞۖ وَلَلدَّارُ ٱلۡأٓخِرَةُ خَيۡرٞ لِّلَّذِينَ يَتَّقُونَۚ أَفَلَا تَعۡقِلُونَ",
                    "transliteration": "Wama alhayatu addunya illa laAAibun walahwun waladdaru alakhirati khayrun lillatheena yattaqoona afala taAAqiloon",
                    "translation": "And the worldly life is not but amusement and diversion; but the home of the Hereafter is best for those who fear Allah, so will you not reason?"
                },
                {
                    "title": "6:63 | Need for Allah",
                    "arabic": "قُلۡ مَن يُنَجِّيكُم مِّن ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِ تَدۡعُونَهُۥ تَضَرُّعٗا وَخُفۡيَةٗ لَّئِنۡ أَنجَىٰنَا مِنۡ هَٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّٰكِرِينَ",
                    "transliteration": "Qul man yunajjeekum min thulumati albarri walbahri tadAAoonahu tadarruAAan wakhufyatan lain anjana min hathihi lanakoonanna mina ashshakireen",
                    "translation": "Say, \"Who rescues you from the darknesses of the land and sea [when] you call upon Him imploring [aloud] and privately, If He should save us from this [crisis], we will surely be among the thankful. \""
                },
                {
                    "title": "6:125 | Who does Allah guide",
                    "arabic": "فَمَن يُرِدِ ٱللَّهُ أَن يَهۡدِيَهُۥ يَشۡرَحۡ صَدۡرَهُۥ لِلۡإِسۡلَٰمِۖ وَمَن يُرِدۡ أَن يُضِلَّهُۥ يَجۡعَلۡ صَدۡرَهُۥ ضَيِّقًا حَرَجٗا كَأَنَّمَا يَصَّعَّدُ فِي ٱلسَّمَآءِۚ كَذَٰلِكَ يَجۡعَلُ ٱللَّهُ ٱلرِّجۡسَ عَلَى ٱلَّذِينَ لَا يُؤۡمِنُونَ",
                    "transliteration": "Faman yuridi Allahu an yahdiyahu yashrah sadrahu lilislami waman yurid an yudillahu yajAAal sadrahu dayyiqan harajan kaannama yassaAAAAadu fee assamai kathalika yajAAalu Allahu arrijsa AAala allatheena la yuminoon",
                    "translation": "So whoever Allah wants to guide - He expands his breast to [contain] Islam; and whoever He wants to misguide - He makes his breast tight and constricted as though he were climbing into the sky. Thus does Allah place defilement upon those who do not believe."
                },
                {
                    "title": "6:160 | One good deed rewarded atleast 10 times",
                    "arabic": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ عَشۡرُ أَمۡثَالِهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَا وَهُمۡ لَا يُظۡلَمُونَ",
                    "transliteration": "Man jaa bilhasanati falahu AAashru amthaliha waman jaa bissayyiati fala yujza illa mithlaha wahum la yuthlamoon",
                    "translation": "Whoever comes [on the Day of Judgement] with a good deed will have ten times the like thereof [to his credit], and whoever comes with an evil deed will not be recompensed except the like thereof; and they will not be wronged."
                }
              ]
            },
            {
              "surah": "7. Al-A'raf",
              "posts": [
                {
                    "title": "7:53 | Sinners would give anything to return to the world",
                    "arabic": "هَلۡ يَنظُرُونَ إِلَّا تَأۡوِيلَهُۥۚ يَوۡمَ يَأۡتِي تَأۡوِيلُهُۥ يَقُولُ ٱلَّذِينَ نَسُوهُ مِن قَبۡلُ قَدۡ جَآءَتۡ رُسُلُ رَبِّنَا بِٱلۡحَقِّ فَهَل لَّنَا مِن شُفَعَآءَ فَيَشۡفَعُواْ لَنَآ أَوۡ نُرَدُّ فَنَعۡمَلَ غَيۡرَ ٱلَّذِي كُنَّا نَعۡمَلُۚ قَدۡ خَسِرُوٓاْ أَنفُسَهُمۡ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ",
                    "transliteration": "Hal yanthuroona illa taweelahu yawma yatee taweeluhu yaqoolu allatheena nasoohu min qablu qad jaat rusulu rabbina bilhaqqi fahal lana min shufaAAaa fayashfaAAoo lana aw nuraddu fanaAAmala ghayra allathee kunna naAAmalu qad khasiroo anfusahum wadalla AAanhum ma kanoo yaftaroon",
                    "translation": "Do they await except its result? The Day its result comes those who had ignored it before will say, \"The messengers of our Lord had come with the truth, so are there [now] any intercessors to intercede for us or could we be sent back to do other than we used to do?\" They will have lost themselves, and lost from them is what they used to invent."
                },
                {
                    "title": "7:168 | Hardship cleanses the believer of sin",
                    "arabic": "وَقَطَّعۡنَٰهُمۡ فِي ٱلۡأَرۡضِ أُمَمٗاۖ مِّنۡهُمُ ٱلصَّٰلِحُونَ وَمِنۡهُمۡ دُونَ ذَٰلِكَۖ وَبَلَوۡنَٰهُم بِٱلۡحَسَنَٰتِ وَٱلسَّيِّـَٔاتِ لَعَلَّهُمۡ يَرۡجِعُونَ",
                    "transliteration": "WaqattaAAnahum fee alardi omaman minhumu assalihoona waminhum doona thalika wabalawnahum bilhasanati wassayyiati laAAallahum yarjiAAoon",
                    "translation": "And We divided them throughout the earth into nations. Of them some were righteous, and of them some were otherwise. And We tested them with good [times] and bad that perhaps they would return [to obedience]."
                },
                {
                    "title": "7:180 | Calling Allah by his Beautiful Names",
                    "arabic": "وَلِلَّهِ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰ فَٱدۡعُوهُ بِهَاۖ وَذَرُواْ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ أَسۡمَٰٓئِهِۦۚ سَيُجۡزَوۡنَ مَا كَانُواْ يَعۡمَلُونَ",
                    "transliteration": "Walillahi alasmao alhusna fadAAoohu biha watharoo allatheena yulhidoona fee asmaihi sayujzawna ma kanoo yaAAmaloon",
                    "translation": "And to Allah belong the best names, so invoke Him by them. And leave [the company of] those who practice deviation concerning His names. They will be recompensed for what they have been doing."
                },
                {
                    "title": "7:199 | Show forgiveness and ignore the ignorant",
                    "arabic": "خُذِ ٱلۡعَفۡوَ وَأۡمُرۡ بِٱلۡعُرۡفِ وَأَعۡرِضۡ عَنِ ٱلۡجَٰهِلِينَ",
                    "transliteration": "Khuthi alAAafwa wamur bilAAurfi waaAArid AAani aljahileen",
                    "translation": "Take what is given freely, enjoin what is good, and turn away from the ignorant."
                }
              ]
            },
            {
              "surah": "8. Al-Anfal",
              "posts": [
                {
                    "title": "8:1 | Obey Allah and His Messenger, if you are believers",
                    "arabic": "يَسۡـَٔلُونَكَ عَنِ ٱلۡأَنفَالِۖ قُلِ ٱلۡأَنفَالُ لِلَّهِ وَٱلرَّسُولِۖ فَٱتَّقُواْ ٱللَّهَ وَأَصۡلِحُواْ ذَاتَ بَيۡنِكُمۡۖ وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥٓ إِن كُنتُم مُّؤۡمِنِينَ",
                    "transliteration": "Yasaloonaka AAani alanfali quli alanfalu lillahi warrasooli fattaqoo Allaha waaslihoo thata baynikum waateeAAoo Allaha warasoolahu in kuntum mumineen",
                    "translation": "They ask you, [O Muhammad], about the bounties [of war]. Say, \"The [decision concerning] bounties is for Allah and the Messenger.\" So fear Allah and amend that which is between you and obey Allah and His Messenger, if you should be believers."
                },
                {
                    "title": "8:2 | The impact of the Quran on the human-self",
                    "arabic": "إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَإِذَا تُلِيَتۡ عَلَيۡهِمۡ ءَايَٰتُهُۥ زَادَتۡهُمۡ إِيمَٰنٗا وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ",
                    "transliteration": "Innama almuminoona allatheena itha thukira Allahu wajilat quloobuhum waitha tuliyat AAalayhim ayatuhu zadathum eemanan waAAala rabbihim yatawakkaloon",
                    "translation": "The believers are only those who, when Allah is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely"
                },
                {
                    "title": "8:63 | Allah is the one who brings hearts together",
                    "arabic": "وَأَلَّفَ بَيۡنَ قُلُوبِهِمۡۚ لَوۡ أَنفَقۡتَ مَا فِي ٱلۡأَرۡضِ جَمِيعٗا مَّآ أَلَّفۡتَ بَيۡنَ قُلُوبِهِمۡ وَلَٰكِنَّ ٱللَّهَ أَلَّفَ بَيۡنَهُمۡۚ إِنَّهُۥ عَزِيزٌ حَكِيمٞ",
                    "transliteration": "Waallafa bayna quloobihim law anfaqta ma fee alardi jameeAAan ma allafta bayna quloobihim walakinna Allaha allafa baynahum innahu AAazeezun hakeem",
                    "translation": "And brought together their hearts. If you had spent all that is in the earth, you could not have brought their hearts together; but Allah brought them together. Indeed, He is Exalted in Might and Wise."
                },
                {
                    "title": "8:70 | Allah Will Give You Better",
                    "arabic": "يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّمَن فِيٓ أَيۡدِيكُم مِّنَ ٱلۡأَسۡرَىٰٓ إِن يَعۡلَمِ ٱللَّهُ فِي قُلُوبِكُمۡ خَيۡرٗا يُؤۡتِكُمۡ خَيۡرٗا مِّمَّآ أُخِذَ مِنكُمۡ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ",
                    "transliteration": "Ya-ayyuha annabiyyu qul liman fee aydeekum mina alasra in yaAAlami Allahu fee quloobikum khayran yutikum khayran mimma okhitha minkum wayaghfir lakum wallahu ghafoorun raheem",
                    "translation": "O Prophet, say to whoever is in your hands of the captives, \"If Allah knows [any] good in your hearts, He will give you [something] better than what was taken from you, and He will forgive you; and Allah is Forgiving and Merciful.\""
                }
              ]
            },
            {
              "surah": "9. At-Tawbah",
              "posts": [
                {
                    "title": "9:33 | Mission of the Prophet Muhammad",
                    "arabic": "هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ وَلَوۡ كَرِهَ ٱلۡمُشۡرِكُونَ",
                    "transliteration": "Huwa allathee arsala rasoolahu bilhuda wadeeni alhaqqi liyuthhirahu AAala addeeni kullihi walaw kariha almushrikoon",
                    "translation": "It is He who has sent His Messenger with guidance and the religion of truth to manifest it over all religion, although they who associate others with Allah dislike it."
                },
                {
                    "title": "9:36 | Four months are sacred",
                    "arabic": "إِنَّ عِدَّةَ ٱلشُّهُورِ عِندَ ٱللَّهِ ٱثۡنَا عَشَرَ شَهۡرٗا فِي كِتَٰبِ ٱللَّهِ يَوۡمَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ مِنۡهَآ أَرۡبَعَةٌ حُرُمٞۚ ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُۚ فَلَا تَظۡلِمُواْ فِيهِنَّ أَنفُسَكُمۡۚ وَقَٰتِلُواْ ٱلۡمُشۡرِكِينَ كَآفَّةٗ كَمَا يُقَٰتِلُونَكُمۡ كَآفَّةٗۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ",
                    "transliteration": "Inna AAiddata ashshuhoori AAinda Allahi ithna AAashara shahran fee kitabi Allahi yawma khalaqa assamawati walarda minha arbaAAatun hurumun thalika addeenu alqayyimu fala tathlimoo feehinna anfusakum waqatiloo almushrikeena kaffatan kama yuqatiloonakum kaffatan waAAlamoo anna Allaha maAAa almuttaqeen",
                    "translation": "Indeed, the number of months with Allah is twelve [lunar] months in the register of Allah [from] the day He created the heavens and the earth; of these, four are sacred. That is the correct religion, so do not wrong yourselves during them. And fight against the disbelievers collectively as they fight against you collectively. And know that Allah is with the righteous [who fear Him]."
                },
                {
                    "title": "9:38 | Temptations of this world",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَا لَكُمۡ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ ٱثَّاقَلۡتُمۡ إِلَى ٱلۡأَرۡضِۚ أَرَضِيتُم بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا مِنَ ٱلۡأٓخِرَةِۚ فَمَا مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا قَلِيلٌ",
                    "transliteration": "Ya-ayyuha allatheena amanoo ma lakum itha qeela lakumu infiroo fee sabeeli Allahi iththaqaltum ila alardi aradeetum bilhayati addunya mina alakhirati fama mataAAu alhayati addunya fee alakhirati illa qaleel",
                    "translation": "O you who have believed, what is [the matter] with you that, when you are told to go forth in the cause of Allah, you adhere heavily to the earth? Are you satisfied with the life of this world rather than the Hereafter? But what is the enjoyment of worldly life compared to the Hereafter except a [very] little."
                },
                {
                    "title": "9:60 | Eight beneficiaries of zakah",
                    "arabic": "إِنَّمَا ٱلصَّدَقَٰتُ لِلۡفُقَرَآءِ وَٱلۡمَسَٰكِينِ وَٱلۡعَٰمِلِينَ عَلَيۡهَا وَٱلۡمُؤَلَّفَةِ قُلُوبُهُمۡ وَفِي ٱلرِّقَابِ وَٱلۡغَٰرِمِينَ وَفِي سَبِيلِ ٱللَّهِ وَٱبۡنِ ٱلسَّبِيلِۖ فَرِيضَةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ",
                    "transliteration": "Innama assadaqatu lilfuqarai walmasakeeni walAAamileena AAalayha walmuallafati quloobuhum wafee arriqabi walgharimeena wafee sabeeli Allahi wabni assabeeli fareedatan mina Allahi wallahu AAaleemun hakeemun",
                    "translation": "Zakah expenditures are only for the poor and for the needy and for those employed to collect [zakah] and for bringing hearts together [for Islam] and for freeing captives [or slaves] and for those in debt and for the cause of Allah and for the [stranded] traveler - an obligation [imposed] by Allah. And Allah is Knowing and Wise."
                },
                {
                    "title": "9:72 | Supreme success",
                    "arabic": "وَعَدَ ٱللَّهُ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا وَمَسَٰكِنَ طَيِّبَةٗ فِي جَنَّٰتِ عَدۡنٖۚ وَرِضۡوَٰنٞ مِّنَ ٱللَّهِ أَكۡبَرُۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ",
                    "transliteration": "WaAAada Allahu almumineena walmuminati jannatin tajree min tahtiha alanharu khalideena feeha wamasakina tayyibatan fee jannati AAadnin waridwanun mina Allahi akbaru thalika huwa alfawzu alAAatheem",
                    "translation": "Allah has promised the believing men and believing women gardens beneath which rivers flow, wherein they abide eternally, and pleasant dwellings in gardens of perpetual residence; but approval from Allah is greater. It is that which is the great attainment."
                },
                {
                    "title": "9:104 | Allah accepts repentance",
                    "arabic": "أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ هُوَ يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَأۡخُذُ ٱلصَّدَقَٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
                    "transliteration": "Alam yaAAlamoo anna Allaha huwa yaqbalu attawbata AAan AAibadihi wayakhuthu assadaqati waanna Allaha huwa attawwabu arraheem",
                    "translation": "Do they not know that it is Allah who accepts repentance from His servants and receives charities and that it is Allah who is the Accepting of repentance, the Merciful?"
                },
                {
                    "title": "9:119 | Importance of good company",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَكُونُواْ مَعَ ٱلصَّٰدِقِينَ",
                    "transliteration": "Ya-ayyuha allatheena amanoo ittaqoo Allaha wakoonoo maAAa assadiqeen",
                    "translation": "O you who have believed, fear Allah and be with those who are true."
                }
              ]
            },
            {
              "surah": "10. Yunus",
              "posts": [
                {
                    "title": "10:9 | Consequence of belief and good deeds",
                    "arabic": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ يَهۡدِيهِمۡ رَبُّهُم بِإِيمَٰنِهِمۡۖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ فِي جَنَّٰتِ ٱلنَّعِيمِ",
                    "transliteration": "Inna allatheena amanoo waAAamiloo assalihati yahdeehim rabbuhum bieemanihim tajree min tahtihimu alanharu fee jannati annaAAeem",
                    "translation": "Indeed, those who have believed and done righteous deeds - their Lord will guide them because of their faith. Beneath them rivers will flow in the Gardens of Pleasure"
                },
                {
                    "title": "10:25 Adobe of peace",
                    "arabic": "وَٱللَّهُ يَدۡعُوٓاْ إِلَىٰ دَارِ ٱلسَّلَٰمِ وَيَهۡدِي مَن يَشَآءُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ",
                    "transliteration": "Wallahu yadAAoo ila dari assalami wayahdee man yashao ila siratin mustaqeem",
                    "translation": "And Allah invites to the Home of Peace and guides whom He wills to a straight path"
                },
                {
                    "title": "10:92 | Preservation of history as a sign",
                    "arabic": "فَٱلۡيَوۡمَ نُنَجِّيكَ بِبَدَنِكَ لِتَكُونَ لِمَنۡ خَلۡفَكَ ءَايَةٗۚ وَإِنَّ كَثِيرٗا مِّنَ ٱلنَّاسِ عَنۡ ءَايَٰتِنَا لَغَٰفِلُونَ",
                    "transliteration": "Falyawma nunajjeeka bibadanika litakoona liman khalfaka ayatan wainna katheeran mina annasi AAan ayatina laghafiloon",
                    "translation": "So today We will save you in body that you may be to those who succeed you a sign. And indeed, many among the people, of Our signs, are heedless"
                },
                {
                    "title": "10:108 | Personal responsability",
                    "arabic": "قُلۡ يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَكُمُ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۖ وَمَآ أَنَا۠ عَلَيۡكُم بِوَكِيلٖ",
                    "transliteration": "Qul ya-ayyuha annasu qad jaakumu alhaqqu min rabbikum famani ihtada fainnama yahtadee linafsihi waman dalla fainnama yadillu AAalayha wama ana AAalaykum biwakeel",
                    "translation": "Say, \"O mankind, the truth has come to you from your Lord, so whoever is guided is only guided for [the benefit of] his soul, and whoever goes astray only goes astray [in violation] against it. And I am not over you a manager.\""
                }
              ]
            },
            {
              "surah": "11. Hud",
              "posts": [
                {
                    "title": "11:3 | Giving due right",
                    "arabic": "وَأَنِ ٱسۡتَغۡفِرُواْ رَبَّكُمۡ ثُمَّ تُوبُوٓاْ إِلَيۡهِ يُمَتِّعۡكُم مَّتَٰعًا حَسَنًا إِلَىٰٓ أَجَلٖ مُّسَمّٗى وَيُؤۡتِ كُلَّ ذِي فَضۡلٖ فَضۡلَهُۥۖ وَإِن تَوَلَّوۡاْ فَإِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٖ كَبِيرٍ",
                    "transliteration": "Waani istaghfiroo rabbakum thumma tooboo ilayhi yumattiAAkum mataAAan hasanan ila ajalin musamman wayuti kulla thee fadlin fadlahu wain tawallaw fainee akhafu AAalaykum AAathaba yawmin kabeer",
                    "translation": "And [saying], Seek forgiveness of your Lord and repent to Him, [and] He will let you enjoy a good provision for a specified term and give every doer of favor his favor. But if you turn away, then indeed, I fear for you the punishment of a great Day."
                },
                {
                    "title": "11:15 | Those who prefer this world",
                    "arabic": "مَن كَانَ يُرِيدُ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا نُوَفِّ إِلَيۡهِمۡ أَعۡمَٰلَهُمۡ فِيهَا وَهُمۡ فِيهَا لَا يُبۡخَسُونَ",
                    "transliteration": "Man kana yureedu alhayata addunya wazeenataha nuwaffi ilayhim aAAmalahum feeha wahum feeha la yubkhasoon",
                    "translation": "Whoever desires the life of this world and its adornments - We fully repay them for their deeds therein, and they therein will not be deprived."
                },
                {
                    "title": "11:113 | Aiding the oppressors",
                    "arabic": "وَلَا تَرۡكَنُوٓاْ إِلَى ٱلَّذِينَ ظَلَمُواْ فَتَمَسَّكُمُ ٱلنَّارُ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِيَآءَ ثُمَّ لَا تُنصَرُونَ",
                    "transliteration": "Wala tarkanoo ila allatheena thalamoo fatamassakumu annaru wama lakum min dooni Allahi min awliyaa thumma la tunsaroon",
                    "translation": "And do not incline toward those who do wrong, lest you be touched by the Fire, and you would not have other than Allah any protectors; then you would not be helped."
                },
                {
                    "title": "11:114 | Good deeds wipe out bad deeds",
                    "arabic": "وَأَقِمِ ٱلصَّلَوٰةَ طَرَفَيِ ٱلنَّهَارِ وَزُلَفٗا مِّنَ ٱلَّيۡلِۚ إِنَّ ٱلۡحَسَنَٰتِ يُذۡهِبۡنَ ٱلسَّيِّـَٔاتِۚ ذَٰلِكَ ذِكۡرَىٰ لِلذَّٰكِرِينَ",
                    "transliteration": "Waaqimi assalata tarafayi annahari wazulafan mina allayli inna alhasanati yuthhibna assayyiati thalika thikra liththakireen",
                    "translation": "And establish prayer at the two ends of the day and at the approach of the night. Indeed, good deeds do away with misdeeds. That is a reminder for those who remember."
                }
              ]
            },
            {
              "surah": "12. Yusuf",
              "posts": [
                {
                    "title": "12:5 | Jealousy of brothers",
                    "arabic": "قَالَ يَٰبُنَيَّ لَا تَقۡصُصۡ رُءۡيَاكَ عَلَىٰٓ إِخۡوَتِكَ فَيَكِيدُواْ لَكَ كَيۡدًاۖ إِنَّ ٱلشَّيۡطَٰنَ لِلۡإِنسَٰنِ عَدُوّٞ مُّبِينٞ",
                    "transliteration": "Ith qala yoosufu liabeehi ya-abati innee raaytu ahada AAashara kawkaban washshamsa walqamara raaytuhum lee sajideen",
                    "translation": "He said, \"O my son, do not relate your vision to your brothers or they will contrive against you a plan. Indeed Satan, to man, is a manifest enemy.\""
                },
                {
                    "title": "12:33 | Standing up for principles",
                    "arabic": "قَالَ رَبِّ ٱلسِّجۡنُ أَحَبُّ إِلَيَّ مِمَّا يَدۡعُونَنِيٓ إِلَيۡهِۖ وَإِلَّا تَصۡرِفۡ عَنِّي كَيۡدَهُنَّ أَصۡبُ إِلَيۡهِنَّ وَأَكُن مِّنَ ٱلۡجَٰهِلِينَ",
                    "transliteration": "Qala rabbi assijnu ahabbu ilayya mimma yadAAoonanee ilayhi wailla tasrif AAannee kaydahunna asbu ilayhinna waakun mina aljahileen",
                    "translation": "He said, \"My Lord, prison is more to my liking than that to which they invite me. And if You do not avert from me their plan, I might incline toward them and [thus] be of the ignorant.\""
                },
                {
                    "title": "12:67 | Diversifying strategies - not placing everything in one basket",
                    "arabic": "وَقَالَ يَٰبَنِيَّ لَا تَدۡخُلُواْ مِنۢ بَابٖ وَٰحِدٖ وَٱدۡخُلُواْ مِنۡ أَبۡوَٰبٖ مُّتَفَرِّقَةٖۖ وَمَآ أُغۡنِي عَنكُم مِّنَ ٱللَّهِ مِن شَيۡءٍۖ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِۖ عَلَيۡهِ تَوَكَّلۡتُۖ وَعَلَيۡهِ فَلۡيَتَوَكَّلِ ٱلۡمُتَوَكِّلُونَ",
                    "transliteration": "Waqala ya-baniyya la tadkhuloo min babin wahidin wadkhuloo min abwabin mutafarriqatin wama oghnee AAankum mina Allahi min shayin ini alhukmu illa lillahi AAalayhi tawakkaltu waAAalayhi falyatawakkali almutawakkiloon",
                    "translation": "And he said, \"O my sons, do not enter from one gate but enter from different gates; and I cannot avail you against [the decree of] Allah at all. The decision is only for Allah; upon Him I have relied, and upon Him let those who would rely [indeed] rely.\""
                }
              ]
            },
            {
              "surah": "13. Ar-Ra'd",
              "posts": [
                {
                    "title": "13:2 | Creation of the heavens",
                    "arabic": "ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ",
                    "transliteration": "Allahu allathee rafaAAa assamawati bighayri AAamadin tarawnaha thumma istawa AAala alAAarshi wasakhkhara ashshamsa walqamara kullun yajree liajalin musamman yudabbiru alamra yufassilu alayati laAAallakum biliqai rabbikum tooqinoon",
                    "translation": "It is Allah who erected the heavens without pillars that you [can] see; then He established Himself above the Throne and made subject the sun and the moon, each running [its course] for a specified term. He arranges [each] matter; He details the signs that you may, of the meeting with your Lord, be certain."
                },
                {
                    "title": "13:11 | Golden rule for change",
                    "arabic": "لَهُۥ مُعَقِّبَٰتٞ مِّنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦ يَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا يُغَيِّرُ مَا بِقَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡۗ وَإِذَآ أَرَادَ ٱللَّهُ بِقَوۡمٖ سُوٓءٗا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ",
                    "transliteration": "Lahu muAAaqqibatun min bayni yadayhi wamin khalfihi yahfathoonahu min amri Allahi inna Allaha la yughayyiru ma biqawmin hatta yughayyiroo ma bianfusihim waitha arada Allahu biqawmin sooan fala maradda lahu wama lahum min doonihi min wal",
                    "translation": "For each one are successive [angels] before and behind him who protect him by the decree of Allah. Indeed, Allah will not change the condition of a people until they change what is in themselves. And when Allah intends for a people ill, there is no repelling it. And there is not for them besides Him any patron."
                },
                {
                    "title": "13:17 | Parable of truth and falsehood - that which is of benefit to man remains",
                    "arabic": "أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ",
                    "transliteration": "Anzala mina assamai maan fasalat awdiyatun biqadariha fahtamala assaylu zabadan rabiyan wamimma yooqidoona AAalayhi fee annari ibtighaa hilyatin aw mataAAin zabadun mithluhu kathalika yadribu Allahu alhaqqa walbatila faamma azzabadu fayathhabu jufaan waamma ma yanfaAAu annasa fayamkuthu fee alardi kathalika yadribu Allahu alamthal",
                    "translation": "He sends down from the sky, rain, and valleys flow according to their capacity, and the torrent carries a rising foam. And from that [ore] which they heat in the fire, desiring adornments and utensils, is a foam like it. Thus Allah presents [the example of] truth and falsehood. As for the foam, it vanishes, [being] cast off; but as for that which benefits the people, it remains on the earth. Thus does Allah present examples."
                },
                {
                    "title": "13:28 | Impact of dhikr",
                    "arabic": "ٱلَّذِينَ ءَامَنُواْ وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ",
                    "transliteration": "Allatheena amanoo watatmainnu quloobuhum bithikri Allahi ala bithikri Allahi tatmainnu alquloob",
                    "translation": "Those who have believed and whose hearts are assured by the remembrance of Allah. Unquestionably, by the remembrance of Allah hearts are assured."
                }
              ]
            },
            {
              "surah": "14. Ibrahim",
              "posts": [
                {
                    "title": "14:1 | Purpose of the Quran",
                    "arabic": "الٓرۚ كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ لِتُخۡرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِ رَبِّهِمۡ إِلَىٰ صِرَٰطِ ٱلۡعَزِيزِ ٱلۡحَمِيدِ",
                    "transliteration": "Aliflamra kitabun anzalnahu ilayka litukhrija annasa mina aththulumati ila annoori biithni rabbihim ila sirati alAAazeezi alhameed",
                    "translation": "Alif, Lam, Ra. [This is] a Book which We have revealed to you, [O Muhammad], that you might bring mankind out of darknesses into the light by permission of their Lord - to the path of the Exalted in Might, the Praiseworth"
                },
                {
                    "title": "14:7 | Consequence of gratefulness",
                    "arabic": "وَإِذۡ تَأَذَّنَ رَبُّكُمۡ لَئِن شَكَرۡتُمۡ لَأَزِيدَنَّكُمۡۖ وَلَئِن كَفَرۡتُمۡ إِنَّ عَذَابِي لَشَدِيدٞ",
                    "transliteration": "Waith taaththana rabbukum lain shakartum laazeedannakum walain kafartum inna AAathabee lashadeed",
                    "translation": "And [remember] when your Lord proclaimed, 'If you are grateful, I will surely increase you [in favor]; but if you deny, indeed, My punishment is severe.'"
                },
                {
                    "title": "14:22 | Satan's defence",
                    "arabic": "وَقَالَ ٱلشَّيۡطَٰنُ لَمَّا قُضِيَ ٱلۡأَمۡرُ إِنَّ ٱللَّهَ وَعَدَكُمۡ وَعۡدَ ٱلۡحَقِّ وَوَعَدتُّكُمۡ فَأَخۡلَفۡتُكُمۡۖ وَمَا كَانَ لِيَ عَلَيۡكُم مِّن سُلۡطَٰنٍ إِلَّآ أَن دَعَوۡتُكُمۡ فَٱسۡتَجَبۡتُمۡ لِيۖ فَلَا تَلُومُونِي وَلُومُوٓاْ أَنفُسَكُمۖ مَّآ أَنَا۠ بِمُصۡرِخِكُمۡ وَمَآ أَنتُم بِمُصۡرِخِيَّ إِنِّي كَفَرۡتُ بِمَآ أَشۡرَكۡتُمُونِ مِن قَبۡلُۗ إِنَّ ٱلظَّٰلِمِينَ لَهُمۡ عَذَابٌ أَلِيمٞ",
                    "transliteration": "Waqala ashshaytanu lamma qudiya alamru inna Allaha waAAadakum waAAda alhaqqi wawaAAadtukum faakhlaftukum wama kana liya AAalaykum min sultanin illa an daAAawtukum fastajabtum lee fala taloomoonee waloomoo anfusakum ma ana bimusrikhikum wama antum bimusrikhiyya innee kafartu bima ashraktumooni min qablu inna aththalimeena lahum AAathabun aleem",
                    "translation": "And Satan will say when the matter has been concluded, \"Indeed, Allah had promised you the promise of truth. And I promised you, but I betrayed you. But I had no authority over you except that I invited you, and you responded to me. So do not blame me; but blame yourselves. I cannot be called to your aid, nor can you be called to my aid. Indeed, I deny your association of me [with Allah] before. Indeed, for the wrongdoers is a painful punishment.\""
                },
                {
                    "title": "14:34 | Blessings of Allah",
                    "arabic": "وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلۡتُمُوهُۚ وَإِن تَعُدُّواْ نِعۡمَتَ ٱللَّهِ لَا تُحۡصُوهَآۗ إِنَّ ٱلۡإِنسَٰنَ لَظَلُومٞ كَفَّارٞ",
                    "transliteration": "Waatakum min kulli ma saaltumoohu wain taAAuddoo niAAmata Allahi la tuhsooha inna alinsana lathaloomun kaffar",
                    "translation": "And He gave you from all you asked of Him. And if you should count the favor of Allah, you could not enumerate them. Indeed, mankind is [generally] most unjust and ungrateful."
                },
                {
                    "title": "14:42 | Allah's justice",
                    "arabic": "وَلَا تَحۡسَبَنَّ ٱللَّهَ غَٰفِلًا عَمَّا يَعۡمَلُ ٱلظَّٰلِمُونَۚ إِنَّمَا يُؤَخِّرُهُمۡ لِيَوۡمٖ تَشۡخَصُ فِيهِ ٱلۡأَبۡصَٰرُ",
                    "transliteration": "Wala tahsabanna Allaha ghafilan AAamma yaAAmalu aththalimoona innama yuakhkhiruhum liyawmin tashkhasu feehi alabsar",
                    "translation": "And never think that Allah is unaware of what the wrongdoers do. He only delays them for a Day when eyes will stare [in horror]."
                },
                {
                    "title": "14:51 | Allah will reward each soul according to its deeds",
                    "arabic": "لِيَجۡزِيَ ٱللَّهُ كُلَّ نَفۡسٖ مَّا كَسَبَتۡۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ",
                    "transliteration": "Liyajziya Allahu kulla nafsin ma kasabat inna Allaha sareeAAu alhisab",
                    "translation": "So that Allah will recompense every soul for what it earned. Indeed, Allah is swift in account."
                }
              ]
            },
            {
              "surah": "15. Al-Hijr",
              "posts": [
                {
                    "title": "15:9 | Allah's protection of the Quran",
                    "arabic": "إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ",
                    "transliteration": "Inna nahnu nazzalna aththikra wainna lahu lahafithoon",
                    "translation": "Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian."
                },
                {
                    "title": "15:36 | Satan's prayer",
                    "arabic": "قَالَ رَبِّ فَأَنظِرۡنِيٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ",
                    "transliteration": "Qala rabbi faanthirnee ila yawmi yubAAathoon",
                    "translation": "He said, \"My Lord, then reprieve me until the Day they are resurrected.\""
                },
                {
                    "title": "15:56 | Only the misguided despair of Allah's mercy",
                    "arabic": "قَالَ وَمَن يَقۡنَطُ مِن رَّحۡمَةِ رَبِّهِۦٓ إِلَّا ٱلضَّآلُّونَ",
                    "transliteration": "Qala waman yaqnatu min rahmati rabbihi illa addalloon",
                    "translation": "He said, \"And who despairs of the mercy of his Lord except for those astray?\""
                },
                {
                    "title": "15:99 | Duration of worship",
                    "arabic": "وَٱعۡبُدۡ رَبَّكَ حَتَّىٰ يَأۡتِيَكَ ٱلۡيَقِينُ",
                    "transliteration": "WaAAbud rabbaka hatta yatiyaka alyaqeen",
                    "translation": "And worship your Lord until there comes to you the certainty (death)."
                }
              ]
            },
            {
              "surah": "16. An-Nahl",
              "posts": [
                {
                    "title": "16:90 | Justice and benevolence",
                    "arabic": " إِنَّ ٱللَّهَ يَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَٰنِ وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ وَيَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡيِۚ يَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ",
                    "transliteration": "Inna Allaha yamuru bilAAadli walihsani waeetai thee alqurba wayanha AAani alfahshai walmunkari walbaghyi yaAAithukum laAAallakum tathakkaroon",
                    "translation": "Indeed, Allah orders justice and good conduct and giving to relatives and forbids immorality and bad conduct and oppression. He admonishes you that perhaps you will be reminded."
                },
                {
                    "title": "16:120 | Abraham described as an 'ummah'",
                    "arabic": "إِنَّ إِبۡرَٰهِيمَ كَانَ أُمَّةٗ قَانِتٗا لِّلَّهِ حَنِيفٗا وَلَمۡ يَكُ مِنَ ٱلۡمُشۡرِكِينَ",
                    "transliteration": "Indeed, Abraham was a [comprehensive] leader, devoutly obedient to Allah, inclining toward truth, and he was not of those who associate others with Allah.",
                    "translation": "Inna ibraheema kana ommatan qanitan lillahi haneefan walam yaku mina almushrikeen"
                },
                {
                    "title": "16:128 | Who is Allah with?",
                    "arabic": "إِنَّ ٱللَّهَ مَعَ ٱلَّذِينَ ٱتَّقَواْ وَّٱلَّذِينَ هُم مُّحۡسِنُونَ",
                    "transliteration": "Inna Allaha maAAa allatheena ittaqaw wallatheena hum muhsinoon",
                    "translation": "Indeed, Allah is with those who fear Him and those who are doers of good."
                }
              ]
            },
            {
              "surah": "17. Al-Isra",
              "posts": [
                {
                    "title": "17:1 | The Night Journey to Jerusalem",
                    "arabic": "سُبۡحَٰنَ ٱلَّذِيٓ أَسۡرَىٰ بِعَبۡدِهِۦ لَيۡلٗا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِي بَٰرَكۡنَا حَوۡلَهُۥ لِنُرِيَهُۥ مِنۡ ءَايَٰتِنَآۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ",
                    "transliteration": "Subhana allathee asra biAAabdihi laylan mina almasjidi alharami ila almasjidi alaqsa allathee barakna hawlahu linuriyahu min ayatina innahu huwa assameeAAu albaseer",
                    "translation": "Exalted is He who took His Servant by night from al-Masjid al-Haram to al-Masjid al-Aqsa, whose surroundings We have blessed, to show him of Our signs. Indeed, He is the Hearing, the Seeing."
                },
                {
                    "title": "17:9 | The Quran guides to that which is most upright",
                    "arabic": "إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَهۡدِي لِلَّتِي هِيَ أَقۡوَمُ وَيُبَشِّرُ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمۡ أَجۡرٗا كَبِيرٗا",
                    "transliteration": "Inna hatha alqurana yahdee lillatee hiya aqwamu wayubashshiru almumineena allatheena yaAAmaloona assalihati anna lahum ajran kabeera",
                    "translation": "Indeed, this Qur'an guides to that which is most suitable and gives good tidings to the believers who do righteous deeds that they will have a great reward."
                },
                {
                    "title": "17:19 | Striving for the hereafter",
                    "arabic": "وَمَنۡ أَرَادَ ٱلۡأٓخِرَةَ وَسَعَىٰ لَهَا سَعۡيَهَا وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ كَانَ سَعۡيُهُم مَّشۡكُورٗا",
                    "transliteration": "Waman arada alakhirata wasaAAa laha saAAyaha wahuwa muminun faolaika kana saAAyuhum mashkoora",
                    "translation": "But whoever desires the Hereafter and exerts the effort due to it while he is a believer - it is those whose effort is ever appreciated [by Allah]."
                },
                {
                    "title": "17:23 | Dealing with parents with excellence and grace",
                    "arabic": "وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗ",
                    "transliteration": "Waqada rabbuka alla taAAbudoo illa iyyahu wabilwalidayni ihsanan imma yablughanna AAindaka alkibara ahaduhuma aw kilahuma fala taqul lahuma offin wala tanharhuma waqul lahuma qawlan kareema",
                    "translation": "And your Lord has decreed that you not worship except Him, and to parents, good treatment. Whether one or both of them reach old age [while] with you, say not to them [so much as], \"uff,\" and do not repel them but speak to them a noble word."
                },
                {
                    "title": "17:26 | Against waste",
                    "arabic": "وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا",
                    "transliteration": "Waati tha alqurba haqqahu walmiskeena wabna assabeeli wala tubaththir tabtheera",
                    "translation": "And give the relative his right, and [also] the poor and the traveler, and do not spend wastefully."
                },
                {
                    "title": "17:37 | Do not walk arrogantly",
                    "arabic": "وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا",
                    "transliteration": "Wala tamshi fee alardi marahan innaka lan takhriqa alarda walan tablugha aljibala toola",
                    "translation": "And do not walk upon the earth exultantly. Indeed, you will never tear the earth [apart], and you will never reach the mountains in height."
                },
                {
                    "title": "17:70 | Human dignity",
                    "arabic": "وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا",
                    "transliteration": "Walaqad karramna banee adama wahamalnahum fee albarri walbahri warazaqnahum mina attayyibati wafaddalnahum AAala katheerin mimman khalaqna tafdeela",
                    "translation": "And We have certainly honored the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created, with [definite] preference."
                },
                {
                    "title": "17:79 | Tahajjud prayer",
                    "arabic": "وَمِنَ ٱلَّيۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا",
                    "transliteration": "Wamina allayli fatahajjad bihi nafilatan laka AAasa an yabAAathaka rabbuka maqaman mahmooda",
                    "translation": "And from [part of] the night, pray with it as additional [worship] for you; it is expected that your Lord will resurrect you to a praised station."
                }
              ]
            },
            {
              "surah": "18. Al-Kahf",
              "posts": [
                {
                    "title": "18:23 | Mention 'inshAllah' before an action",
                    "arabic": "وَلَا تَقُولَنَّ لِشَاْيۡءٍ إِنِّي فَاعِلٞ ذَٰلِكَ غَدًا",
                    "transliteration": "Wala taqoolanna lishayin innee faAAilun thalika ghada",
                    "translation": "And never say of anything, \"Indeed, I will do that tomorrow,\""
                },
                {
                    "title": "18:39 | Remembering Allah in times of prosperity",
                    "arabic": "وَلَوۡلَآ إِذۡ دَخَلۡتَ جَنَّتَكَ قُلۡتَ مَا شَآءَ ٱللَّهُ لَا قُوَّةَ إِلَّا بِٱللَّهِۚ إِن تَرَنِ أَنَا۠ أَقَلَّ مِنكَ مَالٗا وَوَلَدٗا",
                    "transliteration": "Walawla ith dakhalta jannataka qulta ma shaa Allahu la quwwata illa billahi in tarani ana aqalla minka malan wawalada",
                    "translation": "And why did you, when you entered your garden, not say, 'What Allah willed [has occurred]; there is no power except in Allah '? Although you see me less than you in wealth and children"
                },
                {
                    "title": "18:109 | One of the most powerful passages in the Quran",
                    "arabic": "قُل لَّوۡ كَانَ ٱلۡبَحۡرُ مِدَادٗا لِّكَلِمَٰتِ رَبِّي لَنَفِدَ ٱلۡبَحۡرُ قَبۡلَ أَن تَنفَدَ كَلِمَٰتُ رَبِّي وَلَوۡ جِئۡنَا بِمِثۡلِهِۦ مَدَدٗا",
                    "transliteration": "Qul law kana albahru midadan likalimati rabbee lanafida albahru qabla an tanfada kalimatu rabbee walaw jina bimithlihi madada",
                    "translation": "Say, \"If the sea were ink for [writing] the words of my Lord, the sea would be exhausted before the words of my Lord were exhausted, even if We brought the like of it as a supplement.\""
                }
              ]
            },
            {
              "surah": "19. Maryam",
              "posts": [
                {
                    "title": "19:23 | Feeling of despair and longing to be non-existent",
                    "arabic": "فَأَجَآءَهَا ٱلۡمَخَاضُ إِلَىٰ جِذۡعِ ٱلنَّخۡلَةِ قَالَتۡ يَٰلَيۡتَنِي مِتُّ قَبۡلَ هَٰذَا وَكُنتُ نَسۡيٗا مَّنسِيّٗا",
                    "transliteration": "Faajaaha almakhadu ila jithAAi annakhlati qalat ya-laytanee mittu qabla hatha wakuntu nasyan mansiyya",
                    "translation": "And the pains of childbirth drove her to the trunk of a palm tree. She said, \"Oh, I wish I had died before this and was in oblivion, forgotten.\""
                },
                {
                    "title": "19:59 | Abandoning prayer",
                    "arabic": "فَخَلَفَ مِنۢ بَعۡدِهِمۡ خَلۡفٌ أَضَاعُواْ ٱلصَّلَوٰةَ وَٱتَّبَعُواْ ٱلشَّهَوَٰتِۖ فَسَوۡفَ يَلۡقَوۡنَ غَيًّا",
                    "transliteration": "Fakhalafa min baAAdihim khalfun adaAAoo assalata wattabaAAoo ashshahawati fasawfa yalqawna ghayya",
                    "translation": "But there came after them successors who neglected prayer and pursued desires; so they are going to meet evil"
                },
                {
                    "title": "19:96 | Who does Allah love?",
                    "arabic": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ سَيَجۡعَلُ لَهُمُ ٱلرَّحۡمَٰنُ وُدّٗا",
                    "transliteration": "Inna allatheena amanoo waAAamiloo assalihati sayajAAalu lahumu arrahmanu wudda",
                    "translation": "Indeed, those who have believed and done righteous deeds - the Most Merciful will appoint for them affection."
                }
              ]
            },
            {
              "surah": "20. Taha",
              "posts": [
                {
                    "title": "20:14 | Purpose of prayer",
                    "arabic": "إِنَّنِيٓ أَنَا ٱللَّهُ لَآ إِلَٰهَ إِلَّآ أَنَا۠ فَٱعۡبُدۡنِي وَأَقِمِ ٱلصَّلَوٰةَ لِذِكۡرِيٓ",
                    "transliteration": "Innanee ana Allahu la ilaha illa ana faAAbudnee waaqimi assalata lithikree",
                    "translation": "Indeed, I am Allah. There is no deity except Me, so worship Me and establish prayer for My remembrance."
                },
                {
                    "title": "20:15 | Reward for striving",
                    "arabic": "إِنَّ ٱلسَّاعَةَ ءَاتِيَةٌ أَكَادُ أُخۡفِيهَا لِتُجۡزَىٰ كُلُّ نَفۡسِۭ بِمَا تَسۡعَىٰ",
                    "transliteration": "Inna assaAAata atiyatun akadu okhfeeha litujza kullu nafsin bima tasAAa",
                    "translation": "Indeed, the Hour is coming - I almost conceal it - so that every soul may be recompensed according to that for which it strives."
                },
                {
                    "title": "20:46 | Fear Not",
                    "arabic": "قَالَ لَا تَخَافَآۖ إِنَّنِي مَعَكُمَآ أَسۡمَعُ وَأَرَىٰ",
                    "transliteration": "Qala la takhafa innanee maAAakuma asmaAAu waara",
                    "translation": "[Allah] said, \"Fear not. Indeed, I am with you both; I hear and I see.\""
                },
                {
                    "title": "20:124 | Consequence of neglecting the Quran",
                    "arabic": "وَمَنۡ أَعۡرَضَ عَن ذِكۡرِي فَإِنَّ لَهُۥ مَعِيشَةٗ ضَنكٗا وَنَحۡشُرُهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ أَعۡمَىٰ",
                    "transliteration": "Waman aAArada AAan thikree fainna lahu maAAeeshatan danka wanahshuruhu yawma alqiyamati aAAma",
                    "translation": "And whoever turns away from My remembrance - indeed, he will have a depressed life, and We will gather him on the Day of Resurrection blind."
                },
                {
                    "title": "20:131 | Wordly life as a test",
                    "arabic": "وَلَا تَمُدَّنَّ عَيۡنَيۡكَ إِلَىٰ مَا مَتَّعۡنَا بِهِۦٓ أَزۡوَٰجٗا مِّنۡهُمۡ زَهۡرَةَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا لِنَفۡتِنَهُمۡ فِيهِۚ وَرِزۡقُ رَبِّكَ خَيۡرٞ وَأَبۡقَىٰ",
                    "transliteration": "Wala tamuddanna AAaynayka ila ma mattaAAna bihi azwajan minhum zahrata alhayati addunya linaftinahum feehi warizqu rabbika khayrun waabqa",
                    "translation": "And do not extend your eyes toward that by which We have given enjoyment to [some] categories of them, [its being but] the splendor of worldly life by which We test them. And the provision of your Lord is better and more enduring."
                }
              ]
            },
            {
              "surah": "21. Al-Anbiya",
              "posts": [
                {
                    "title": "21:35 | Every soul shall taste death",
                    "arabic": "كُلُّ نَفۡسٖ ذَآئِقَةُ ٱلۡمَوۡتِۗ وَنَبۡلُوكُم بِٱلشَّرِّ وَٱلۡخَيۡرِ فِتۡنَةٗۖ وَإِلَيۡنَا تُرۡجَعُونَ",
                    "transliteration": "Kullu nafsin thaiqatu almawti wanablookum bishsharri walkhayri fitnatan wailayna turjaAAoon",
                    "translation": "Every soul will taste death. And We test you with evil and with good as trial; and to Us you will be returned."
                },
                {
                    "title": "21:50 | The Quran as a reminder",
                    "arabic": "وَهَٰذَا ذِكۡرٞ مُّبَارَكٌ أَنزَلۡنَٰهُۚ أَفَأَنتُمۡ لَهُۥ مُنكِرُونَ",
                    "transliteration": "Wahatha thikrun mubarakun anzalnahu afaantum lahu munkiroon",
                    "translation": "And this [Qur'an] is a blessed message which We have sent down. Then are you with it unacquainted?"
                },
                {
                    "title": "21:107 | The prophet as a mercy to mankind",
                    "arabic": "وَمَآ أَرۡسَلۡنَٰكَ إِلَّا رَحۡمَةٗ لِّلۡعَٰلَمِينَ",
                    "transliteration": "Wama arsalnaka illa rahmatan lilAAalameen",
                    "translation": "And We have not sent you, [O Muhammad], except as a mercy to the worlds."
                }
              ]
            },
            {
              "surah": "22. Al-Hajj",
              "posts": [
                {
                    "title": "22:7 | The coming of the Hour",
                    "arabic": "وَأَنَّ ٱلسَّاعَةَ ءَاتِيَةٞ لَّا رَيۡبَ فِيهَا وَأَنَّ ٱللَّهَ يَبۡعَثُ مَن فِي ٱلۡقُبُورِ",
                    "transliteration": "Waanna assaAAata atiyatun la rayba feeha waanna Allaha yabAAathu man fee alquboor",
                    "translation": "And [that they may know] that the Hour is coming - no doubt about it - and that Allah will resurrect those in the graves."
                },
                {
                    "title": "22:8 | Do not dispute without knowledge",
                    "arabic": "وَمِنَ ٱلنَّاسِ مَن يُجَٰدِلُ فِي ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَلَا هُدٗى وَلَا كِتَٰبٖ مُّنِيرٖ",
                    "transliteration": "Wamina annasi man yujadilu fee Allahi bighayri AAilmin wala hudan wala kitabin muneer",
                    "translation": "And of the people is he who disputes about Allah without knowledge or guidance or an enlightening book [from Him],"
                },
                {
                    "title": "22:35 | Characteristics of the mukhbitin",
                    "arabic": "ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَٱلصَّٰبِرِينَ عَلَىٰ مَآ أَصَابَهُمۡ وَٱلۡمُقِيمِي ٱلصَّلَوٰةِ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ",
                    "transliteration": "Allatheena itha thukira Allahu wajilat quloobuhum wassabireena AAala ma asabahum walmuqeemee assalati wamimma razaqnahum yunfiqoon",
                    "translation": "Who, when Allah is mentioned, their hearts are fearful, and [to] the patient over what has afflicted them, and the establishers of prayer and those who spend from what We have provided them."
                },
                {
                    "title": "22:39 | First commandment for self-defence",
                    "arabic": "أُذِنَ لِلَّذِينَ يُقَٰتَلُونَ بِأَنَّهُمۡ ظُلِمُواْۚ وَإِنَّ ٱللَّهَ عَلَىٰ نَصۡرِهِمۡ لَقَدِيرٌ",
                    "transliteration": "Othina lillatheena yuqataloona biannahum thulimoo wainna Allaha AAala nasrihim laqadeer",
                    "translation": "Permission [to fight] has been given to those who are being fought, because they were wronged. And indeed, Allah is competent to give them victory."
                },
                {
                    "title": "22:77 | Verse of prostration (sajdah)",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱرۡكَعُواْ وَٱسۡجُدُواْۤ وَٱعۡبُدُواْ رَبَّكُمۡ وَٱفۡعَلُواْ ٱلۡخَيۡرَ لَعَلَّكُمۡ تُفۡلِحُونَ",
                    "transliteration": "Ya-ayyuha allatheena amanoo irkaAAoo wasjudoo waAAbudoo rabbakum wafAAaloo alkhayra laAAallakum tuflihoon",
                    "translation": "O you who have believed, bow and prostrate and worship your Lord and do good - that you may succeed."
                }
              ]
            },
            {
              "surah": "23. Al-Mu'minun",
              "posts": [
                {
                    "title": "23:21 | The cattle as a lesson",
                    "arabic": "وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهَا وَلَكُمۡ فِيهَا مَنَٰفِعُ كَثِيرَةٞ وَمِنۡهَا تَأۡكُلُونَ",
                    "transliteration": "Wainna lakum fee alanAAami laAAibratan nusqeekum mimma fee butooniha walakum feeha manafiAAu katheeratun waminha takuloon",
                    "translation": "And indeed, for you in livestock is a lesson. We give you drink from that which is in their bellies, and for you in them are numerous benefits, and from them you eat."
                },
                {
                    "title": "23:61 | Race for good deeds",
                    "arabic": "أُوْلَٰٓئِكَ يُسَٰرِعُونَ فِي ٱلۡخَيۡرَٰتِ وَهُمۡ لَهَا سَٰبِقُونَ",
                    "transliteration": "Olaika yusariAAoona fee alkhayrati wahum laha sabiqoon",
                    "translation": "It is those who hasten to good deeds, and they outstrip [others] therein."
                },
                {
                    "title": "23:96 | How to respond to evil",
                    "arabic": "ٱدۡفَعۡ بِٱلَّتِي هِيَ أَحۡسَنُ ٱلسَّيِّئَةَۚ نَحۡنُ أَعۡلَمُ بِمَا يَصِفُونَ",
                    "transliteration": "IdfaAA billatee hiya ahsanu assayyiata nahnu aAAlamu bima yasifoon",
                    "translation": "Repel, by [means of] what is best, [their] evil. We are most knowing of what they describe."
                }
              ]
            },
            {
              "surah": "24. An-Nur",
              "posts": [
                {
                    "title": "24:26 | Good and evil",
                    "arabic": "ٱلۡخَبِيثَٰتُ لِلۡخَبِيثِينَ وَٱلۡخَبِيثُونَ لِلۡخَبِيثَٰتِۖ وَٱلطَّيِّبَٰتُ لِلطَّيِّبِينَ وَٱلطَّيِّبُونَ لِلطَّيِّبَٰتِۚ أُوْلَٰٓئِكَ مُبَرَّءُونَ مِمَّا يَقُولُونَۖ لَهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ",
                    "transliteration": "Alkhabeethatu lilkhabeetheena walkhabeethoona lilkhabeethati wattayyibatu littayyibeena wattayyiboona littayyibati olaika mubarraoona mimma yaqooloona lahum maghfiratun warizqun kareem",
                    "translation": "Evil words are for evil men, and evil men are [subjected] to evil words. And good words are for good men, and good men are [an object] of good words. Those [good people] are declared innocent of what the slanderers say. For them is forgiveness and noble provision."
                },
                {
                    "title": "24:31 | Ethics of modesty",
                    "arabic": "وَقُل لِّلۡمُؤۡمِنَٰتِ يَغۡضُضۡنَ مِنۡ أَبۡصَٰرِهِنَّ وَيَحۡفَظۡنَ فُرُوجَهُنَّ وَلَا يُبۡدِينَ زِينَتَهُنَّ إِلَّا مَا ظَهَرَ مِنۡهَاۖ وَلۡيَضۡرِبۡنَ بِخُمُرِهِنَّ عَلَىٰ جُيُوبِهِنَّۖ وَلَا يُبۡدِينَ زِينَتَهُنَّ إِلَّا لِبُعُولَتِهِنَّ أَوۡ ءَابَآئِهِنَّ أَوۡ ءَابَآءِ بُعُولَتِهِنَّ أَوۡ أَبۡنَآئِهِنَّ أَوۡ أَبۡنَآءِ بُعُولَتِهِنَّ أَوۡ إِخۡوَٰنِهِنَّ أَوۡ بَنِيٓ إِخۡوَٰنِهِنَّ أَوۡ بَنِيٓ أَخَوَٰتِهِنَّ أَوۡ نِسَآئِهِنَّ أَوۡ مَا مَلَكَتۡ أَيۡمَٰنُهُنَّ أَوِ ٱلتَّٰبِعِينَ غَيۡرِ أُوْلِي ٱلۡإِرۡبَةِ مِنَ ٱلرِّجَالِ أَوِ ٱلطِّفۡلِ ٱلَّذِينَ لَمۡ يَظۡهَرُواْ عَلَىٰ عَوۡرَٰتِ ٱلنِّسَآءِۖ وَلَا يَضۡرِبۡنَ بِأَرۡجُلِهِنَّ لِيُعۡلَمَ مَا يُخۡفِينَ مِن زِينَتِهِنَّۚ وَتُوبُوٓاْ إِلَى ٱللَّهِ جَمِيعًا أَيُّهَ ٱلۡمُؤۡمِنُونَ لَعَلَّكُمۡ تُفۡلِحُونَ",
                    "transliteration": "Waqul lilmuminati yaghdudna min absarihinna wayahfathna furoojahunna wala yubdeena zeenatahunna illa ma thahara minha walyadribna bikhumurihinna AAala juyoobihinna wala yubdeena zeenatahunna illa libuAAoolatihinna aw abaihinna aw abai buAAoolatihinna aw abnaihinna aw abnai buAAoolatihinna aw ikhwanihinna aw banee ikhwanihinna aw banee akhawatihinna aw nisaihinna aw ma malakat aymanuhunna awi attabiAAeena ghayri olee alirbati mina arrijali awi attifli allatheena lam yathharoo AAala AAawrati annisai wala yadribna biarjulihinna liyuAAlama ma yukhfeena min zeenatihinna watooboo ila Allahi jameeAAan ayyuha almuminoona laAAallakum tuflihoon",
                    "translation": "And tell the believing women to reduce [some] of their vision and guard their private parts and not expose their adornment except that which [necessarily] appears thereof and to wrap [a portion of] their headcovers over their chests and not expose their adornment except to their husbands, their fathers, their husbands' fathers, their sons, their husbands' sons, their brothers, their brothers' sons, their sisters' sons, their women, that which their right hands possess, or those male attendants having no physical desire, or children who are not yet aware of the private aspects of women. And let them not stamp their feet to make known what they conceal of their adornment. And turn to Allah in repentance, all of you, O believers, that you might succeed."
                },
                {
                    "title": "24:35 | Allah is the Light of the heavens and the earth",
                    "arabic": "ٱللَّهُ نُورُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ مَثَلُ نُورِهِۦ كَمِشۡكَوٰةٖ فِيهَا مِصۡبَاحٌۖ ٱلۡمِصۡبَاحُ فِي زُجَاجَةٍۖ ٱلزُّجَاجَةُ كَأَنَّهَا كَوۡكَبٞ دُرِّيّٞ يُوقَدُ مِن شَجَرَةٖ مُّبَٰرَكَةٖ زَيۡتُونَةٖ لَّا شَرۡقِيَّةٖ وَلَا غَرۡبِيَّةٖ يَكَادُ زَيۡتُهَا يُضِيٓءُ وَلَوۡ لَمۡ تَمۡسَسۡهُ نَارٞۚ نُّورٌ عَلَىٰ نُورٖۚ يَهۡدِي ٱللَّهُ لِنُورِهِۦ مَن يَشَآءُۚ وَيَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَٰلَ لِلنَّاسِۗ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ",
                    "transliteration": "Allahu nooru assamawati walardi mathalu noorihi kamishkatin feeha misbahun almisbahu fee zujajatin azzujajatu kaannaha kawkabun durriyyun yooqadu min shajaratin mubarakatin zaytoonatin la sharqiyyatin wala gharbiyyatin yakadu zaytuha yudeeo walaw lam tamsashu narun noorun AAala noorin yahdee Allahu linoorihi man yashao wayadribu Allahu alamthala linnasi wallahu bikulli shayin AAaleem",
                    "translation": "Allah is the Light of the heavens and the earth. The example of His light is like a niche within which is a lamp, the lamp is within glass, the glass as if it were a pearly [white] star lit from [the oil of] a blessed olive tree, neither of the east nor of the west, whose oil would almost glow even if untouched by fire. Light upon light. Allah guides to His light whom He wills. And Allah presents examples for the people, and Allah is Knowing of all things."
                },
                {
                    "title": "24:41 | Even birds spreading their wings extol Allah's glory",
                    "arabic": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ يُسَبِّحُ لَهُۥ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱلطَّيۡرُ صَٰٓفَّٰتٖۖ كُلّٞ قَدۡ عَلِمَ صَلَاتَهُۥ وَتَسۡبِيحَهُۥۗ وَٱللَّهُ عَلِيمُۢ بِمَا يَفۡعَلُونَ",
                    "transliteration": "Alam tara anna Allaha yusabbihu lahu man fee assamawati walardi wattayru saffatin kullun qad AAalima salatahu watasbeehahu wallahu AAaleemun bima yafAAaloon",
                    "translation": "Do you not see that Allah is exalted by whomever is within the heavens and the earth and [by] the birds with wings spread [in flight]? Each [of them] has known his [means of] prayer and exalting [Him], and Allah is Knowing of what they do."
                },
                {
                    "title": "24:45 | Allah has created every living thing from water",
                    "arabic": "وَٱللَّهُ خَلَقَ كُلَّ دَآبَّةٖ مِّن مَّآءٖۖ فَمِنۡهُم مَّن يَمۡشِي عَلَىٰ بَطۡنِهِۦ وَمِنۡهُم مَّن يَمۡشِي عَلَىٰ رِجۡلَيۡنِ وَمِنۡهُم مَّن يَمۡشِي عَلَىٰٓ أَرۡبَعٖۚ يَخۡلُقُ ٱللَّهُ مَا يَشَآءُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ",
                    "transliteration": "Wallahu khalaqa kulla dabbatin min main faminhum man yamshee AAala batnihi waminhum man yamshee AAala rijlayni waminhum man yamshee AAala arbaAAin yakhluqu Allahu ma yashao inna Allaha AAala kulli shayin qadeer",
                    "translation": "Allah has created every [living] creature from water. And of them are those that move on their bellies, and of them are those that walk on two legs, and of them are those that walk on four. Allah creates what He wills. Indeed, Allah is over all things competent."
                }
              ]
            },
            {
              "surah": "25. Al-Furqan",
              "posts": [
                {
                    "title": "25:1 | Quran as a warning",
                    "arabic": "تَبَارَكَ ٱلَّذِي نَزَّلَ ٱلۡفُرۡقَانَ عَلَىٰ عَبۡدِهِۦ لِيَكُونَ لِلۡعَٰلَمِينَ نَذِيرًا",
                    "transliteration": "Tabaraka allathee nazzala alfurqana AAala AAabdihi liyakoona lilAAalameena natheera",
                    "translation": "Blessed is He who sent down the Criterion upon His Servant that he may be to the worlds a warner"
                },
                {
                    "title": "25:27 | Not following the messenger",
                    "arabic": "وَيَوۡمَ يَعَضُّ ٱلظَّالِمُ عَلَىٰ يَدَيۡهِ يَقُولُ يَٰلَيۡتَنِي ٱتَّخَذۡتُ مَعَ ٱلرَّسُولِ سَبِيلٗا",
                    "transliteration": "Wayawma yaAAaddu aththalimu AAala yadayhi yaqoolu ya-laytanee ittakhathtu maAAa arrasooli sabeela",
                    "translation": "And the Day the wrongdoer will bite on his hands [in regret] he will say, \"Oh, I wish I had taken with the Messenger a way.\""
                },
                {
                    "title": "25:28 | Choosing friends carefully",
                    "arabic": "يَٰوَيۡلَتَىٰ لَيۡتَنِي لَمۡ أَتَّخِذۡ فُلَانًا خَلِيلٗا",
                    "transliteration": "Ya-waylata laytanee lam attakhith fulanan khaleela",
                    "translation": "Oh, woe to me! I wish I had not taken that one as a friend."
                },
                {
                    "title": "25:30 | Complaint of the Prophet on the Day of Judgement",
                    "arabic": "وَقَالَ ٱلرَّسُولُ يَٰرَبِّ إِنَّ قَوۡمِي ٱتَّخَذُواْ هَٰذَا ٱلۡقُرۡءَانَ مَهۡجُورٗا",
                    "transliteration": "Waqala arrasoolu ya-rabbi inna qawmee ittakhathoo hatha alqurana mahjoora",
                    "translation": "And the Messenger has said, \"O my Lord, indeed my people have taken this Qur'an as [a thing] abandoned.\""
                },
                {
                    "title": "25:52 | Striving with the Quran",
                    "arabic": "فَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَجَٰهِدۡهُم بِهِۦ جِهَادٗا كَبِيرٗا",
                    "transliteration": "Fala tutiAAi alkafireena wajahidhum bihi jihadan kabeera",
                    "translation": "So do not obey the disbelievers, and strive against them with the Qur'an a great striving."
                },
                {
                    "title": "25:58 | Trust in Allah who is always there",
                    "arabic": "وَتَوَكَّلۡ عَلَى ٱلۡحَيِّ ٱلَّذِي لَا يَمُوتُ وَسَبِّحۡ بِحَمۡدِهِۦۚ وَكَفَىٰ بِهِۦ بِذُنُوبِ عِبَادِهِۦ خَبِيرًا",
                    "transliteration": "Watawakkal AAala alhayyi allathee la yamootu wasabbih bihamdihi wakafa bihi bithunoobi AAibadihi khabeera",
                    "translation": "And rely upon the Ever-Living who does not die, and exalt [Allah] with His praise. And sufficient is He to be, with the sins of His servants, Acquainted"
                }
              ]
            },
            {
              "surah": "26. Ash-Shu'ara",
              "posts": [
                {
                    "title": "26:62 | Faith and confidence in Allah",
                    "arabic": "قَالَ كـَلَّآۖ إِنَّ مَعِيَ رَبِّي سَيَهۡدِينِ",
                    "transliteration": "Qala kalla inna maAAiya rabbee sayahdeen",
                    "translation": "[Moses] said, \"No! Indeed, with me is my Lord; He will guide me.\""
                },
                {
                    "title": "26:89 | A sound heart is what ultimately counts",
                    "arabic": "إِلَّا مَنۡ أَتَى ٱللَّهَ بِقَلۡبٖ سَلِيمٖ",
                    "transliteration": "Illa man ata Allaha biqalbin saleem",
                    "translation": "But only one who comes to Allah with a sound heart."
                }
              ]
            },
            {
              "surah": "27. An-Naml",
              "posts": [
                {
                    "title": "27:30 | Letter of Sulayman to the Queen of Sheba",
                    "arabic": "إِنَّهُۥ مِن سُلَيۡمَٰنَ وَإِنَّهُۥ بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ",
                    "transliteration": "Innahu min sulaymana wainnahu bismi Allahi arrahmani arraheem",
                    "translation": "Indeed, it is from Solomon, and indeed, it reads: 'In the name of Allah, the Entirely Merciful, the Especially Merciful'"
                },
                {
                    "title": "27:69 | Importance of travel",
                    "arabic": "قُلۡ سِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُجۡرِمِينَ",
                    "transliteration": "Qul seeroo fee alardi fanthuroo kayfa kana AAaqibatu almujrimeen",
                    "translation": "Say, [O Muhammad], \"Travel through the land and observe how was the end of the criminals.\""
                },
                {
                    "title": "27:89 | Allah's generosity",
                    "arabic": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَا وَهُم مِّن فَزَعٖ يَوۡمَئِذٍ ءَامِنُونَ",
                    "transliteration": "Man jaa bilhasanati falahu khayrun minha wahum min fazaAAin yawmaithin aminoon",
                    "translation": "Whoever comes [at Judgement] with a good deed will have better than it, and they, from the terror of that Day, will be safe."
                }
              ]
            },
            {
              "surah": "28. Al-Qasas",
              "posts": [
                {
                    "title": "28:34 | Importance of eloquence in speech",
                    "arabic": "وَأَخِي هَٰرُونُ هُوَ أَفۡصَحُ مِنِّي لِسَانٗا فَأَرۡسِلۡهُ مَعِيَ رِدۡءٗا يُصَدِّقُنِيٓۖ إِنِّيٓ أَخَافُ أَن يُكَذِّبُونِ",
                    "transliteration": "Waakhee haroonu huwa afsahu minnee lisanan faarsilhu maAAiya ridan yusaddiqunee innee akhafu an yukaththiboon",
                    "translation": "And my brother Aaron is more fluent than me in tongue, so send him with me as support, verifying me. Indeed, I fear that they will deny me."
                },
                {
                    "title": "28:56 | Guidance is in Allah's hands",
                    "arabic": "إِنَّكَ لَا تَهۡدِي مَنۡ أَحۡبَبۡتَ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۚ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ",
                    "transliteration": "Innaka la tahdee man ahbabta walakinna Allaha yahdee man yashao wahuwa aAAlamu bilmuhtadeen",
                    "translation": "Indeed, [O Muhammad], you do not guide whom you like, but Allah guides whom He wills. And He is most knowing of the [rightly] guided."
                },
                {
                    "title": "28:68 | The power of Allah",
                    "arabic": "وَرَبُّكَ يَخۡلُقُ مَا يَشَآءُ وَيَخۡتَارُۗ مَا كَانَ لَهُمُ ٱلۡخِيَرَةُۚ سُبۡحَٰنَ ٱللَّهِ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ",
                    "transliteration": "Warabbuka yakhluqu ma yashao wayakhtaru ma kana lahumu alkhiyaratu subhana Allahi wataAAala AAamma yushrikoon",
                    "translation": "And your Lord creates what He wills and chooses; not for them was the choice. Exalted is Allah and high above what they associate with Him."
                },
                {
                    "title": "28:73 | Night and day",
                    "arabic": "وَمِن رَّحۡمَتِهِۦ جَعَلَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ لِتَسۡكُنُواْ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ",
                    "transliteration": "Wamin rahmatihi jaAAala lakumu allayla wannahara litaskunoo feehi walitabtaghoo min fadlihi walaAAallakum tashkuroon",
                    "translation": "And out of His mercy He made for you the night and the day that you may rest therein and [by day] seek from His bounty and [that] perhaps you will be grateful."
                }
              ]
            },
            {
              "surah": "29. Al-Ankabut",
              "posts": [
                {
                    "title": "29:8 | Absolute obedience to parents except...",
                    "arabic": "وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ حُسۡنٗاۖ وَإِن جَٰهَدَاكَ لِتُشۡرِكَ بِي مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٞ فَلَا تُطِعۡهُمَآۚ إِلَيَّ مَرۡجِعُكُمۡ فَأُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ",
                    "transliteration": "Wawassayna alinsana biwalidayhi husnan wain jahadaka litushrika bee ma laysa laka bihi AAilmun fala tutiAAhuma ilayya marjiAAukum faonabbiokum bima kuntum taAAmaloon",
                    "translation": "And We have enjoined upon man goodness to parents. But if they endeavor to make you associate with Me that of which you have no knowledge, do not obey them. To Me is your return, and I will inform you about what you used to do."
                },
                {
                    "title": "29:41 | Cobweb - the weakest of all dwellings",
                    "arabic": "مَثَلُ ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ أَوۡلِيَآءَ كَمَثَلِ ٱلۡعَنكَبُوتِ ٱتَّخَذَتۡ بَيۡتٗاۖ وَإِنَّ أَوۡهَنَ ٱلۡبُيُوتِ لَبَيۡتُ ٱلۡعَنكَبُوتِۚ لَوۡ كَانُواْ يَعۡلَمُونَ",
                    "transliteration": "Mathalu allatheena ittakhathoo min dooni Allahi awliyaa kamathali alAAankabooti ittakhathat baytan wainna awhana albuyooti labaytu alAAankabooti law kanoo yaAAlamoon",
                    "translation": "The example of those who take allies other than Allah is like that of the spider who takes a home. And indeed, the weakest of homes is the home of the spider, if they only knew."
                },
                {
                    "title": "29:45 | The purpose of prayer",
                    "arabic": "ٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِنَ ٱلۡكِتَٰبِ وَأَقِمِ ٱلصَّلَوٰةَۖ إِنَّ ٱلصَّلَوٰةَ تَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِۗ وَلَذِكۡرُ ٱللَّهِ أَكۡبَرُۗ وَٱللَّهُ يَعۡلَمُ مَا تَصۡنَعُونَ",
                    "transliteration": "Recite, [O Muhammad], what has been revealed to you of the Book and establish prayer. Indeed, prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater. And Allah knows that which you do.",
                    "translation": "Otlu ma oohiya ilayka mina alkitabi waaqimi assalata inna assalata tanha AAani alfahshai walmunkari walathikru Allahi akbaru wallahu yaAAlamu ma tasnaAAoon"
                },
                {
                    "title": "29:51 | The Quran is enough for us",
                    "arabic": "أَوَلَمۡ يَكۡفِهِمۡ أَنَّآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ يُتۡلَىٰ عَلَيۡهِمۡۚ إِنَّ فِي ذَٰلِكَ لَرَحۡمَةٗ وَذِكۡرَىٰ لِقَوۡمٖ يُؤۡمِنُونَ",
                    "transliteration": "Awalam yakfihim anna anzalna AAalayka alkitaba yutla AAalayhim inna fee thalika larahmatan wathikra liqawmin yuminoon",
                    "translation": "And is it not sufficient for them that We revealed to you the Book which is recited to them? Indeed in that is a mercy and reminder for a people who believe."
                },
                {
                    "title": "29:60 | Allah is the Sustainer",
                    "arabic": "وَكَأَيِّن مِّن دَآبَّةٖ لَّا تَحۡمِلُ رِزۡقَهَا ٱللَّهُ يَرۡزُقُهَا وَإِيَّاكُمۡۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ",
                    "transliteration": "Wakaayyin min dabbatin la tahmilu rizqaha Allahu yarzuquha waiyyakum wahuwa assameeAAu alAAaleem",
                    "translation": "And how many a creature carries not its [own] provision. Allah provides for it and for you. And He is the Hearing, the Knowing."
                },
                {
                    "title": "29:62 | Your rizq (sustenance) is in Allah's hand",
                    "arabic": "ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ مِنۡ عِبَادِهِۦ وَيَقۡدِرُ لَهُۥٓۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٞ",
                    "transliteration": "Allahu yabsutu arrizqa liman yashao min AAibadihi wayaqdiru lahu inna Allaha bikulli shayin AAaleem",
                    "translation": "Allah extends provision for whom He wills of His servants and restricts for him. Indeed Allah is, of all things, Knowing."
                },
                {
                    "title": "29:64 | Reality of life in this world",
                    "arabic": "وَمَا هَٰذِهِ ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا لَهۡوٞ وَلَعِبٞۚ وَإِنَّ ٱلدَّارَ ٱلۡأٓخِرَةَ لَهِيَ ٱلۡحَيَوَانُۚ لَوۡ كَانُواْ يَعۡلَمُونَ",
                    "transliteration": "Wama hathihi alhayatu addunya illa lahwun walaAAibun wainna addara alakhirata lahiya alhayawanu law kanoo yaAAlamoon",
                    "translation": "And this worldly life is not but diversion and amusement. And indeed, the home of the Hereafter - that is the [eternal] life, if only they knew."
                }
              ]
            },
            {
              "surah": "30. Ar-Rum",
              "posts": [
                {
                    "title": "30:8 | Self reflection",
                    "arabic": "أَوَلَمۡ يَتَفَكَّرُواْ فِيٓ أَنفُسِهِمۗ مَّا خَلَقَ ٱللَّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّ وَأَجَلٖ مُّسَمّٗىۗ وَإِنَّ كَثِيرٗا مِّنَ ٱلنَّاسِ بِلِقَآيِٕ رَبِّهِمۡ لَكَٰفِرُونَ",
                    "transliteration": "Awalam yatafakkaroo fee anfusihim ma khalaqa Allahu assamawati walarda wama baynahuma illa bilhaqqi waajalin musamman wainna katheeran mina annasi biliqai rabbihim lakafiroon",
                    "translation": "Do they not contemplate within themselves? Allah has not created the heavens and the earth and what is between them except in truth and for a specified term. And indeed, many of the people, in [the matter of] the meeting with their Lord, are disbelievers."
                },
                {
                    "title": "30:23 | Sleep as a sign",
                    "arabic": "وَمِنۡ ءَايَٰتِهِۦ مَنَامُكُم بِٱلَّيۡلِ وَٱلنَّهَارِ وَٱبۡتِغَآؤُكُم مِّن فَضۡلِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَسۡمَعُونَ",
                    "transliteration": "Wamin ayatihi manamukum billayli wannahari wabtighaokum min fadlihi inna fee thalika laayatin liqawmin yasmaAAoon",
                    "translation": "And of His signs is your sleep by night and day and your seeking of His bounty. Indeed in that are signs for a people who listen."
                },
                {
                    "title": "30:50 | Traces of the mercy of Allah",
                    "arabic": "فَٱنظُرۡ إِلَىٰٓ ءَاثَٰرِ رَحۡمَتِ ٱللَّهِ كَيۡفَ يُحۡيِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ ذَٰلِكَ لَمُحۡيِ ٱلۡمَوۡتَىٰۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ",
                    "transliteration": "Fanthur ila athari rahmati Allahi kayfa yuhyee alarda baAAda mawtiha inna thalika lamuhyee almawta wahuwa AAala kulli shayin qadeer",
                    "translation": "So observe the effects of the mercy of Allah - how He gives life to the earth after its lifelessness. Indeed, that [same one] will give life to the dead, and He is over all things competent."
                },
                {
                    "title": "30:54 | Stages of life - youthhood described as a phase of power and strength",
                    "arabic": "ٱللَّهُ ٱلَّذِي خَلَقَكُم مِّن ضَعۡفٖ ثُمَّ جَعَلَ مِنۢ بَعۡدِ ضَعۡفٖ قُوَّةٗ ثُمَّ جَعَلَ مِنۢ بَعۡدِ قُوَّةٖ ضَعۡفٗا وَشَيۡبَةٗۚ يَخۡلُقُ مَا يَشَآءُۚ وَهُوَ ٱلۡعَلِيمُ ٱلۡقَدِيرُ",
                    "transliteration": "Allahu allathee khalaqakum min daAAfin thumma jaAAala min baAAdi daAAfin quwwatan thumma jaAAala min baAAdi quwwatin daAAfan washaybatan yakhluqu ma yashao wahuwa alAAaleemu alqadeer",
                    "translation": "Allah is the one who created you from weakness, then made after weakness strength, then made after strength weakness and white hair. He creates what He wills, and He is the Knowing, the Competent."
                }
              ]
            },
            {
              "surah": "31. Luqman",
              "posts": [
                {
                    "title": "31:14 | Being grateful to parents",
                    "arabic": "وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ حَمَلَتۡهُ أُمُّهُۥ وَهۡنًا عَلَىٰ وَهۡنٖ وَفِصَٰلُهُۥ فِي عَامَيۡنِ أَنِ ٱشۡكُرۡ لِي وَلِوَٰلِدَيۡكَ إِلَيَّ ٱلۡمَصِيرُ",
                    "transliteration": "Wawassayna alinsana biwalidayhi hamalathu ommuhu wahnan AAala wahnin wafisaluhu fee AAamayni ani oshkur lee waliwalidayka ilayya almaseer",
                    "translation": "And We have enjoined upon man [care] for his parents. His mother carried him, [increasing her] in weakness upon weakness, and his weaning is in two years. Be grateful to Me and to your parents; to Me is the [final] destination."
                },
                {
                    "title": "31:22 | Total submission to Allah",
                    "arabic": "وَمَن يُسۡلِمۡ وَجۡهَهُۥٓ إِلَى ٱللَّهِ وَهُوَ مُحۡسِنٞ فَقَدِ ٱسۡتَمۡسَكَ بِٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰۗ وَإِلَى ٱللَّهِ عَٰقِبَةُ ٱلۡأُمُورِ",
                    "transliteration": "Waman yuslim wajhahu ila Allahi wahuwa muhsinun faqadi istamsaka bilAAurwati alwuthqa waila Allahi AAaqibatu alomoor",
                    "translation": "And whoever submits his face to Allah while he is a doer of good - then he has grasped the most trustworthy handhold. And to Allah will be the outcome of [all] matters."
                },
                {
                    "title": "31:24 | Enjoyment - to what end?",
                    "arabic": "نُمَتِّعُهُمۡ قَلِيلٗا ثُمَّ نَضۡطَرُّهُمۡ إِلَىٰ عَذَابٍ غَلِيظٖ",
                    "transliteration": "NumattiAAuhum qaleelan thumma nadtarruhum ila AAathabin ghaleeth",
                    "translation": "We grant them enjoyment for a little; then We will force them to a massive punishment."
                },
                {
                    "title": "31:34 | Five things known only to Allah",
                    "arabic": "إِنَّ ٱللَّهَ عِندَهُۥ عِلۡمُ ٱلسَّاعَةِ وَيُنَزِّلُ ٱلۡغَيۡثَ وَيَعۡلَمُ مَا فِي ٱلۡأَرۡحَامِۖ وَمَا تَدۡرِي نَفۡسٞ مَّاذَا تَكۡسِبُ غَدٗاۖ وَمَا تَدۡرِي نَفۡسُۢ بِأَيِّ أَرۡضٖ تَمُوتُۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرُۢ",
                    "transliteration": "Inna Allaha AAindahu AAilmu assaAAati wayunazzilu alghaytha wayaAAlamu ma fee alarhami wama tadree nafsun matha taksibu ghadan wama tadree nafsun biayyi ardin tamootu inna Allaha AAaleemun khabeer",
                    "translation": "Indeed, Allah [alone] has knowledge of the Hour and sends down the rain and knows what is in the wombs. And no soul perceives what it will earn tomorrow, and no soul perceives in what land it will die. Indeed, Allah is Knowing and Acquainted."
                }
              ]
            },
            {
              "surah": "32. As-Sajdah",
              "posts": [
                {
                    "title": "32:7 | Perfection in Allah's creation",
                    "arabic": "ٱلَّذِيٓ أَحۡسَنَ كُلَّ شَيۡءٍ خَلَقَهُۥۖ وَبَدَأَ خَلۡقَ ٱلۡإِنسَٰنِ مِن طِينٖ",
                    "transliteration": "Allathee ahsana kulla shayin khalaqahu wabadaa khalqa alinsani min teen",
                    "translation": "Who perfected everything which He created and began the creation of man from clay."
                },
                {
                    "title": "32:17 | The hidden joy",
                    "arabic": "فَلَا تَعۡلَمُ نَفۡسٞ مَّآ أُخۡفِيَ لَهُم مِّن قُرَّةِ أَعۡيُنٖ جَزَآءَۢ بِمَا كَانُواْ يَعۡمَلُونَ",
                    "transliteration": "Fala taAAlamu nafsun ma okhfiya lahum min qurrati aAAyunin jazaan bima kanoo yaAAmaloon",
                    "translation": "And no soul knows what has been hidden for them of comfort for eyes as reward for what they used to do."
                }
              ]
            },
            {
              "surah": "33. Al-Ahzab",
              "posts": [
                {
                    "title": "33:3 | Trust in Allah",
                    "arabic": "وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا",
                    "transliteration": "Watawakkal AAala Allahi wakafa billahi wakeela",
                    "translation": "And rely upon Allah; and sufficient is Allah as Disposer of affairs."
                },
                {
                    "title": "33:21 | The best role model",
                    "arabic": "لَّقَدۡ كَانَ لَكُمۡ فِي رَسُولِ ٱللَّهِ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَ وَذَكَرَ ٱللَّهَ كَثِيرٗا",
                    "transliteration": "Laqad kana lakum fee rasooli Allahi oswatun hasanatun liman kana yarjoo Allaha walyawma alakhira wathakara Allaha katheera",
                    "translation": "There has certainly been for you in the Messenger of Allah an excellent pattern for anyone whose hope is in Allah and the Last Day and [who] remembers Allah often."
                },
                {
                    "title": "33:32 | Manners of speech",
                    "arabic": "يَٰنِسَآءَ ٱلنَّبِيِّ لَسۡتُنَّ كَأَحَدٖ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيۡتُنَّۚ فَلَا تَخۡضَعۡنَ بِٱلۡقَوۡلِ فَيَطۡمَعَ ٱلَّذِي فِي قَلۡبِهِۦ مَرَضٞ وَقُلۡنَ قَوۡلٗا مَّعۡرُوفٗا",
                    "transliteration": "O wives of the Prophet, you are not like anyone among women. If you fear Allah, then do not be soft in speech [to men], lest he in whose heart is disease should covet, but speak with appropriate speech.",
                    "translation": "Ya-nisaa annabiyyi lastunna kaahadin mina annisai ini ittaqaytunna fala takhdaAAna bilqawli fayatmaAAa allathee fee qalbihi maradun waqulna qawlan maAAroofa"
                },
                {
                    "title": "33:37 | Fear Allah, not people",
                    "arabic": "...وَتَخۡشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخۡشَىٰه...ُۖ",
                    "transliteration": "wa takhshan naasa wallaahu ahaqqu an takhshaah",
                    "translation": "...And you feared the people, while Allah has more right that you fear Him..."
                },
                {
                    "title": "33:56 | Sending blessings on the Prophet",
                    "arabic": "إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِيِّۚ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيۡهِ وَسَلِّمُواْ تَسۡلِيمًا",
                    "transliteration": "Inna Allaha wamalaikatahu yusalloona AAala annabiyyi ya-ayyuha allatheena amanoo salloo AAalayhi wasallimoo tasleema",
                    "translation": "Indeed, Allah confers blessing upon the Prophet, and His angels [ask Him to do so]. O you who have believed, ask [Allah to confer] blessing upon him and ask [Allah to grant him] peace."
                },
                {
                    "title": "33:67 | Blindly following leaders and elders",
                    "arabic": "وَقَالُواْ رَبَّنَآ إِنَّآ أَطَعۡنَا سَادَتَنَا وَكُبَرَآءَنَا فَأَضَلُّونَا ٱلسَّبِيلَا۠",
                    "transliteration": "Waqaloo rabbana inna ataAAna sadatana wakubaraana faadalloona assabeela",
                    "translation": "And they will say, \"Our Lord, indeed we obeyed our masters and our dignitaries, and they led us astray from the [right] way.\""
                }
              ]
            },
            {
              "surah": "34. Saba",
              "posts": [
                {
                    "title": "34:36 | Allah increases sustenance",
                    "arabic": "قُلۡ إِنَّ رَبِّي يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ",
                    "transliteration": "Qul inna rabbee yabsutu arrizqa liman yashao wayaqdiru walakinna akthara annasi la yaAAlamoon",
                    "translation": "Say, \"Indeed, my Lord extends provision for whom He wills and restricts [it], but most of the people do not know.\""
                },
                {
                    "title": "34:50 | Misguidance is from us and guidance is from Allah",
                    "arabic": "قُلۡ إِن ضَلَلۡتُ فَإِنَّمَآ أَضِلُّ عَلَىٰ نَفۡسِيۖ وَإِنِ ٱهۡتَدَيۡتُ فَبِمَا يُوحِيٓ إِلَيَّ رَبِّيٓۚ إِنَّهُۥ سَمِيعٞ قَرِيبٞ",
                    "transliteration": "Qul in dalaltu fainnama adillu AAala nafsee waini ihtadaytu fabima yoohee ilayya rabbee innahu sameeAAun qareeb",
                    "translation": "Say, \"If I should err, I would only err against myself. But if I am guided, it is by what my Lord reveals to me. Indeed, He is Hearing and near.\""
                }
              ]
            },
            {
              "surah": "35. Fatir",
              "posts": [
                {
                    "title": "35:2 | Mercy of Allah",
                    "arabic": "مَّا يَفۡتَحِ ٱللَّهُ لِلنَّاسِ مِن رَّحۡمَةٖ فَلَا مُمۡسِكَ لَهَاۖ وَمَا يُمۡسِكۡ فَلَا مُرۡسِلَ لَهُۥ مِنۢ بَعۡدِهِۦۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
                    "transliteration": "Ma yaftahi Allahu linnasi min rahmatin fala mumsika laha wama yumsik fala mursila lahu min baAAdihi wahuwa alAAazeezu alhakeem",
                    "translation": "Whatever Allah grants to people of mercy - none can withhold it; and whatever He withholds - none can release it thereafter. And He is the Exalted in Might, the Wise."
                },
                {
                    "title": "35:10 | To Allah belongs all honour",
                    "arabic": "مَن كَانَ يُرِيدُ ٱلۡعِزَّةَ فَلِلَّهِ ٱلۡعِزَّةُ جَمِيعًاۚ إِلَيۡهِ يَصۡعَدُ ٱلۡكَلِمُ ٱلطَّيِّبُ وَٱلۡعَمَلُ ٱلصَّٰلِحُ يَرۡفَعُهُۥۚ وَٱلَّذِينَ يَمۡكُرُونَ ٱلسَّيِّـَٔاتِ لَهُمۡ عَذَابٞ شَدِيدٞۖ وَمَكۡرُ أُوْلَٰٓئِكَ هُوَ يَبُورُ",
                    "transliteration": "Man kana yureedu alAAizzata falillahi alAAizzatu jameeAAan ilayhi yasAAadu alkalimu attayyibu walAAamalu assalihu yarfaAAuhu wallatheena yamkuroona assayyiati lahum AAathabun shadeedun wamakru olaika huwa yaboor",
                    "translation": "Whoever desires honor [through power] - then to Allah belongs all honor. To Him ascends good speech, and righteous work raises it. But they who plot evil deeds will have a severe punishment, and the plotting of those - it will perish."
                },
                {
                    "title": "35:11 | From creation to death — all is written",
                    "arabic": "وَٱللَّهُ خَلَقَكُم مِّن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ جَعَلَكُمۡ أَزۡوَٰجٗاۚ وَمَا تَحۡمِلُ مِنۡ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلۡمِهِۦۚ وَمَا يُعَمَّرُ مِن مُّعَمَّرٖ وَلَا يُنقَصُ مِنۡ عُمُرِهِۦٓ إِلَّا فِي كِتَٰبٍۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ",
                    "transliteration": "Wallahu khalaqakum min turabin thumma min nutfatin thumma jaAAalakum azwajan wama tahmilu min ontha wala tadaAAu illa biAAilmihi wama yuAAammaru min muAAammarin wala yunqasu min AAumurihi illa fee kitabin inna thalika AAala Allahi yaseer",
                    "translation": "And Allah created you from dust, then from a sperm-drop; then He made you mates. And no female conceives nor does she give birth except with His knowledge. And no aged person is granted [additional] life nor is his lifespan lessened but that it is in a register. Indeed, that for Allah is easy."
                },
                {
                    "title": "35:15 | Humans are poor",
                    "arabic": "۞ يَٰٓأَيُّهَا ٱلنَّاسُ أَنتُمُ ٱلۡفُقَرَآءُ إِلَى ٱللَّهِۖ وَٱللَّهُ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ",
                    "transliteration": "Ya-ayyuha annasu antumu alfuqarao ila Allahi wallahu huwa alghaniyyu alhameed",
                    "translation": "O mankind, you are those in need of Allah, while Allah is the Free of need, the Praiseworthy."
                }
              ]
            },
            {
              "surah": "36. Ya-Sin",
              "posts": [
                {
                    "title": "36:21 | Follow those who seek no worldly gain",
                    "arabic": "ٱتَّبِعُواْ مَن لَّا يَسۡـَٔلُكُمۡ أَجۡرٗا وَهُم مُّهۡتَدُونَ",
                    "transliteration": "IttabiAAoo man la yasalukum ajran wahum muhtadoon",
                    "translation": "Follow those who do not ask of you [any] payment, and they are [rightly] guided."
                },
                {
                    "title": "36:36 | Allah's creation in pairs",
                    "arabic": "سُبۡحَٰنَ ٱلَّذِي خَلَقَ ٱلۡأَزۡوَٰجَ كُلَّهَا مِمَّا تُنۢبِتُ ٱلۡأَرۡضُ وَمِنۡ أَنفُسِهِمۡ وَمِمَّا لَا يَعۡلَمُونَ",
                    "transliteration": "Subhana allathee khalaqa alazwaja kullaha mimma tunbitu alardu wamin anfusihim wamimma la yaAAlamoon",
                    "translation": "Exalted is He who created all pairs - from what the earth grows and from themselves and from that which they do not know."
                },
                {
                    "title": "36:54 | Action driven results",
                    "arabic": "فَٱلۡيَوۡمَ لَا تُظۡلَمُ نَفۡسٞ شَيۡـٔٗا وَلَا تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ",
                    "transliteration": "Falyawma la tuthlamu nafsun shayan wala tujzawna illa ma kuntum taAAmaloon",
                    "translation": "So today no soul will be wronged at all, and you will not be recompensed except for what you used to do."
                },
                {
                    "title": "36:65 | Bodies to testify",
                    "arabic": "ٱلۡيَوۡمَ نَخۡتِمُ عَلَىٰٓ أَفۡوَٰهِهِمۡ وَتُكَلِّمُنَآ أَيۡدِيهِمۡ وَتَشۡهَدُ أَرۡجُلُهُم بِمَا كَانُواْ يَكۡسِبُونَ",
                    "transliteration": "Alyawma nakhtimu AAala afwahihim watukallimuna aydeehim watashhadu arjuluhum bima kanoo yaksiboon",
                    "translation": "That Day, We will seal over their mouths, and their hands will speak to Us, and their feet will testify about what they used to earn."
                },
                {
                    "title": "36:81 | Creation of the heavens and the earth",
                    "arabic": "أَوَلَيۡسَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِقَٰدِرٍ عَلَىٰٓ أَن يَخۡلُقَ مِثۡلَهُمۚ بَلَىٰ وَهُوَ ٱلۡخَلَّٰقُ ٱلۡعَلِيمُ",
                    "transliteration": "Awalaysa allathee khalaqa assamawati walarda biqadirin AAala an yakhluqa mithlahum bala wahuwa alkhallaqu alAAaleem",
                    "translation": "Is not He who created the heavens and the earth Able to create the likes of them? Yes, [it is so]; and He is the Knowing Creator."
                },
                {
                    "title": "36:82 | 'Be' and it is",
                    "arabic": "إِنَّمَآ أَمۡرُهُۥٓ إِذَآ أَرَادَ شَيۡـًٔا أَن يَقُولَ لَهُۥ كُن فَيَكُونُ",
                    "transliteration": "Innama amruhu itha arada shayan an yaqoola lahu kun fayakoon",
                    "translation":"His command is only when He intends a thing that He says to it, \"Be,\" and it is."
                }
              ]
            },
            {
              "surah": "37. As-Saffat",
              "posts": [
                {
                    "title": "37:13 | Neglecting reminders",
                    "arabic": "وَإِذَا ذُكِّرُواْ لَا يَذۡكُرُونَ",
                    "transliteration": "Waitha thukkiroo la yathkuroon",
                    "translation": "And when they are reminded, they remember not."
                },
                {
                    "title": "37:35 | Being arrogant",
                    "arabic": "إِنَّهُمۡ كَانُوٓاْ إِذَا قِيلَ لَهُمۡ لَآ إِلَٰهَ إِلَّا ٱللَّهُ يَسۡتَكۡبِرُونَ",
                    "transliteration": "Innahum kanoo itha qeela lahum la ilaha illa Allahu yastakbiroon",
                    "translation": "Indeed they, when it was said to them, \"There is no deity but Allah,\" were arrogant"
                },
                {
                    "title": "37:99 | Turn to Allah",
                    "arabic": "وَقَالَ إِنِّي ذَاهِبٌ إِلَىٰ رَبِّي سَيَهۡدِينِ",
                    "transliteration": "Waqala innee thahibun ila rabbee sayahdeen",
                    "translation": "And [then] he said, \"Indeed, I will go to [where I am ordered by] my Lord; He will guide me.\""
                }
              ]
            },
            {
              "surah": "38. Sad",
              "posts": [
                {
                    "title": "38:17 | Facing opposition with patience",
                    "arabic": "ٱصۡبِرۡ عَلَىٰ مَا يَقُولُونَ وَٱذۡكُرۡ عَبۡدَنَا دَاوُۥدَ ذَا ٱلۡأَيۡدِۖ إِنَّهُۥٓ أَوَّابٌ",
                    "transliteration": "Isbir AAala ma yaqooloona wathkur AAabdana dawooda tha alaydi innahu awwab",
                    "translation": "Be patient over what they say and remember Our servant, David, the possessor of strength; indeed, he was one who repeatedly turned back [to Allah]."
                },
                {
                    "title": "38:27 | Creation with a purpose",
                    "arabic": "وَمَا خَلَقۡنَا ٱلسَّمَآءَ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا بَٰطِلٗاۚ ذَٰلِكَ ظَنُّ ٱلَّذِينَ كَفَرُواْۚ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِنَ ٱلنَّارِ",
                    "transliteration": "Wama khalaqna assamaa walarda wama baynahuma batilan thalika thannu allatheena kafaroo fawaylun lillatheena kafaroo mina annar",
                    "translation": "And We did not create the heaven and the earth and that between them aimlessly. That is the assumption of those who disbelieve, so woe to those who disbelieve from the Fire."
                },
                {
                    "title": "38:29 | Ponder over the Quran",
                    "arabic": "كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ مُبَٰرَكٞ لِّيَدَّبَّرُوٓاْ ءَايَٰتِهِۦ وَلِيَتَذَكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ",
                    "transliteration": "Kitabun anzalnahu ilayka mubarakun liyaddabbaroo ayatihi waliyatathakkara oloo alalbab",
                    "translation": "[This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded."
                }
              ]
            },
            {
              "surah": "39. Az-Zumar",
              "posts": [
                {
                    "title": "39:8 | Calling to Allah in times of adversity",
                    "arabic": "وَإِذَا مَسَّ ٱلۡإِنسَٰنَ ضُرّٞ دَعَا رَبَّهُۥ مُنِيبًا إِلَيۡهِ ثُمَّ إِذَا خَوَّلَهُۥ نِعۡمَةٗ مِّنۡهُ نَسِيَ مَا كَانَ يَدۡعُوٓاْ إِلَيۡهِ مِن قَبۡلُ وَجَعَلَ لِلَّهِ أَندَادٗا لِّيُضِلَّ عَن سَبِيلِهِۦۚ قُلۡ تَمَتَّعۡ بِكُفۡرِكَ قَلِيلًا إِنَّكَ مِنۡ أَصۡحَٰبِ ٱلنَّارِ",
                    "transliteration": "Waitha massa alinsana durrun daAAa rabbahu muneeban ilayhi thumma itha khawwalahu niAAmatan minhu nasiya ma kana yadAAoo ilayhi min qablu wajaAAala lillahi andadan liyudilla AAan sabeelihi qul tamattaAA bikufrika qaleelan innaka min ashabi annar",
                    "translation": "And when adversity touches man, he calls upon his Lord, turning to Him [alone]; then when He bestows on him a favor from Himself, he forgets Him whom he called upon before, and he attributes to Allah equals to mislead [people] from His way. Say, \"Enjoy your disbelief for a little; indeed, you are of the companions of the Fire.\""
                },
                {
                    "title": "39:13 | Fear of punishment",
                    "arabic": "قُلۡ إِنِّيٓ أَخَافُ إِنۡ عَصَيۡتُ رَبِّي عَذَابَ يَوۡمٍ عَظِيمٖ",
                    "transliteration": "Qul innee akhafu in AAasaytu rabbee AAathaba yawmin AAatheem",
                    "translation": "Say, \"Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\""
                },
                {
                    "title": "39:15 | Real losses",
                    "arabic": "فَٱعۡبُدُواْ مَا شِئۡتُم مِّن دُونِهِۦۗ قُلۡ إِنَّ ٱلۡخَٰسِرِينَ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ وَأَهۡلِيهِمۡ يَوۡمَ ٱلۡقِيَٰمَةِۗ أَلَا ذَٰلِكَ هُوَ ٱلۡخُسۡرَانُ ٱلۡمُبِينُ",
                    "transliteration": "FaAAbudoo ma shitum min doonihi qul inna alkhasireena allatheena khasiroo anfusahum waahleehim yawma alqiyamati ala thalika huwa alkhusranu almubeen",
                    "translation": "So worship what you will besides Him. Say, \"Indeed, the losers are the ones who will lose themselves and their families on the Day of Resurrection. Unquestionably, that is the manifest loss.\""
                },
                {
                    "title": "39:22 | Allah opens hearts inclining to Islam",
                    "arabic": "أَفَمَن شَرَحَ ٱللَّهُ صَدۡرَهُۥ لِلۡإِسۡلَٰمِ فَهُوَ عَلَىٰ نُورٖ مِّن رَّبِّهِۦۚ فَوَيۡلٞ لِّلۡقَٰسِيَةِ قُلُوبُهُم مِّن ذِكۡرِ ٱللَّهِۚ أُوْلَٰٓئِكَ فِي ضَلَٰلٖ مُّبِينٍ",
                    "transliteration": "Afaman sharaha Allahu sadrahu lilislami fahuwa AAala noorin min rabbihi fawaylun lilqasiyati quloobuhum min thikri Allahi olaika fee dalalin mubeen",
                    "translation": "So is one whose breast Allah has expanded to [accept] Islam and he is upon a light from his Lord [like one whose heart rejects it]? Then woe to those whose hearts are hardened against the remembrance of Allah. Those are in manifest error."
                },
                {
                    "title": "39:27 | Similitude in the Quran",
                    "arabic": "وَلَقَدۡ ضَرَبۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ لَّعَلَّهُمۡ يَتَذَكَّرُونَ",
                    "transliteration": "Walaqad darabna linnasi fee hatha alqurani min kulli mathalin laAAallahum yatathakkaroon",
                    "translation": "And We have certainly presented for the people in this Qur'an from every [kind of] example - that they might remember."
                },
                {
                    "title": "39:54 | Turn in repentance towards your Lord",
                    "arabic": "وَأَنِيبُوٓاْ إِلَىٰ رَبِّكُمۡ وَأَسۡلِمُواْ لَهُۥ مِن قَبۡلِ أَن يَأۡتِيَكُمُ ٱلۡعَذَابُ ثُمَّ لَا تُنصَرُونَ",
                    "transliteration": "Waaneeboo ila rabbikum waaslimoo lahu min qabli an yatiyakumu alAAathabu thumma la tunsaroon",
                    "translation": "And return [in repentance] to your Lord and submit to Him before the punishment comes upon you; then you will not be helped."
                },
                {
                    "title": "39:55 | Follow the heart",
                    "arabic": "وَٱتَّبِعُوٓاْ أَحۡسَنَ مَآ أُنزِلَ إِلَيۡكُم مِّن رَّبِّكُم مِّن قَبۡلِ أَن يَأۡتِيَكُمُ ٱلۡعَذَابُ بَغۡتَةٗ وَأَنتُمۡ لَا تَشۡعُرُونَ",
                    "transliteration": "WattabiAAoo ahsana ma onzila ilaykum min rabbikum min qabli an yatiyakumu alAAathabu baghtatan waantum la tashAAuroon",
                    "translation": "And follow the best of what was revealed to you from your Lord before the punishment comes upon you suddenly while you do not perceive,"
                },
                {
                    "title": "39:73 | Greetings for the people of Paradise",
                    "arabic": "وَسِيقَ ٱلَّذِينَ ٱتَّقَوۡاْ رَبَّهُمۡ إِلَى ٱلۡجَنَّةِ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَا سَلَٰمٌ عَلَيۡكُمۡ طِبۡتُمۡ فَٱدۡخُلُوهَا خَٰلِدِينَ",
                    "transliteration": "Waseeqa allatheena ittaqaw rabbahum ila aljannati zumaran hatta itha jaooha wafutihat abwabuha waqala lahum khazanatuha salamun AAalaykum tibtum fadkhulooha khalideen",
                    "translation": "But those who feared their Lord will be driven to Paradise in groups until, when they reach it while its gates have been opened and its keepers say, \"Peace be upon you; you have become pure; so enter it to abide eternally therein,\" [they will enter]."
                }
              ]
            },
            {
              "surah": "40. Ghafir",
              "posts": [
                {
                    "title": "40:3 | Attributes of Allah",
                    "arabic": "غَافِرِ ٱلذَّنۢبِ وَقَابِلِ ٱلتَّوۡبِ شَدِيدِ ٱلۡعِقَابِ ذِي ٱلطَّوۡلِۖ لَآ إِلَٰهَ إِلَّا هُوَۖ إِلَيۡهِ ٱلۡمَصِيرُ",
                    "transliteration": "Ghafiri aththanbi waqabili attawbi shadeedi alAAiqabi thee attawli la ilaha illa huwa ilayhi almaseer",
                    "translation": "The forgiver of sin, acceptor of repentance, severe in punishment, owner of abundance. There is no deity except Him; to Him is the destination."
                },
                {
                    "title": "40:19 | Knowledge of inner thoughts",
                    "arabic": "يَعۡلَمُ خَآئِنَةَ ٱلۡأَعۡيُنِ وَمَا تُخۡفِي ٱلصُّدُورُ",
                    "transliteration": "YaAAlamu khainata alaAAyuni wama tukhfee assudoor",
                    "translation": "He knows that which deceives the eyes and what the breasts conceal."
                },
                {
                    "title": "40:44 | Leave your affairs to Allah",
                    "arabic": "فَسَتَذۡكُرُونَ مَآ أَقُولُ لَكُمۡۚ وَأُفَوِّضُ أَمۡرِيٓ إِلَى ٱللَّهِۚ إِنَّ ٱللَّهَ بَصِيرُۢ بِٱلۡعِبَادِ",
                    "transliteration": "Fasatathkuroona ma aqoolu lakum waofawwidu amree ila Allahi inna Allaha baseerun bilAAibad",
                    "translation": "And you will remember what I [now] say to you, and I entrust my affair to Allah. Indeed, Allah is Seeing of [His] servants."
                },
                {
                    "title": "40:60 | Call upon Allah and he will respond to you",
                    "arabic": "وَقَالَ رَبُّكُمُ ٱدۡعُونِيٓ أَسۡتَجِبۡ لَكُمۡۚ إِنَّ ٱلَّذِينَ يَسۡتَكۡبِرُونَ عَنۡ عِبَادَتِي سَيَدۡخُلُونَ جَهَنَّمَ دَاخِرِينَ",
                    "transliteration": "Waqala rabbukumu odAAoonee astajib lakum inna allatheena yastakbiroona AAan AAibadatee sayadkhuloona jahannama dakhireen",
                    "translation": "And your Lord says, \"Call upon Me; I will respond to you.\" Indeed, those who disdain My worship will enter Hell [rendered] contemptible."
                },
                {
                    "title": "40:82 | Travel the earth and take heed from previous nations and civilisations",
                    "arabic": "أَفَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَيَنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَانُوٓاْ أَكۡثَرَ مِنۡهُمۡ وَأَشَدَّ قُوَّةٗ وَءَاثَارٗا فِي ٱلۡأَرۡضِ فَمَآ أَغۡنَىٰ عَنۡهُم مَّا كَانُواْ يَكۡسِبُونَ",
                    "transliteration": "Afalam yaseeroo fee alardi fayanthuroo kayfa kana AAaqibatu allatheena min qablihim kanoo akthara minhum waashadda quwwatan waatharan fee alardi fama aghna AAanhum ma kanoo yaksiboon",
                    "translation": "Have they not traveled through the land and observed how was the end of those before them? They were more numerous than themselves and greater in strength and in impression on the land, but they were not availed by what they used to earn."
                }
              ]
            },
            {
              "surah": "41. Fussilat",
              "posts": [
                {
                    "title": "41:3 | 'A book whos verses are explained in detail'",
                    "arabic": "كِتَٰبٞ فُصِّلَتۡ ءَايَٰتُهُۥ قُرۡءَانًا عَرَبِيّٗا لِّقَوۡمٖ يَعۡلَمُونَ",
                    "transliteration": "كِتَٰبٞ فُصِّلَتۡ ءَايَٰتُهُۥ قُرۡءَانًا عَرَبِيّٗا لِّقَوۡمٖ يَعۡلَمُونَ",
                    "translation": "A Book whose verses have been detailed, an Arabic Qur'an for a people who know,"
                },
                {
                    "title": "41:15 | 'Who is mightier than us in strength'",
                    "arabic": "فَأَمَّا عَادٞ فَٱسۡتَكۡبَرُواْ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَقَالُواْ مَنۡ أَشَدُّ مِنَّا قُوَّةًۖ أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَهُمۡ هُوَ أَشَدُّ مِنۡهُمۡ قُوَّةٗۖ وَكَانُواْ بِـَٔايَٰتِنَا يَجۡحَدُونَ",
                    "transliteration": "Faamma AAadun fastakbaroo fee alardi bighayri alhaqqi waqaloo man ashaddu minna quwwatan awalam yaraw anna Allaha allathee khalaqahum huwa ashaddu minhum quwwatan wakanoo biayatina yajhadoon",
                    "translation": "As for 'Aad, they were arrogant upon the earth without right and said, \"Who is greater than us in strength?\" Did they not consider that Allah who created them was greater than them in strength? But they were rejecting Our signs."
                },
                {
                    "title": "41:20 | Testimony of the body",
                    "arabic": "حَتَّىٰٓ إِذَا مَا جَآءُوهَا شَهِدَ عَلَيۡهِمۡ سَمۡعُهُمۡ وَأَبۡصَٰرُهُمۡ وَجُلُودُهُم بِمَا كَانُواْ يَعۡمَلُونَ",
                    "transliteration": "Hatta itha ma jaooha shahida AAalayhim samAAuhum waabsaruhum wajulooduhum bima kanoo yaAAmaloon",
                    "translation": "Until, when they reach it, their hearing and their eyes and their skins will testify against them of what they used to do."
                },
                {
                    "title": "41:21 | Questioning the body/skin",
                    "arabic": "وَقَالُواْ لِجُلُودِهِمۡ لِمَ شَهِدتُّمۡ عَلَيۡنَاۖ قَالُوٓاْ أَنطَقَنَا ٱللَّهُ ٱلَّذِيٓ أَنطَقَ كُلَّ شَيۡءٖۚ وَهُوَ خَلَقَكُمۡ أَوَّلَ مَرَّةٖ وَإِلَيۡهِ تُرۡجَعُونَ",
                    "transliteration": "Waqaloo lijuloodihim lima shahidtum AAalayna qaloo antaqana Allahu allathee antaqa kulla shayin wahuwa khalaqakum awwala marratin wailayhi turjaAAoon",
                    "translation": "And they will say to their skins, \"Why have you testified against us?\" They will say, \"We were made to speak by Allah, who has made everything speak; and He created you the first time, and to Him you are returned.\""
                },
                {
                    "title": "41:26 | Importance of listening",
                    "arabic": "وَقَالَ ٱلَّذِينَ كَفَرُواْ لَا تَسۡمَعُواْ لِهَٰذَا ٱلۡقُرۡءَانِ وَٱلۡغَوۡاْ فِيهِ لَعَلَّكُمۡ تَغۡلِبُونَ",
                    "transliteration": "Waqala allatheena kafaroo la tasmaAAoo lihatha alqurani walghaw feehi laAAallakum taghliboon",
                    "translation": "And those who disbelieve say, \"Do not listen to this Qur'an and speak noisily during [the recitation of] it that perhaps you will overcome.\""
                },
                {
                    "title": "41:33 | Best of speech",
                    "arabic": "وَمَنۡ أَحۡسَنُ قَوۡلٗا مِّمَّن دَعَآ إِلَى ٱللَّهِ وَعَمِلَ صَٰلِحٗا وَقَالَ إِنَّنِي مِنَ ٱلۡمُسۡلِمِينَ",
                    "transliteration": "Waman ahsanu qawlan mimman daAAa ila Allahi waAAamila salihan waqala innanee mina almuslimeen",
                    "translation": "And who is better in speech than one who invites to Allah and does righteousness and says, \"Indeed, I am of the Muslims.\""
                },
                {
                    "title": "41:36 | Dealing with the whispers of shaytan",
                    "arabic": "وَإِمَّا يَنزَغَنَّكَ مِنَ ٱلشَّيۡطَٰنِ نَزۡغٞ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ",
                    "transliteration": "Waimma yanzaghannaka mina ashshaytani nazghun fastaAAith billahi innahu huwa assameeAAu alAAaleem",
                    "translation": "And if there comes to you from Satan an evil suggestion, then seek refuge in Allah. Indeed, He is the Hearing, the Knowing."
                },
                {
                    "title": "41:40 | Freedom of action",
                    "arabic": "إِنَّ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ ءَايَٰتِنَا لَا يَخۡفَوۡنَ عَلَيۡنَآۗ أَفَمَن يُلۡقَىٰ فِي ٱلنَّارِ خَيۡرٌ أَم مَّن يَأۡتِيٓ ءَامِنٗا يَوۡمَ ٱلۡقِيَٰمَةِۚ ٱعۡمَلُواْ مَا شِئۡتُمۡ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِي",
                    "transliteration": "Inna allatheena yulhidoona fee ayatina la yakhfawna AAalayna afaman yulqa fee annari khayrun am man yatee aminan yawma alqiyamati iAAmaloo ma shitum innahu bima taAAmaloona baseer",
                    "translation": "Indeed, those who inject deviation into Our verses are not concealed from Us. So, is he who is cast into the Fire better or he who comes secure on the Day of Resurrection? Do whatever you will; indeed, He is Seeing of what you do."
                },
                {
                    "title": "41:42 | The Quran is protected",
                    "arabic": "ا يَأۡتِيهِ ٱلۡبَٰطِلُ مِنۢ بَيۡنِ يَدَيۡهِ وَلَا مِنۡ خَلۡفِهِۦۖ تَنزِيلٞ مِّنۡ حَكِيمٍ حَمِيدٖ",
                    "transliteration": "La yateehi albatilu min bayni yadayhi wala min khalfihi tanzeelun min hakeemin hameed",
                    "translation": "Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a [Lord who is] Wise and Praiseworthy."
                },
                {
                    "title": "41:49 | Human behaviour",
                    "arabic": "لَّا يَسۡـَٔمُ ٱلۡإِنسَٰنُ مِن دُعَآءِ ٱلۡخَيۡرِ وَإِن مَّسَّهُ ٱلشَّرُّ فَيَـُٔوسٞ قَنُوطٞ",
                    "transliteration": "La yasamu alinsanu min duAAai alkhayri wain massahu ashsharru fayaoosun qanoot",
                    "translation": "Man is not weary of supplication for good [things], but if evil touches him, he is hopeless and despairing."
                },
                {
                    "title": "41:51 | Seeking Allah in adversity",
                    "arabic": "وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ فَذُو دُعَآءٍ عَرِيضٖ",
                    "transliteration": "Waitha anAAamna AAala alinsani aAArada wanaa bijanibihi waitha massahu ashsharru fathoo duAAain AAareed",
                    "translation": "And when We bestow favor upon man, he turns away and distances himself; but when evil touches him, then he is full of extensive supplication."
                }
              ]
            },
            {
              "surah": "42. Ash-Shura",
              "posts": [
                {
                    "title": "42:10 | Judgement is with Allah",
                    "arabic": "وَمَا ٱخۡتَلَفۡتُمۡ فِيهِ مِن شَيۡءٖ فَحُكۡمُهُۥٓ إِلَى ٱللَّهِۚ ذَٰلِكُمُ ٱللَّهُ رَبِّي عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ أُنِيبُ",
                    "transliteration": "Wama ikhtalaftum feehi min shayin fahukmuhu ila Allahi thalikumu Allahu rabbee AAalayhi tawakkaltu wailayhi oneeb",
                    "translation": "And in anything over which you disagree - its ruling is [to be referred] to Allah. [Say], \"That is Allah, my Lord; upon Him I have relied, and to Him I turn back.\""
                },
                {
                    "title": "42:11 | 'There is nothing like Him'",
                    "arabic": "فَاطِرُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَمِنَ ٱلۡأَنۡعَٰمِ أَزۡوَٰجٗا يَذۡرَؤُكُمۡ فِيهِۚ لَيۡسَ كَمِثۡلِهِۦ شَيۡءٞۖ وَهُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ",
                    "transliteration": "Fatiru assamawati walardi jaAAala lakum min anfusikum azwajan wamina alanAAami azwajan yathraokum feehi laysa kamithlihi shayon wahuwa assameeAAu albaseer",
                    "translation": "[He is] Creator of the heavens and the earth. He has made for you from yourselves, mates, and among the cattle, mates; He multiplies you thereby. There is nothing like unto Him, and He is the Hearing, the Seeing."
                },
                {
                    "title": "42:19 | Allah is kind",
                    "arabic": "ٱللَّهُ لَطِيفُۢ بِعِبَادِهِۦ يَرۡزُقُ مَن يَشَآءُۖ وَهُوَ ٱلۡقَوِيُّ ٱلۡعَزِيزُ",
                    "transliteration": "Allahu lateefun biAAibadihi yarzuqu man yashao wahuwa alqawiyyu alAAazeez",
                    "translation": "Allah is Subtle with His servants; He gives provisions to whom He wills. And He is the Powerful, the Exalted in Might."
                },
                {
                    "title": "42:25 | Repentance and forgiveness",
                    "arabic": "وَهُوَ ٱلَّذِي يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَعۡفُواْ عَنِ ٱلسَّيِّـَٔاتِ وَيَعۡلَمُ مَا تَفۡعَلُونَ",
                    "transliteration": "Wahuwa allathee yaqbalu attawbata AAan AAibadihi wayaAAfoo AAani assayyiati wayaAAlamu ma tafAAaloon",
                    "translation": "And it is He who accepts repentance from his servants and pardons misdeeds, and He knows what you do."
                },
                {
                    "title": "42:51 | Three way that Allah communicates with humans",
                    "arabic": "وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ ٱللَّهُ إِلَّا وَحۡيًا أَوۡ مِن وَرَآيِٕ حِجَابٍ أَوۡ يُرۡسِلَ رَسُولٗا فَيُوحِيَ بِإِذۡنِهِۦ مَا يَشَآءُۚ إِنَّهُۥ عَلِيٌّ حَكِيمٞ",
                    "transliteration": "Wama kana libasharin an yukallimahu Allahu illa wahyan aw min warai hijabin aw yursila rasoolan fayoohiya biithnihi ma yashao innahu AAaliyyun hakeem",
                    "translation": "And it is not for any human being that Allah should speak to him except by revelation or from behind a partition or that He sends a messenger to reveal, by His permission, what He wills. Indeed, He is Most High and Wise."
                }
              ]
            },
            {
              "surah": "43. Az-Zukhruf",
              "posts": [
                {
                    "title": "43:32 | Mercy and preference",
                    "arabic": "أَهُمۡ يَقۡسِمُونَ رَحۡمَتَ رَبِّكَۚ نَحۡنُ قَسَمۡنَا بَيۡنَهُم مَّعِيشَتَهُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۚ وَرَفَعۡنَا بَعۡضَهُمۡ فَوۡقَ بَعۡضٖ دَرَجَٰتٖ لِّيَتَّخِذَ بَعۡضُهُم بَعۡضٗا سُخۡرِيّٗاۗ وَرَحۡمَتُ رَبِّكَ خَيۡرٞ مِّمَّا يَجۡمَعُونَ",
                    "transliteration": "Ahum yaqsimoona rahmata rabbika nahnu qasamna baynahum maAAeeshatahum fee alhayati addunya warafaAAna baAAdahum fawqa baAAdin darajatin liyattakhitha baAAduhum baAAdan sukhriyyan warahmatu rabbika khayrun mimma yajmaAAoon",
                    "translation": "Do they distribute the mercy of your Lord? It is We who have apportioned among them their livelihood in the life of this world and have raised some of them above others in degrees [of rank] that they may make use of one another for service. But the mercy of your Lord is better than whatever they accumulate."
                },
                {
                    "title": "43:36 | Satan as an intimate companian",
                    "arabic": "وَمَن يَعۡشُ عَن ذِكۡرِ ٱلرَّحۡمَٰنِ نُقَيِّضۡ لَهُۥ شَيۡطَٰنٗا فَهُوَ لَهُۥ قَرِينٞ",
                    "transliteration": "Waman yaAAshu AAan thikri arrahmani nuqayyid lahu shaytanan fahuwa lahu qareen",
                    "translation": "And whoever is blinded from remembrance of the Most Merciful - We appoint for him a devil, and he is to him a companion."
                },
                {
                    "title": "43:44 | Accountability",
                    "arabic": "وَإِنَّهُۥ لَذِكۡرٞ لَّكَ وَلِقَوۡمِكَۖ وَسَوۡفَ تُسۡـَٔلُونَ",
                    "transliteration": "Wainnahu lathikrun laka waliqawmika wasawfa tusaloon",
                    "translation": "And indeed, it is a remembrance for you and your people, and you [all] are going to be questioned."
                },
                {
                    "title": "43:51 | Arrogance of the Pharoah",
                    "arabic": "وَنَادَىٰ فِرۡعَوۡنُ فِي قَوۡمِهِۦ قَالَ يَٰقَوۡمِ أَلَيۡسَ لِي مُلۡكُ مِصۡرَ وَهَٰذِهِ ٱلۡأَنۡهَٰرُ تَجۡرِي مِن تَحۡتِيٓۚ أَفَلَا تُبۡصِرُونَ",
                    "transliteration": "Wanada firAAawnu fee qawmihi qala ya-qawmi alaysa lee mulku misra wahathihi alanharu tajree min tahtee afala tubsiroon",
                    "translation": "And Pharaoh called out among his people; he said, \"O my people, does not the kingdom of Egypt belong to me, and these rivers flowing beneath me; then do you not see?\""
                },
                {
                    "title": "43:56 | Historical precedent",
                    "arabic": "فَجَعَلۡنَٰهُمۡ سَلَفٗا وَمَثَلٗا لِّلۡأٓخِرِينَ",
                    "transliteration": "FajaAAalnahum salafan wamathalan lilakhireen",
                    "translation": "And We made them a precedent and an example for the later peoples."
                },
                {
                    "title": "43:61 | Isa is a sign of the coming Hour",
                    "arabic": "وَإِنَّهُۥ لَعِلۡمٞ لِّلسَّاعَةِ فَلَا تَمۡتَرُنَّ بِهَا وَٱتَّبِعُونِۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ",
                    "transliteration": "Wainnahu laAAilmun lissaAAati fala tamtarunna biha wattabiAAooni hatha siratun mustaqeem",
                    "translation": "And indeed, Jesus will be [a sign for] knowledge of the Hour, so be not in doubt of it, and follow Me. This is a straight path."
                },
                {
                    "title": "43:67 | Friends shall be enemies",
                    "arabic": "ٱلۡأَخِلَّآءُ يَوۡمَئِذِۭ بَعۡضُهُمۡ لِبَعۡضٍ عَدُوٌّ إِلَّا ٱلۡمُتَّقِينَ",
                    "transliteration": "Alakhillao yawmaithin baAAduhum libaAAdin AAaduwwun illa almuttaqeen",
                    "translation": "Close friends, that Day, will be enemies to each other, except for the righteous"
                },
                {
                    "title": "43:72 | Inheriting Paradise",
                    "arabic": "وَتِلۡكَ ٱلۡجَنَّةُ ٱلَّتِيٓ أُورِثۡتُمُوهَا بِمَا كُنتُمۡ تَعۡمَلُونَ",
                    "transliteration": "Watilka aljannatu allatee oorithtumooha bima kuntum taAAmaloon",
                    "translation": "And that is Paradise which you are made to inherit for what you used to do."
                },
                {
                    "title": "43:76 | People wrong themseleves",
                    "arabic": "وَمَا ظَلَمۡنَٰهُمۡ وَلَٰكِن كَانُواْ هُمُ ٱلظَّٰلِمِينَ",
                    "transliteration": "Wama thalamnahum walakin kanoo humu aththalimeen",
                    "translation": "And We did not wrong them, but it was they who were the wrongdoers."
                }
              ]
            },
            {
              "surah": "44. Ad-Dukhan",
              "posts": [
                {
                    "title": "44:3 | Quran was revealed on a blessed night",
                    "arabic": "إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةٖ مُّبَٰرَكَةٍۚ إِنَّا كُنَّا مُنذِرِينَ",
                    "transliteration": "Inna anzalnahu fee laylatin mubarakatin inna kunna munthireen",
                    "translation": "Indeed, We sent it down during a blessed night. Indeed, We were to warn [mankind]."
                },
                {
                    "title": "44:4 | Every affair of wisdom has been decreed",
                    "arabic": "فِيهَا يُفۡرَقُ كُلُّ أَمۡرٍ حَكِيمٍ",
                    "transliteration": "Feeha yufraqu kullu amrin hakeem",
                    "translation": "On that night is made distinct every precise matter -"
                },
                {
                    "title": "44:29 | The heavens and the earth did not weep",
                    "arabic": "فَمَا بَكَتۡ عَلَيۡهِمُ ٱلسَّمَآءُ وَٱلۡأَرۡضُ وَمَا كَانُواْ مُنظَرِينَ",
                    "transliteration": "Fama bakat AAalayhimu assamao walardu wama kanoo munthareen",
                    "translation": "And the heaven and earth wept not for them, nor were they reprieved."
                }
              ]
            },
            {
              "surah": "45. Al-Jathiyah",
              "posts": [
                {
                    "title": "45:8 | Consequence of arrogance",
                    "arabic": "يَسۡمَعُ ءَايَٰتِ ٱللَّهِ تُتۡلَىٰ عَلَيۡهِ ثُمَّ يُصِرُّ مُسۡتَكۡبِرٗا كَأَن لَّمۡ يَسۡمَعۡهَاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِيمٖ",
                    "transliteration": "YasmaAAu ayati Allahi tutla AAalayhi thumma yusirru mustakbiran kaan lam yasmaAAha fabashshirhu biAAathabin aleem",
                    "translation": "Who hears the verses of Allah recited to him, then persists arrogantly as if he had not heard them. So give him tidings of a painful punishment."
                },
                {
                    "title": "45:13 | People who reflect",
                    "arabic": "وَسَخَّرَ لَكُم مَّا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ جَمِيعٗا مِّنۡهُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ",
                    "transliteration": "Wasakhkhara lakum ma fee assamawati wama fee alardi jameeAAan minhu inna fee thalika laayatin liqawmin yatafakkaroon",
                    "translation": "And He has subjected to you whatever is in the heavens and whatever is on the earth - all from Him. Indeed in that are signs for a people who give thought."
                },
                {
                    "title": "45:23 | Ego as your god",
                    "arabic": "أَفَرَءَيۡتَ مَنِ ٱتَّخَذَ إِلَٰهَهُۥ هَوَىٰهُ وَأَضَلَّهُ ٱللَّهُ عَلَىٰ عِلۡمٖ وَخَتَمَ عَلَىٰ سَمۡعِهِۦ وَقَلۡبِهِۦ وَجَعَلَ عَلَىٰ بَصَرِهِۦ غِشَٰوَةٗ فَمَن يَهۡدِيهِ مِنۢ بَعۡدِ ٱللَّهِۚ أَفَلَا تَذَكَّرُونَ",
                    "transliteration": "Afaraayta mani ittakhatha ilahahu hawahu waadallahu Allahu AAala AAilmin wakhatama AAala samAAihi waqalbihi wajaAAala AAala basarihi ghishawatan faman yahdeehi min baAAdi Allahi afala tathakkaroon",
                    "translation": "Have you seen he who has taken as his god his [own] desire, and Allah has sent him astray due to knowledge and has set a seal upon his hearing and his heart and put over his vision a veil? So who will guide him after Allah? Then will you not be reminded?"
                }
              ]
            },
            {
              "surah": "46. Al-Ahqaf",
              "posts": [
                {
                    "title": "46:15 | Struggle of all mothers",
                    "arabic": "وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ إِحۡسَٰنًاۖ حَمَلَتۡهُ أُمُّهُۥ كُرۡهٗا وَوَضَعَتۡهُ كُرۡهٗاۖ وَحَمۡلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهۡرًاۚ حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرۡبَعِينَ سَنَةٗ قَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَصۡلِحۡ لِي فِي ذُرِّيَّتِيٓۖ إِنِّي تُبۡتُ إِلَيۡكَ وَإِنِّي مِنَ ٱلۡمُسۡلِمِينَ",
                    "transliteration": "Wawassayna alinsana biwalidayhi ihsanan hamalathu ommuhu kurhan wawadaAAathu kurhan wahamluhu wafisaluhu thalathoona shahran hatta itha balagha ashuddahu wabalagha arbaAAeena sanatan qala rabbi awziAAnee an ashkura niAAmataka allatee anAAamta AAalayya waAAala walidayya waan aAAmala salihan tardahu waaslih lee fee thurriyyatee innee tubtu ilayka wainnee mina almuslimeen",
                    "translation": "And We have enjoined upon man, to his parents, good treatment. His mother carried him with hardship and gave birth to him with hardship, and his gestation and weaning [period] is thirty months. [He grows] until, when he reaches maturity and reaches [the age of] forty years, he says, \"My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims.\""
                },
                {
                    "title": "46:35 | People of strong will",
                    "arabic": "فَٱصۡبِرۡ كَمَا صَبَرَ أُوْلُواْ ٱلۡعَزۡمِ مِنَ ٱلرُّسُلِ وَلَا تَسۡتَعۡجِل لَّهُمۡۚ كَأَنَّهُمۡ يَوۡمَ يَرَوۡنَ مَا يُوعَدُونَ لَمۡ يَلۡبَثُوٓاْ إِلَّا سَاعَةٗ مِّن نَّهَارِۭۚ بَلَٰغٞۚ فَهَلۡ يُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلۡفَٰسِقُونَ",
                    "transliteration": "Fasbir kama sabara oloo alAAazmi mina arrusuli wala tastaAAjil lahum kaannahum yawma yarawna ma yooAAadoona lam yalbathoo illa saAAatan min naharin balaghun fahal yuhlaku illa alqawmu alfasiqoon",
                    "translation": "So be patient, [O Muhammad], as were those of determination among the messengers and do not be impatient for them. It will be - on the Day they see that which they are promised - as though they had not remained [in the world] except an hour of a day. [This is] notification. And will [any] be destroyed except the defiantly disobedient people?"
                }
              ]
            },
            {
              "surah": "47. Muhammad",
              "posts": [
                {
                    "title": "47:2 | Expiation of sins",
                    "arabic": "وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَءَامَنُواْ بِمَا نُزِّلَ عَلَىٰ مُحَمَّدٖ وَهُوَ ٱلۡحَقُّ مِن رَّبِّهِمۡ كَفَّرَ عَنۡهُمۡ سَيِّـَٔاتِهِمۡ وَأَصۡلَحَ بَالَهُمۡ",
                    "transliteration": "Wallatheena amanoo waAAamiloo assalihati waamanoo bima nuzzila AAala muhammadin wahuwa alhaqqu min rabbihim kaffara AAanhum sayyiatihim waaslaha balahum",
                    "translation": "And those who believe and do righteous deeds and believe in what has been sent down upon Muhammad - and it is the truth from their Lord - He will remove from them their misdeeds and amend their condition."
                },
                {
                    "title": "47:15 | Four rivers of paradise",
                    "arabic": "مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ فِيهَآ أَنۡهَٰرٞ مِّن مَّآءٍ غَيۡرِ ءَاسِنٖ وَأَنۡهَٰرٞ مِّن لَّبَنٖ لَّمۡ يَتَغَيَّرۡ طَعۡمُهُۥ وَأَنۡهَٰرٞ مِّنۡ خَمۡرٖ لَّذَّةٖ لِّلشَّٰرِبِينَ وَأَنۡهَٰرٞ مِّنۡ عَسَلٖ مُّصَفّٗىۖ وَلَهُمۡ فِيهَا مِن كُلِّ ٱلثَّمَرَٰتِ وَمَغۡفِرَةٞ مِّن رَّبِّهِمۡۖ كَمَنۡ هُوَ خَٰلِدٞ فِي ٱلنَّارِ وَسُقُواْ مَآءً حَمِيمٗا فَقَطَّعَ أَمۡعَآءَهُمۡ",
                    "transliteration": "Mathalu aljannati allatee wuAAida almuttaqoona feeha anharun min main ghayri asinin waanharun min labanin lam yataghayyar taAAmuhu waanharun min khamrin laththatin lishsharibeena waanharun min AAasalin musaffan walahum feeha min kulli aththamarati wamaghfiratun min rabbihim kaman huwa khalidun fee annari wasuqoo maan hameeman faqattaAAa amAAaahum",
                    "translation": "Is the description of Paradise, which the righteous are promised, wherein are rivers of water unaltered, rivers of milk the taste of which never changes, rivers of wine delicious to those who drink, and rivers of purified honey, in which they will have from all [kinds of] fruits and forgiveness from their Lord, like [that of] those who abide eternally in the Fire and are given to drink scalding water that will sever their intestines?"
                },
                {
                    "title": "47:17 | Consequence of accepting guidance",
                    "arabic": "وَٱلَّذِينَ ٱهۡتَدَوۡاْ زَادَهُمۡ هُدٗى وَءَاتَىٰهُمۡ تَقۡوَىٰهُمۡ",
                    "transliteration": "Wallatheena ihtadaw zadahum hudan waatahum taqwahum",
                    "translation": "And those who are guided - He increases them in guidance and gives them their righteousness."
                },
                {
                    "title": "47:19 | Seeking forgiveness for the sins of others",
                    "arabic": "فَٱعۡلَمۡ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا ٱللَّهُ وَٱسۡتَغۡفِرۡ لِذَنۢبِكَ وَلِلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِۗ وَٱللَّهُ يَعۡلَمُ مُتَقَلَّبَكُمۡ وَمَثۡوَىٰكُمۡ",
                    "transliteration": "FaAAlam annahu la ilaha illa Allahu wastaghfir lithanbika walilmumineena walmuminati wallahu yaAAlamu mutaqallabakum wamathwakum",
                    "translation": "So know, [O Muhammad], that there is no deity except Allah and ask forgiveness for your sin and for the believing men and believing women. And Allah knows of your movement and your resting place."
                },
                {
                    "title": "47:24 | Locked hearts",
                    "arabic": "أَفَلَا يَتَدَبَّرُونَ ٱلۡقُرۡءَانَ أَمۡ عَلَىٰ قُلُوبٍ أَقۡفَالُهَآ",
                    "transliteration": "Afala yatadabbaroona alqurana am AAala quloobin aqfaluha",
                    "translation": "Then do they not reflect upon the Qur'an, or are there locks upon [their] hearts?"
                }
              ]
            },
            {
              "surah": "48. Al-Fath",
              "posts": [
                {
                    "title": "48:1 | Clear victory",
                    "arabic": "إِنَّا فَتَحۡنَا لَكَ فَتۡحٗا مُّبِينٗا",
                    "transliteration": "Inna fatahna laka fathan mubeena",
                    "translation": "Indeed, We have given you, [O Muhammad], a clear conquest"
                },
                {
                    "title": "48:18 | Allah is pleased with the believers",
                    "arabic": "لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِينَ إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا",
                    "transliteration": "Laqad radiya Allahu AAani almumineena ith yubayiAAoonaka tahta ashshajarati faAAalima ma fee quloobihim faanzala asakeenata AAalayhim waathabahum fathan qareeba",
                    "translation": "Certainly was Allah pleased with the believers when they pledged allegiance to you, [O Muhammad], under the tree, and He knew what was in their hearts, so He sent down tranquillity upon them and rewarded them with an imminent conquest"
                },
                {
                    "title": "48:28 | A religion that prevails",
                    "arabic": "هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦۚ وَكَفَىٰ بِٱللَّهِ شَهِيدٗا ",
                    "transliteration": "Huwa allathee arsala rasoolahu bilhuda wadeeni alhaqqi liyuthhirahu AAala addeeni kullihi wakafa billahi shaheeda",
                    "translation": "It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion. And sufficient is Allah as Witness."
                }
              ]
            },
            {
              "surah": "49. Al-Hujurat",
              "posts": [
                {
                    "title": "49:1 | Importance of adab (manners)",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ",
                    "transliteration": "Ya-ayyuha allatheena amanoo la tuqaddimoo bayna yadayi Allahi warasoolihi wattaqoo Allaha inna Allaha sameeAAun AAaleem",
                    "translation": "O you who have believed, do not put [yourselves] before Allah and His Messenger but fear Allah. Indeed, Allah is Hearing and Knowing."
                },
                {
                    "title": "49:2 | Consequences of lack of adab (manners) with the Prophet",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ",
                    "transliteration": "Ya-ayyuha allatheena amanoo la tarfaAAoo aswatakum fawqa sawti annabiyyi wala tajharoo lahu bilqawli kajahri baAAdikum libaAAdin an tahbata aAAmalukum waantum la tashAAuroon",
                    "translation": "O you who have believed, do not raise your voices above the voice of the Prophet or be loud to him in speech like the loudness of some of you to others, lest your deeds become worthless while you perceive not."
                },
                {
                    "title": "49:11 | Adab (manners) of social engagement",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ",
                    "transliteration": "Ya-ayyuha allatheena amanoo la yaskhar qawmun min qawmin AAasa an yakoonoo khayran minhum wala nisaon min nisain AAasa an yakunna khayran minhunna wala talmizoo anfusakum wala tanabazoo bilalqabi bisa alismu alfusooqu baAAda aleemani waman lam yatub faolaika humu aththalimoon",
                    "translation": "O you who have believed, let not a people ridicule [another] people; perhaps they may be better than them; nor let women ridicule [other] women; perhaps they may be better than them. And do not insult one another and do not call each other by [offensive] nicknames. Wretched is the name of disobedience after [one's] faith. And whoever does not repent - then it is those who are the wrongdoers."
                },
                {
                    "title": "49:12 | Against suspicion and backbiting",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجۡتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمٞۖ وَلَا تَجَسَّسُواْ وَلَا يَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأۡكُلَ لَحۡمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ",
                    "transliteration": "Ya-ayyuha allatheena amanoo ijtaniboo katheeran mina aththanni inna baAAda aththanni ithmun wala tajassasoo wala yaghtab baAAdukum baAAdan ayuhibbu ahadukum an yakula lahma akheehi maytan fakarihtumoohu wattaqoo Allaha inna Allaha tawwabun raheem",
                    "translation": "O you who have believed, avoid much [negative] assumption. Indeed, some assumption is sin. And do not spy or backbite each other. Would one of you like to eat the flesh of his brother when dead? You would detest it. And fear Allah; indeed, Allah is Accepting of repentance and Merciful."
                },
                {
                    "title": "49:14 | Islam verses iman",
                    "arabic": "قَالَتِ ٱلۡأَعۡرَابُ ءَامَنَّاۖ قُل لَّمۡ تُؤۡمِنُواْ وَلَٰكِن قُولُوٓاْ أَسۡلَمۡنَا وَلَمَّا يَدۡخُلِ ٱلۡإِيمَٰنُ فِي قُلُوبِكُمۡۖ وَإِن تُطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ لَا يَلِتۡكُم مِّنۡ أَعۡمَٰلِكُمۡ شَيۡـًٔاۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ",
                    "transliteration": "Qalati alaAArabu amanna qul lam tuminoo walakin qooloo aslamna walamma yadkhuli aleemanu fee quloobikum wain tuteeAAoo Allaha warasoolahu la yalitkum min aAAmalikum shayan inna Allaha ghafoorun raheem",
                    "translation": "The bedouins say, \"We have believed.\" Say, \"You have not [yet] believed; but say [instead], 'We have submitted,' for faith has not yet entered your hearts. And if you obey Allah and His Messenger, He will not deprive you from your deeds of anything. Indeed, Allah is Forgiving and Merciful.\""
                }
              ]
            },
            {
              "surah": "50. Qaf",
              "posts": [
                {
                    "title": "50:6 | The creation of the sky",
                    "arabic": "أَفَلَمۡ يَنظُرُوٓاْ إِلَى ٱلسَّمَآءِ فَوۡقَهُمۡ كَيۡفَ بَنَيۡنَٰهَا وَزَيَّنَّٰهَا وَمَا لَهَا مِن فُرُوجٖ",
                    "transliteration": "Afalam yanthuroo ila assamai fawqahum kayfa banaynaha wazayyannaha wama laha min furooj",
                    "translation": "Have they not looked at the heaven above them - how We structured it and adorned it and [how] it has no rifts?"
                },
                {
                    "title": "50:9 | Water is blessed",
                    "arabic": "وَنَزَّلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ مُّبَٰرَكٗا فَأَنۢبَتۡنَا بِهِۦ جَنَّٰتٖ وَحَبَّ ٱلۡحَصِيدِ",
                    "transliteration": "Wanazzalna mina assamai maan mubarakan faanbatna bihi jannatin wahabba alhaseed",
                    "translation": "And We have sent down blessed rain from the sky and made grow thereby gardens and grain from the harvest"
                },
                {
                    "title": "50:11 | Dates as provision",
                    "arabic": "رِّزۡقٗا لِّلۡعِبَادِۖ وَأَحۡيَيۡنَا بِهِۦ بَلۡدَةٗ مَّيۡتٗاۚ كَذَٰلِكَ ٱلۡخُرُوجُ",
                    "transliteration": "Rizqan lilAAibadi waahyayna bihi baldatan maytan kathalika alkhurooj",
                    "translation": "As provision for the servants, and We have given life thereby to a dead land. Thus is the resurrection."
                },
                {
                    "title": "50:16 | Allah is closer to man than his jugular vein",
                    "arabic": "وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ وَنَعۡلَمُ مَا تُوَسۡوِسُ بِهِۦ نَفۡسُهُۥۖ وَنَحۡنُ أَقۡرَبُ إِلَيۡهِ مِنۡ حَبۡلِ ٱلۡوَرِيدِ",
                    "transliteration": "Walaqad khalaqna alinsana wanaAAlamu ma tuwaswisu bihi nafsuhu wanahnu aqrabu ilayhi min habli alwareed",
                    "translation": "And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein"
                },
                {
                    "title": "50:25 | Three negative qualities",
                    "arabic": "مَّنَّاعٖ لِّلۡخَيۡرِ مُعۡتَدٖ مُّرِيبٍ",
                    "transliteration": "MannaAAin lilkhayri muAAtadin mureeb",
                    "translation": "Preventer of good, aggressor, and doubter,"
                },
                {
                    "title": "50:33 | Characteristics of the people of Paradise",
                    "arabic": "مَّنۡ خَشِيَ ٱلرَّحۡمَٰنَ بِٱلۡغَيۡبِ وَجَآءَ بِقَلۡبٖ مُّنِيبٍ",
                    "transliteration": "Man khashiya arrahmana bilghaybi wajaa biqalbin muneeb",
                    "translation": "Who feared the Most Merciful unseen and came with a heart returning [in repentance]."
                },
                {
                    "title": "50:35 | Longing to have more in Paradise",
                    "arabic": "لَهُم مَّا يَشَآءُونَ فِيهَا وَلَدَيۡنَا مَزِيدٞ",
                    "transliteration": "Lahum ma yashaoona feeha waladayna mazeed",
                    "translation": "They will have whatever they wish therein, and with Us is more."
                }
              ]
            },
            {
          "surah": "51. Adh-Dhariyat",
          "posts": [
            {
                "title": "51:55 | Reminders benefit people",
                "arabic": "وَذَكِّرۡ فَإِنَّ ٱلذِّكۡرَىٰ تَنفَعُ ٱلۡمُؤۡمِنِينَ",
                "transliteration": "Wathakkir fainna aththikra tanfaAAu almumineen",
                "translation": "And remind, for indeed, the reminder benefits the believers."
            },
            {
                "title": "51:56 | Purpose of creation",
                "arabic": "وَمَا خَلَقۡتُ ٱلۡجِنَّ وَٱلۡإِنسَ إِلَّا لِيَعۡبُدُونِ",
                "transliteration": "Wama khalaqtu aljinna walinsa illa liyaAAbudoon",
                "translation": "And I did not create the jinn and mankind except to worship Me."
            }
          ]
        },
        {
              "surah": "52. At-Tur",
              "posts": [
                {
                    "title": "52:19 | Result of good deeds",
                    "arabic": "كُلُواْ وَٱشۡرَبُواْ هَنِيٓـَٔۢا بِمَا كُنتُمۡ تَعۡمَلُونَ",
                    "transliteration": "Kuloo washraboo haneean bima kuntum taAAmaloon",
                    "translation": "They will be told], \"Eat and drink in satisfaction for what you used to do.\""
                },
                {
                    "title": "52:21 | Reunion of families in the hereafter",
                    "arabic": "وَٱلَّذِينَ ءَامَنُواْ وَٱتَّبَعَتۡهُمۡ ذُرِّيَّتُهُم بِإِيمَٰنٍ أَلۡحَقۡنَا بِهِمۡ ذُرِّيَّتَهُمۡ وَمَآ أَلَتۡنَٰهُم مِّنۡ عَمَلِهِم مِّن شَيۡءٖۚ كُلُّ ٱمۡرِيِٕۭ بِمَا كَسَبَ رَهِينٞ",
                    "transliteration": "Wallatheena amanoo wattabaAAathum thurriyyatuhum bieemanin alhaqna bihim thurriyyatahum wama alatnahum min AAamalihim min shayin kullu imriin bima kasaba raheen",
                    "translation": "And those who believed and whose descendants followed them in faith - We will join with them their descendants, and We will not deprive them of anything of their deeds. Every person, for what he earned, is retained."
                },
                {
                    "title": "52:48 | Praising Allah after getting up from sleep",
                    "arabic": "وَٱصۡبِرۡ لِحُكۡمِ رَبِّكَ فَإِنَّكَ بِأَعۡيُنِنَاۖ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ حِينَ تَقُومُ",
                    "transliteration": "Wasbir lihukmi rabbika fainnaka biaAAyunina wasabbih bihamdi rabbika heena taqoom",
                    "translation": "And be patient, [O Muhammad], for the decision of your Lord, for indeed, you are in Our eyes. And exalt [Allah] with praise of your Lord when you arise."
                }
              ]
            },
            {
              "surah": "53. An-Najm",
              "posts": [
                {
                    "title": "53:32 | Don't vouch for yourselves",
                    "arabic": "ٱلَّذِينَ يَجۡتَنِبُونَ كَبَٰٓئِرَ ٱلۡإِثۡمِ وَٱلۡفَوَٰحِشَ إِلَّا ٱللَّمَمَۚ إِنَّ رَبَّكَ وَٰسِعُ ٱلۡمَغۡفِرَةِۚ هُوَ أَعۡلَمُ بِكُمۡ إِذۡ أَنشَأَكُم مِّنَ ٱلۡأَرۡضِ وَإِذۡ أَنتُمۡ أَجِنَّةٞ فِي بُطُونِ أُمَّهَٰتِكُمۡۖ فَلَا تُزَكُّوٓاْ أَنفُسَكُمۡۖ هُوَ أَعۡلَمُ بِمَنِ ٱتَّقَىٰٓ",
                    "transliteration": "Allatheena yajtaniboona kabaira alithmi walfawahisha illa allamama inna rabbaka wasiAAu almaghfirati huwa aAAlamu bikum ith anshaakum mina alardi waith antum ajinnatun fee butooni ommahatikum fala tuzakkoo anfusakum huwa aAAlamu bimani ittaqa",
                    "translation": "Those who avoid the major sins and immoralities, only [committing] slight ones. Indeed, your Lord is vast in forgiveness. He was most knowing of you when He produced you from the earth and when you were fetuses in the wombs of your mothers. So do not claim yourselves to be pure; He is most knowing of who fears Him."
                },
                {
                    "title": "53:43 | Laughter and weeping",
                    "arabic": "وَأَنَّهُۥ هُوَ أَضۡحَكَ وَأَبۡكَىٰ ",
                    "transliteration": "Waannahu huwa adhaka waabka",
                    "translation": "And that it is He who makes [one] laugh and weep"
                }
              ]
            },
            {
              "surah": "54. Al-Qamar",
              "posts": [
                {
                    "title": "54:1 | Splitting of the moon",
                    "arabic": "ٱقۡتَرَبَتِ ٱلسَّاعَةُ وَٱنشَقَّ ٱلۡقَمَرُ",
                    "transliteration": "Iqtarabati assaAAatu wanshaqqa alqamar",
                    "translation": "The Hour has come near, and the moon has split [in two]."
                },
                {
                    "title": "54:17 | The Quran has been made easy",
                    "arabic": "وَلَقَدۡ يَسَّرۡنَا ٱلۡقُرۡءَانَ لِلذِّكۡرِ فَهَلۡ مِن مُّدَّكِرٖ",
                    "transliteration": "Walaqad yassarna alqurana liththikri fahal min muddakir",
                    "translation": "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?"
                }
              ]
            },
            {
              "surah": "55. Ar-Rahman",
              "posts": [
                {
                    "title": "55:6 | The creation also prostrates to Allah",
                    "arabic": "وَٱلنَّجۡمُ وَٱلشَّجَرُ يَسۡجُدَانِ",
                    "transliteration": "Wannajmu washshajaru yasjudan",
                    "translation": "And the stars and trees prostrate."
                },
                {
                    "title": "55:19 Where the two seas meet",
                    "arabic": "مَرَجَ ٱلۡبَحۡرَيۡنِ يَلۡتَقِيَانِ ",
                    "transliteration": "Maraja albahrayni yaltaqiyan",
                    "translation": "He released the two seas, meeting [side by side];"
                }
              ]
            },
            {
              "surah": "56. Al-Waqia",
              "posts": [
                {
                    "title": "56:57 | Why do you not believe?",
                    "arabic": "نَحۡنُ خَلَقۡنَٰكُمۡ فَلَوۡلَا تُصَدِّقُونَ",
                    "transliteration": "Nahnu khalaqnakum falawla tusaddiqoon",
                    "translation": "We have created you, so why do you not believe?"
                }
              ]
            },
            {
              "surah": "57. Al-Hadid",
              "posts": [
                {
                    "title": "57:3 | Names of Allah",
                    "arabic": "هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ",
                    "transliteration": "Huwa alawwalu walakhiru waththahiru walbatinu wahuwa bikulli shayin AAaleem",
                    "translation": "He is the First and the Last, the Ascendant and the Intimate, and He is, of all things, Knowing."
                },
                {
                    "title": "57:9 | From darkness to light",
                    "arabic": "هُوَ ٱلَّذِي يُنَزِّلُ عَلَىٰ عَبۡدِهِۦٓ ءَايَٰتِۭ بَيِّنَٰتٖ لِّيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَإِنَّ ٱللَّهَ بِكُمۡ لَرَءُوفٞ رَّحِيمٞ",
                    "transliteration": "Huwa allathee yunazzilu AAala AAabdihi ayatin bayyinatin liyukhrijakum mina aththulumati ila annoori wainna Allaha bikum laraoofun raheem",
                    "translation": "It is He who sends down upon His Servant [Muhammad] verses of clear evidence that He may bring you out from darknesses into the light. And indeed, Allah is to you Kind and Merciful."
                },
                {
                    "title": "57:16 | Humbled by remembrance",
                    "arabic": "أَلَمۡ يَأۡنِ لِلَّذِينَ ءَامَنُوٓاْ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ وَلَا يَكُونُواْ كَٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلُ فَطَالَ عَلَيۡهِمُ ٱلۡأَمَدُ فَقَسَتۡ قُلُوبُهُمۡۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ",
                    "transliteration": "Alam yani lillatheena amanoo an takhshaAAa quloobuhum lithikri Allahi wama nazala mina alhaqqi wala yakoonoo kallatheena ootoo alkitaba min qablu fatala AAalayhimu alamadu faqasat quloobuhum wakatheerun minhum fasiqoon",
                    "translation": "Has the time not come for those who have believed that their hearts should become humbly submissive at the remembrance of Allah and what has come down of the truth? And let them not be like those who were given the Scripture before, and a long period passed over them, so their hearts hardened; and many of them are defiantly disobedient."
                },
                {
                    "title": "57:20 | The world is only a deceptive enjoyment",
                    "arabic": "ٱعۡلَمُوٓاْ أَنَّمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا لَعِبٞ وَلَهۡوٞ وَزِينَةٞ وَتَفَاخُرُۢ بَيۡنَكُمۡ وَتَكَاثُرٞ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِۖ كَمَثَلِ غَيۡثٍ أَعۡجَبَ ٱلۡكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَكُونُ حُطَٰمٗاۖ وَفِي ٱلۡأٓخِرَةِ عَذَابٞ شَدِيدٞ وَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرِضۡوَٰنٞۚ وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ",
                    "transliteration": "",
                    "translation": ""
                },
                {
                    "title": "57:25 | Benefits of iron",
                    "arabic": " وَأَنزَلۡنَا ٱلۡحَدِيدَ فِيهِ بَأۡسٞ شَدِيدٞ وَمَنَٰفِعُ لِلنَّاسِ وَلِيَعۡلَمَ ٱللَّهُ مَن يَنصُرُهُۥ وَرُسُلَهُۥ بِٱلۡغَيۡبِۚ إِنَّ ٱللَّهَ قَوِيٌّ عَزِيزٞ...",
                    "transliteration": "waanzalna alhadeeda feehi basun shadeedun wamanafiAAu linnasi waliyaAAlama Allahu man yansuruhu warusulahu bilghaybi inna Allaha qawiyyun AAazeez",
                    "translation": "...And We sent down iron, wherein is great military might and benefits for the people, and so that Allah may make evident those who support Him and His messengers unseen. Indeed, Allah is Powerful and Exalted in Might."
                }
              ]
            },
            {
              "surah": "58. Al-Mujadila",
              "posts": [
                {
                    "title": "58:6 | Allah has kept account of everything",
                    "arabic": "يَوۡمَ يَبۡعَثُهُمُ ٱللَّهُ جَمِيعٗا فَيُنَبِّئُهُم بِمَا عَمِلُوٓاْۚ أَحۡصَىٰهُ ٱللَّهُ وَنَسُوهُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ",
                    "transliteration": "Yawma yabAAathuhumu Allahu jameeAAan fayunabbiohum bima AAamiloo ahsahu Allahu wanasoohu wallahu AAala kulli shayin shaheed",
                    "translation": "On the Day when Allah will resurrect them all and inform them of what they did. Allah had enumerated it, while they forgot it; and Allah is, over all things, Witness."
                },
                {
                    "title": "58:19 | The party of Satan",
                    "arabic": "ٱسۡتَحۡوَذَ عَلَيۡهِمُ ٱلشَّيۡطَٰنُ فَأَنسَىٰهُمۡ ذِكۡرَ ٱللَّهِۚ أُوْلَٰٓئِكَ حِزۡبُ ٱلشَّيۡطَٰنِۚ أَلَآ إِنَّ حِزۡبَ ٱلشَّيۡطَٰنِ هُمُ ٱلۡخَٰسِرُونَ",
                    "transliteration": "Istahwatha AAalayhimu ashshaytanu faansahum thikra Allahi olaika hizbu ashshaytani ala inna hizba ashshaytani humu alkhasiroon",
                    "translation": "Satan has overcome them and made them forget the remembrance of Allah. Those are the party of Satan. Unquestionably, the party of Satan - they will be the losers."
                }
              ]
            },
            {
              "surah": "59. Al-Hashr",
              "posts": [
                {
                    "title": "59:9 | Value of sacrifice",
                    "arabic": "وَٱلَّذِينَ تَبَوَّءُو ٱلدَّارَ وَٱلۡإِيمَٰنَ مِن قَبۡلِهِمۡ يُحِبُّونَ مَنۡ هَاجَرَ إِلَيۡهِمۡ وَلَا يَجِدُونَ فِي صُدُورِهِمۡ حَاجَةٗ مِّمَّآ أُوتُواْ وَيُؤۡثِرُونَ عَلَىٰٓ أَنفُسِهِمۡ وَلَوۡ كَانَ بِهِمۡ خَصَاصَةٞۚ وَمَن يُوقَ شُحَّ نَفۡسِهِۦ فَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ",
                    "transliteration": "Wallatheena tabawwaoo addara waleemana min qablihim yuhibboona man hajara ilayhim wala yajidoona fee sudoorihim hajatan mimma ootoo wayuthiroona AAala anfusihim walaw kana bihim khasasatun waman yooqa shuhha nafsihi faolaika humu almuflihoon",
                    "translation": "And [also for] those who were settled in al-Madinah and [adopted] the faith before them. They love those who emigrated to them and find not any want in their breasts of what the emigrants were given but give [them] preference over themselves, even though they are in privation. And whoever is protected from the stinginess of his soul - it is those who will be the successful."
                },
                {
                    "title": "59:16 | Hypocrites act treacherously",
                    "arabic": "كَمَثَلِ ٱلشَّيۡطَٰنِ إِذۡ قَالَ لِلۡإِنسَٰنِ ٱكۡفُرۡ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيٓءٞ مِّنكَ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ",
                    "transliteration": "Kamathali ashshaytani ith qala lilinsani okfur falamma kafara qala innee bareeon minka innee akhafu Allaha rabba alAAalameen",
                    "translation": "[The hypocrites are] like the example of Satan when he says to man, \"Disbelieve.\" But when he disbelieves, he says, \"Indeed, I am disassociated from you. Indeed, I fear Allah, Lord of the worlds.\""
                },
                {
                    "title": "59:19 | Do not forget Allah",
                    "arabic": "وَلَا تَكُونُواْ كَٱلَّذِينَ نَسُواْ ٱللَّهَ فَأَنسَىٰهُمۡ أَنفُسَهُمۡۚ أُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ",
                    "transliteration": "Wala takoonoo kallatheena nasoo Allaha faansahum anfusahum olaika humu alfasiqoon",
                    "translation": "And be not like those who forgot Allah, so He made them forget themselves. Those are the defiantly disobedient."
                },
                {
                    "title": "59:21 | Power of the Quran",
                    "arabic": "لَوۡ أَنزَلۡنَا هَٰذَا ٱلۡقُرۡءَانَ عَلَىٰ جَبَلٖ لَّرَأَيۡتَهُۥ خَٰشِعٗا مُّتَصَدِّعٗا مِّنۡ خَشۡيَةِ ٱللَّهِۚ وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِ لَعَلَّهُمۡ يَتَفَكَّرُونَ",
                    "transliteration": "Law anzalna hatha alqurana AAala jabalin laraaytahu khashiAAan mutasaddiAAan min khashyati Allahi watilka alamthalu nadribuha linnasi laAAallahum yatafakkaroon",
                    "translation": "If We had sent down this Qur'an upon a mountain, you would have seen it humbled and coming apart from fear of Allah. And these examples We present to the people that perhaps they will give thought."
                }
              ]
            },
            {
              "surah": "60. Al-Mumtahina",
              "posts": [
                {
                    "title": "60:3 | Relatives and children on the Day of Judgment",
                    "arabic": "لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ",
                    "transliteration": "Lan tanfaAAakum arhamukum wala awladukum yawma alqiyamati yafsilu baynakum wallahu bima taAAmaloona baseer",
                    "translation": "Never will your relatives or your children benefit you; the Day of Resurrection He will judge between you. And Allah, of what you do, is Seeing."
                },
                {
                    "title": "60:8 | Act justly",
                    "arabic": "لَّا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمۡ يُقَٰتِلُوكُمۡ فِي ٱلدِّينِ وَلَمۡ يُخۡرِجُوكُم مِّن دِيَٰرِكُمۡ أَن تَبَرُّوهُمۡ وَتُقۡسِطُوٓاْ إِلَيۡهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ",
                    "transliteration": "La yanhakumu Allahu AAani allatheena lam yuqatilookum fee addeeni walam yukhrijookum min diyarikum an tabarroohum watuqsitoo ilayhim inna Allaha yuhibbu almuqsiteen",
                    "translation": "Allah does not forbid you from those who do not fight you because of religion and do not expel you from your homes - from being righteous toward them and acting justly toward them. Indeed, Allah loves those who act justly."
                }
              ]
            },
            {
              "surah": "61. As-Saff",
              "posts": [
                {
                    "title": "61:4 | Discipline in action",
                    "arabic": "إِنَّ ٱللَّهَ يُحِبُّ ٱلَّذِينَ يُقَٰتِلُونَ فِي سَبِيلِهِۦ صَفّٗا كَأَنَّهُم بُنۡيَٰنٞ مَّرۡصُوصٞ",
                    "transliteration": "Inna Allaha yuhibbu allatheena yuqatiloona fee sabeelihi saffan kaannahum bunyanun marsoos",
                    "translation": "Indeed, Allah loves those who fight in His cause in a row as though they are a [single] structure joined firmly."
                },
                {
                    "title": "61:8 | Allah is The Protector",
                    "arabic": "يُرِيدُونَ لِيُطۡفِـُٔواْ نُورَ ٱللَّهِ بِأَفۡوَٰهِهِمۡ وَٱللَّهُ مُتِمُّ نُورِهِۦ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ",
                    "transliteration": "Yureedoona liyutfioo noora Allahi biafwahihim wallahu mutimmu noorihi walaw kariha alkafiroon",
                    "translation": "They want to extinguish the light of Allah with their mouths, but Allah will perfect His light, although the disbelievers dislike it."
                }
              ]
            },
            {
              "surah": "62. Al-Jumua",
              "posts": [
                {
                    "title": "62:5 | Metaphor of a donkey",
                    "arabic": "مَثَلُ ٱلَّذِينَ حُمِّلُواْ ٱلتَّوۡرَىٰةَ ثُمَّ لَمۡ يَحۡمِلُوهَا كَمَثَلِ ٱلۡحِمَارِ يَحۡمِلُ أَسۡفَارَۢاۚ بِئۡسَ مَثَلُ ٱلۡقَوۡمِ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِ ٱللَّهِۚ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ",
                    "transliteration": "Mathalu allatheena hummiloo attawrata thumma lam yahmilooha kamathali alhimari yahmilu asfaran bisa mathalu alqawmi allatheena kaththaboo biayati Allahi wallahu la yahdee alqawma aththalimeen",
                    "translation": "The example of those who were entrusted with the Torah and then did not take it on is like that of a donkey who carries volumes [of books]. Wretched is the example of the people who deny the signs of Allah. And Allah does not guide the wrongdoing people."
                },
                {
                    "title": "62:9 | Obligation of Friday prayers",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نُودِيَ لِلصَّلَوٰةِ مِن يَوۡمِ ٱلۡجُمُعَةِ فَٱسۡعَوۡاْ إِلَىٰ ذِكۡرِ ٱللَّهِ وَذَرُواْ ٱلۡبَيۡعَۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ",
                    "transliteration": "Ya-ayyuha allatheena amanoo itha noodiya lissalati min yawmi aljumuAAati fasAAaw ila thikri Allahi watharoo albayAAa thalikum khayrun lakum in kuntum taAAlamoon",
                    "translation": "O you who have believed, when [the adhan] is called for the prayer on the day of Jumu'ah [Friday], then proceed to the remembrance of Allah and leave trade. That is better for you, if you only knew."
                }
              ]
            },
            {
              "surah": "63. Al-Munafiqun",
              "posts": [
                {
                    "title": "63:1 | Hypocrites are liars",
                    "arabic": "إِذَا جَآءَكَ ٱلۡمُنَٰفِقُونَ قَالُواْ نَشۡهَدُ إِنَّكَ لَرَسُولُ ٱللَّهِۗ وَٱللَّهُ يَعۡلَمُ إِنَّكَ لَرَسُولُهُۥ وَٱللَّهُ يَشۡهَدُ إِنَّ ٱلۡمُنَٰفِقِينَ لَكَٰذِبُونَ",
                    "transliteration": "Itha jaaka almunafiqoona qaloo nashhadu innaka larasoolu Allahi wallahu yaAAlamu innaka larasooluhu wallahu yashhadu inna almunafiqeena lakathiboon",
                    "translation": "When the hypocrites come to you, [O Muhammad], they say, \"We testify that you are the Messenger of Allah.\" And Allah knows that you are His Messenger, and Allah testifies that the hypocrites are liars."
                },
                {
                    "title": "63:4 | They appear nice and speak attractively",
                    "arabic": "وَإِذَا رَأَيۡتَهُمۡ تُعۡجِبُكَ أَجۡسَامُهُمۡۖ وَإِن يَقُولُواْ تَسۡمَعۡ لِقَوۡلِهِمۡۖ كَأَنَّهُمۡ خُشُبٞ مُّسَنَّدَةٞۖ يَحۡسَبُونَ كُلَّ صَيۡحَةٍ عَلَيۡهِمۡۚ هُمُ ٱلۡعَدُوُّ فَٱحۡذَرۡهُمۡۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ",
                    "transliteration": "Waitha raaytahum tuAAjibuka ajsamuhum wain yaqooloo tasmaAA liqawlihim kaannahum khushubun musannadatun yahsaboona kulla sayhatin AAalayhim humu alAAaduwwu fahtharhum qatalahumu Allahu anna yufakoon",
                    "translation": "And when you see them, their forms please you, and if they speak, you listen to their speech. [They are] as if they were pieces of wood propped up - they think that every shout is against them. They are the enemy, so beware of them. May Allah destroy them; how are they deluded?"
                },
                {
                    "title": "63:9 | Distraction of wealth and children",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُلۡهِكُمۡ أَمۡوَٰلُكُمۡ وَلَآ أَوۡلَٰدُكُمۡ عَن ذِكۡرِ ٱللَّهِۚ وَمَن يَفۡعَلۡ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ",
                    "transliteration": "Ya-ayyuha allatheena amanoo la tulhikum amwalukum wala awladukum AAan thikri Allahi waman yafAAal thalika faolaika humu alkhasiroon",
                    "translation": "O you who have believed, let not your wealth and your children divert you from remembrance of Allah. And whoever does that - then those are the losers."
                }
              ]
            },
            {
              "surah": "64. At-Taghabun",
              "posts": [
                {
                    "title": "64:3 | Allah perfecting our creation",
                    "arabic": "خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّ وَصَوَّرَكُمۡ فَأَحۡسَنَ صُوَرَكُمۡۖ وَإِلَيۡهِ ٱلۡمَصِيرُ",
                    "transliteration": "Khalaqa assamawati walarda bilhaqqi wasawwarakum faahsana suwarakum wailayhi almaseer",
                    "translation": "He created the heavens and earth in truth and formed you and perfected your forms; and to Him is the [final] destination."
                },
                {
                    "title": "64:14 | Beware of your spouses and children",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّ مِنۡ أَزۡوَٰجِكُمۡ وَأَوۡلَٰدِكُمۡ عَدُوّٗا لَّكُمۡ فَٱحۡذَرُوهُمۡۚ وَإِن تَعۡفُواْ وَتَصۡفَحُواْ وَتَغۡفِرُواْ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ",
                    "transliteration": "Ya-ayyuha allatheena amanoo inna min azwajikum waawladikum AAaduwwan lakum fahtharoohum wain taAAfoo watasfahoo wataghfiroo fainna Allaha ghafoorun raheem",
                    "translation": "O you who have believed, indeed, among your wives and your children are enemies to you, so beware of them. But if you pardon and overlook and forgive - then indeed, Allah is Forgiving and Merciful."
                },
                {
                    "title": "64:15 | Wealth and children are a trail",
                    "arabic": "إِنَّمَآ أَمۡوَٰلُكُمۡ وَأَوۡلَٰدُكُمۡ فِتۡنَةٞۚ وَٱللَّهُ عِندَهُۥٓ أَجۡرٌ عَظِيمٞ",
                    "transliteration": "Innama amwalukum waawladukum fitnatun wallahu AAindahu ajrun AAatheem",
                    "translation": "Your wealth and your children are but a trial, and Allah has with Him a great reward."
                }
              ]
            },
            {
              "surah": "65. At-Talaq",
              "posts": [
                {
                    "title": "65:1 | The limits of Allah in divorce",
                    "arabic": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَتِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ لَا تَدۡرِي لَعَلَّ ٱللَّهَ يُحۡدِثُ بَعۡدَ ذَٰلِكَ أَمۡرٗا",
                    "transliteration": "Ya-ayyuha annabiyyu itha tallaqtumu annisaa fatalliqoohunna liAAiddatihinna waahsoo alAAiddata wattaqoo Allaha rabbakum la tukhrijoohunna min buyootihinna wala yakhrujna illa an yateena bifahishatin mubayyinatin watilka hudoodu Allahi waman yataAAadda hudooda Allahi faqad thalama nafsahu la tadree laAAalla Allaha yuhdithu baAAda thalika amra",
                    "translation": "O Prophet, when you [Muslims] divorce women, divorce them for [the commencement of] their waiting period and keep count of the waiting period, and fear Allah, your Lord. Do not turn them out of their [husbands'] houses, nor should they [themselves] leave [during that period] unless they are committing a clear immorality. And those are the limits [set by] Allah. And whoever transgresses the limits of Allah has certainly wronged himself. You know not; perhaps Allah will bring about after that a [different] matter."
                    
                },
                {
                    "title": "65:7 | Spend according to one's means",
                    "arabic": "لِيُنفِقۡ ذُو سَعَةٖ مِّن سَعَتِهِۦۖ وَمَن قُدِرَ عَلَيۡهِ رِزۡقُهُۥ فَلۡيُنفِقۡ مِمَّآ ءَاتَىٰهُ ٱللَّهُۚ لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا مَآ ءَاتَىٰهَاۚ سَيَجۡعَلُ ٱللَّهُ بَعۡدَ عُسۡرٖ يُسۡرٗا",
                    "transliteration": "Liyunfiq thoo saAAatin min saAAatihi waman qudira AAalayhi rizquhu falyunfiq mimma atahu Allahu la yukallifu Allahu nafsan illa ma ataha sayajAAalu Allahu baAAda AAusrin yusra",
                    "translation": "Let a man of wealth spend from his wealth, and he whose provision is restricted - let him spend from what Allah has given him. Allah does not charge a soul except [according to] what He has given it. Allah will bring about, after hardship, ease."
                }
              ]
            },
            {
              "surah": "66. At-Tahrim",
              "posts": [
                {
                    "title": "66:3 | Allah knows the unseen",
                    "arabic": "وَإِذۡ أَسَرَّ ٱلنَّبِيُّ إِلَىٰ بَعۡضِ أَزۡوَٰجِهِۦ حَدِيثٗا فَلَمَّا نَبَّأَتۡ بِهِۦ وَأَظۡهَرَهُ ٱللَّهُ عَلَيۡهِ عَرَّفَ بَعۡضَهُۥ وَأَعۡرَضَ عَنۢ بَعۡضٖۖ فَلَمَّا نَبَّأَهَا بِهِۦ قَالَتۡ مَنۡ أَنۢبَأَكَ هَٰذَاۖ قَالَ نَبَّأَنِيَ ٱلۡعَلِيمُ ٱلۡخَبِيرُ",
                    "transliteration": "",
                    "translation": "And [remember] when the Prophet confided to one of his wives a statement; and when she informed [another] of it and Allah showed it to him, he made known part of it and ignored a part. And when he informed her about it, she said, \"Who told you this?\" He said, \"I was informed by the Knowing, the Acquainted.\""
                },
                {
                    "title": "66:6 | Prioritise: save yourselves and your family first",
                    "arabic": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ قُوٓاْ أَنفُسَكُمۡ وَأَهۡلِيكُمۡ نَارٗا وَقُودُهَا ٱلنَّاسُ وَٱلۡحِجَارَةُ عَلَيۡهَا مَلَٰٓئِكَةٌ غِلَاظٞ شِدَادٞ لَّا يَعۡصُونَ ٱللَّهَ مَآ أَمَرَهُمۡ وَيَفۡعَلُونَ مَا يُؤۡمَرُونَ",
                    "transliteration": "Ya-ayyuha allatheena amanoo qoo anfusakum waahleekum naran waqooduha annasu walhijaratu AAalayha malaikatun ghilathun shidadun la yaAAsoona Allaha ma amarahum wayafAAaloona ma yumaroon",
                    "translation": "O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are [appointed] angels, harsh and severe; they do not disobey Allah in what He commands them but do what they are commanded."
                },
                {
                    "title": "66:10 | Example of the wife of Nuh and the wife of Lut",
                    "arabic": "ضَرَبَ ٱللَّهُ مَثَلٗا لِّلَّذِينَ كَفَرُواْ ٱمۡرَأَتَ نُوحٖ وَٱمۡرَأَتَ لُوطٖۖ كَانَتَا تَحۡتَ عَبۡدَيۡنِ مِنۡ عِبَادِنَا صَٰلِحَيۡنِ فَخَانَتَاهُمَا فَلَمۡ يُغۡنِيَا عَنۡهُمَا مِنَ ٱللَّهِ شَيۡـٔٗا وَقِيلَ ٱدۡخُلَا ٱلنَّارَ مَعَ ٱلدَّٰخِلِينَ",
                    "transliteration": "Daraba Allahu mathalan lillatheena kafaroo imraata noohin wamraata lootin kanata tahta AAabdayni min AAibadina salihayni fakhanatahuma falam yughniya AAanhuma mina Allahi shayan waqeela odkhula annara maAAa addakhileen",
                    "translation": "Allah presents an example of those who disbelieved: the wife of Noah and the wife of Lot. They were under two of Our righteous servants but betrayed them, so those prophets did not avail them from Allah at all, and it was said, \"Enter the Fire with those who enter.\""
                },
                {
                    "title": "66:11 | Asiyah is an example for those who believe",
                    "arabic": "وَضَرَبَ ٱللَّهُ مَثَلٗا لِّلَّذِينَ ءَامَنُواْ ٱمۡرَأَتَ فِرۡعَوۡنَ إِذۡ قَالَتۡ رَبِّ ٱبۡنِ لِي عِندَكَ بَيۡتٗا فِي ٱلۡجَنَّةِ وَنَجِّنِي مِن فِرۡعَوۡنَ وَعَمَلِهِۦ وَنَجِّنِي مِنَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ",
                    "transliteration": "Wadaraba Allahu mathalan lillatheena amanoo imraata firAAawna ith qalat rabbi ibni lee AAindaka baytan fee aljannati wanajjinee min firAAawna waAAamalihi wanajjinee mina alqawmi aththalimeen",
                    "translation": "And Allah presents an example of those who believed: the wife of Pharaoh, when she said, \"My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people.\""
                }
              ]
            },
            {
              "surah": "67. Al-Mulk",
              "posts": [
                {
                    "title": "67:1 | Allah has power over all things",
                    "arabic": "تَبَٰرَكَ ٱلَّذِي بِيَدِهِ ٱلۡمُلۡكُ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ",
                    "transliteration": "Tabaraka allathee biyadihi almulku wahuwa AAala kulli shayin qadeer",
                    "translation": "Blessed is He in whose hand is dominion, and He is over all things competent -"
                },
                {
                    "title": "67:3 | Can you see any fault in the creation of Allah?",
                    "arabic": "ٱلَّذِي خَلَقَ سَبۡعَ سَمَٰوَٰتٖ طِبَاقٗاۖ مَّا تَرَىٰ فِي خَلۡقِ ٱلرَّحۡمَٰنِ مِن تَفَٰوُتٖۖ فَٱرۡجِعِ ٱلۡبَصَرَ هَلۡ تَرَىٰ مِن فُطُورٖ",
                    "transliteration": "Allathee khalaqa sabAAa samawatin tibaqan ma tara fee khalqi arrahmani min tafawutin farjiAAi albasara hal tara min futoor",
                    "translation": "[And] who created seven heavens in layers. You do not see in the creation of the Most Merciful any inconsistency. So return [your] vision [to the sky]; do you see any breaks?"
                },
                {
                    "title": "67:21 | Who will provide for you",
                    "arabic": "أَمَّنۡ هَٰذَا ٱلَّذِي يَرۡزُقُكُمۡ إِنۡ أَمۡسَكَ رِزۡقَهُۥۚ بَل لَّجُّواْ فِي عُتُوّٖ وَنُفُورٍ",
                    "transliteration": "Amman hatha allathee yarzuqukum in amsaka rizqahu bal lajjoo fee AAutuwwin wanufoor",
                    "translation": "Or who is it that could provide for you if He withheld His provision? But they have persisted in insolence and aversion."
                },
                {
                    "title": "67:30 | Who will provide you with water?",
                    "arabic": "قُلۡ أَرَءَيۡتُمۡ إِنۡ أَصۡبَحَ مَآؤُكُمۡ غَوۡرٗا فَمَن يَأۡتِيكُم بِمَآءٖ مَّعِينِۭ",
                    "transliteration": "Qul araaytum in asbaha maokum ghawran faman yateekum bimain maAAeen",
                    "translation": "Say, \"Have you considered: if your water was to become sunken [into the earth], then who could bring you flowing water?\""
                }
              ]
            },
            {
              "surah": "68. Al-Qalam",
              "posts": [
                {
                    "title": "68:4 | The prophet embodies the best human ethics",
                    "arabic": "وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٖ",
                    "transliteration": "Wainnaka laAAala khuluqin AAatheem",
                    "translation": "And indeed, you are of a great moral character."
                },
                {
                    "title": "68:48 | Be patient",
                    "arabic": "فَٱصۡبِرۡ لِحُكۡمِ رَبِّكَ وَلَا تَكُن كَصَاحِبِ ٱلۡحُوتِ إِذۡ نَادَىٰ وَهُوَ مَكۡظُومٞ",
                    "transliteration": "Fasbir lihukmi rabbika wala takun kasahibi alhooti ith nada wahuwa makthoom",
                    "translation": "Then be patient for the decision of your Lord, [O Muhammad], and be not like the companion of the fish when he called out while he was distressed."
                }
              ]
            },
            {
              "surah": "69. Al-Haqqa",
              "posts": [
                {
                    "title": "69:48 | Quran for the God-fearing people",
                    "arabic": "وَإِنَّهُۥ لَتَذۡكِرَةٞ لِّلۡمُتَّقِينَ",
                    "transliteration": "Wainnahu latathkiratun lilmuttaqeen",
                    "translation": "And indeed, the Qur'an is a reminder for the righteous."
                },
                {
                    "title": "69:52 | Glorifying the names of Allah",
                    "arabic": "فَسَبِّحۡ بِٱسۡمِ رَبِّكَ ٱلۡعَظِيمِ",
                    "transliteration": "Fasabbih bismi rabbika alAAatheem",
                    "translation": "So exalt the name of your Lord, the Most Great."
                }
              ]
            },
            {
              "surah": "70. Al-Maarij",
              "posts": [
                {
                    "title": "70:4 | A day in the Hereafter",
                    "arabic": "تَعۡرُجُ ٱلۡمَلَٰٓئِكَةُ وَٱلرُّوحُ إِلَيۡهِ فِي يَوۡمٖ كَانَ مِقۡدَارُهُۥ خَمۡسِينَ أَلۡفَ سَنَةٖ",
                    "transliteration": "TaAAruju almalaikatu warroohu ilayhi fee yawmin kana miqdaruhu khamseena alfa sana",
                    "translation": "The angels and the Spirit will ascend to Him during a Day the extent of which is fifty thousand years."
                },
                {
                    "title": "70:19 | Human beings have been created anxious",
                    "arabic": " إِنَّ ٱلۡإِنسَٰنَ خُلِقَ هَلُوعًا",
                    "transliteration": "Inna alinsana khuliqa halooAAa",
                    "translation": "Indeed, mankind was created anxious:"
                },
                {
                    "title": "70:23 | Those who are constant in their prayers",
                    "arabic": "ٱلَّذِينَ هُمۡ عَلَىٰ صَلَاتِهِمۡ دَآئِمُونَ",
                    "transliteration": "Allatheena hum AAala salatihim daimoon",
                    "translation": "Those who are constant in their prayer"
                },
                {
                    "title": "70:27 | Those who fear the punishment of Allah",
                    "arabic": "وَٱلَّذِينَ هُم مِّنۡ عَذَابِ رَبِّهِم مُّشۡفِقُونَ",
                    "transliteration": "Wallatheena hum min AAathabi rabbihim mushfiqoon",
                    "translation": "And those who are fearful of the punishment of their Lord -"
                },
                {
                    "title": "70:32 | Those who keep their amanah (trusts) and ahd (convenants)",
                    "arabic": "وَٱلَّذِينَ هُمۡ لِأَمَٰنَٰتِهِمۡ وَعَهۡدِهِمۡ رَٰعُونَ",
                    "transliteration": "Wallatheena hum liamanatihim waAAahdihim raAAoon",
                    "translation": "And those who are to their trusts and promises attentive"
                },
                {
                    "title": "70:33 | Those who stand firm in their shahadah (testimonies)",
                    "arabic": "وَٱلَّذِينَ هُم بِشَهَٰدَٰتِهِمۡ قَآئِمُونَ",
                    "transliteration": "Wallatheena hum bishahadatihim qaimoon",
                    "translation": "And those who are in their testimonies upright"
                }
              ]
            },
            {
              "surah": "71. Nuh",
              "posts": [
                {
                    "title": "71:10 | Seeking forgiveness",
                    "arabic": "فَقُلۡتُ ٱسۡتَغۡفِرُواْ رَبَّكُمۡ إِنَّهُۥ كَانَ غَفَّارٗا",
                    "transliteration": "Faqultu istaghfiroo rabbakum innahu kana ghaffara",
                    "translation": "And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver."
                },
                {
                    "title": "71:13 | Having regard for the gratefulness of Allah",
                    "arabic": "مَّا لَكُمۡ لَا تَرۡجُونَ لِلَّهِ وَقَارٗا",
                    "transliteration": "Ma lakum la tarjoona lillahi waqara",
                    "translation": "What is [the matter] with you that you do not attribute to Allah [due] grandeur"
                },
                {
                    "title": "71:21 | 'My Lord! They have disobeyed me'",
                    "arabic": "قَالَ نُوحٞ رَّبِّ إِنَّهُمۡ عَصَوۡنِي وَٱتَّبَعُواْ مَن لَّمۡ يَزِدۡهُ مَالُهُۥ وَوَلَدُهُۥٓ إِلَّا خَسَارٗا",
                    "transliteration": "Qala noohun rabbi innahum AAasawnee wattabaAAoo man lam yazidhu maluhu wawaladuhu illa khasara",
                    "translation": "Noah said, \"My Lord, indeed they have disobeyed me and followed him whose wealth and children will not increase him except in loss.\""
                }
              ]
            },
            {
              "surah": "72. Al-Jinn",
              "posts": [
                {
                    "title": "72:18 | Mosques are for Allah",
                    "arabic": "وَأَنَّ ٱلۡمَسَٰجِدَ لِلَّهِ فَلَا تَدۡعُواْ مَعَ ٱللَّهِ أَحَدٗا",
                    "transliteration": "Waanna almasajida lillahi fala tadAAoo maAAa Allahi ahada",
                    "translation": "And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone."
                },
                {
                    "title": "72:28 | Allah is aware of everything",
                    "arabic": "لِّيَعۡلَمَ أَن قَدۡ أَبۡلَغُواْ رِسَٰلَٰتِ رَبِّهِمۡ وَأَحَاطَ بِمَا لَدَيۡهِمۡ وَأَحۡصَىٰ كُلَّ شَيۡءٍ عَدَدَۢا",
                    "transliteration": "LiyaAAlama an qad ablaghoo risalati rabbihim waahata bima ladayhim waahsa kulla shayin AAadada",
                    "translation": "That he may know that they have conveyed the messages of their Lord; and He has encompassed whatever is with them and has enumerated all things in number."
                }
              ]
            },
            {
              "surah": "73. Al-Muzzammil",
              "posts": [
                {
                    "title": "73:10 | Face resistance with patience",
                    "arabic": "وَٱصۡبِرۡ عَلَىٰ مَا يَقُولُونَ وَٱهۡجُرۡهُمۡ هَجۡرٗا جَمِيلٗا",
                    "transliteration": "Wasbir AAala ma yaqooloona wahjurhum hajran jameela",
                    "translation": "And be patient over what they say and avoid them with gracious avoidance."
                }
              ]
            },
            {
              "surah": "74. Al-Muddaththir",
              "posts": [
                {
                    "title": "74:54 | The Quran is a reminder",
                    "arabic": "كـَلَّآ إِنَّهُۥ تَذۡكِرَةٞ",
                    "transliteration": "Kalla innahu tathkira",
                    "translation": "No! Indeed, the Qur'an is a reminder"
                }
              ]
            },
            {
              "surah": "75. Al-Qiyama",
              "posts": [
                {
                    "title": "75:22 | Radiant faces",
                    "arabic": "وُجُوهٞ يَوۡمَئِذٖ نَّاضِرَةٌ",
                    "transliteration": "Wujoohun yawmaithin nadira",
                    "translation": "[Some] faces, that Day, will be radiant,"
                },
                {
                    "title": "75:36 | Everything has a purpose",
                    "arabic": "أَيَحۡسَبُ ٱلۡإِنسَٰنُ أَن يُتۡرَكَ سُدًى",
                    "transliteration": "Ayahsabu alinsanu an yutraka suda",
                    "translation": "Does man think that he will be left neglected?"
                }
              ]
            },
            {
              "surah": "76. Al-Insan",
              "posts": [
                {
                    "title": "76:3 | The two choices",
                    "arabic": "إِنَّا هَدَيۡنَٰهُ ٱلسَّبِيلَ إِمَّا شَاكِرٗا وَإِمَّا كَفُورًا",
                    "transliteration": "Inna hadaynahu assabeela imma shakiran waimma kafoora",
                    "translation": "Indeed, We guided him to the way, be he grateful or be he ungrateful."
                },
                {
                    "title": "76:22 | Accepted endeavours",
                    "arabic": "إِنَّ هَٰذَا كَانَ لَكُمۡ جَزَآءٗ وَكَانَ سَعۡيُكُم مَّشۡكُورًا ",
                    "transliteration": "Inna hatha kana lakum jazaan wakana saAAyukum mashkoora",
                    "translation": "[And it will be said], \"Indeed, this is for you a reward, and your effort has been appreciated.\""
                },
                {
                    "title": "76:30 | Allah's decree",
                    "arabic": "وَمَا تَشَآءُونَ إِلَّآ أَن يَشَآءَ ٱللَّهُۚ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمٗا",
                    "transliteration": "Wama tashaoona illa an yashaa Allahu inna Allaha kana AAaleeman hakeema",
                    "translation": "And you do not will except that Allah wills. Indeed, Allah is ever Knowing and Wise."
                }
              ]
            },
            {
              "surah": "77. Al-Mursalat",
              "posts": [
                {
                    "title": "77:7 | The promise",
                    "arabic": "إِنَّمَا تُوعَدُونَ لَوَٰقِعٞ",
                    "transliteration": "Innama tooAAadoona lawaqiAA",
                    "translation": "Indeed, what you are promised is to occur."
                },
                {
                    "title": "77:48 | Difficulty of submission",
                    "arabic": "وَإِذَا قِيلَ لَهُمُ ٱرۡكَعُواْ لَا يَرۡكَعُونَ",
                    "transliteration": "Waitha qeela lahumu irkaAAoo la yarkaAAoon",
                    "translation": "And when it is said to them, \"Bow [in prayer],\" they do not bow."
                }
              ]
            },
            {
              "surah": "78. An-Naba",
              "posts": [
                {
                    "title": "78:29 | Everything is recorded",
                    "arabic": "وَكُلَّ شَيۡءٍ أَحۡصَيۡنَٰهُ كِتَٰبٗا",
                    "transliteration": "Wakulla shayin ahsaynahu kitaba",
                    "translation": "But all things We have enumerated in writing."
                },
                {
                    "title": "78:36 | A generous gift",
                    "arabic": "جَزَآءٗ مِّن رَّبِّكَ عَطَآءً حِسَابٗا",
                    "transliteration": "Jazaan min rabbika AAataan hisaba",
                    "translation": "[As] reward from your Lord, [a generous] gift [made due by] account,"
                }
              ]
            },
            {
              "surah": "79. An-Nazi'at",
              "posts": [
                {
                    "title": "79:24 | Allah the most High",
                    "arabic": "فَقَالَ أَنَا۠ رَبُّكُمُ ٱلۡأَعۡلَىٰ",
                    "transliteration": "Faqala ana rabbukumu alaAAla",
                    "translation": "And said, \"I am your most exalted lord.\""
                },
                {
                    "title": "79:46 | Perception of time in the Hereafter",
                    "arabic": "كَأَنَّهُمۡ يَوۡمَ يَرَوۡنَهَا لَمۡ يَلۡبَثُوٓاْ إِلَّا عَشِيَّةً أَوۡ ضُحَىٰهَا",
                    "transliteration": "Kaannahum yawma yarawnaha lam yalbathoo illa AAashiyyatan aw duhaha",
                    "translation": "It will be, on the Day they see it, as though they had not remained [in the world] except for an afternoon or a morning thereof."
                }
              ]
            },
            {
              "surah": "80. Abasa",
              "posts": [
                {
                    "title": "80:34 | A scene on the Day of Judgement",
                    "arabic": "يَوۡمَ يَفِرُّ ٱلۡمَرۡءُ مِنۡ أَخِيهِ",
                    "transliteration": "Yawma yafirru almaro min akheeh",
                    "translation": "On the Day a man will flee from his brother"
                }
              ]
            },
            {
              "surah": "81. At-Takwir",
              "posts": [
                {
                    "title": "81:14 | Accountability of actions",
                    "arabic": "عَلِمَتۡ نَفۡسٞ مَّآ أَحۡضَرَتۡ",
                    "transliteration": "AAalimat nafsun ma ahdarat",
                    "translation": "A soul will [then] know what it has brought [with it]."
                }
              ]
            },
            {
              "surah": "82. Al-Infitar",
              "posts": [
                {
                    "title": "82:19 | The decision on that Day will be with Allah",
                    "arabic": "يَوۡمَ لَا تَمۡلِكُ نَفۡسٞ لِّنَفۡسٖ شَيۡـٔٗاۖ وَٱلۡأَمۡرُ يَوۡمَئِذٖ لِّلَّهِ",
                    "transliteration": "Yawma la tamliku nafsun linafsin shayan walamru yawmaithin lillah",
                    "translation": "It is the Day when a soul will not possess for another soul [power to do] a thing; and the command, that Day, is [entirely] with Allah."
                }
              ]
            },
            {
              "surah": "83. Al-Mutaffifin",
              "posts": [
                {
                    "title": "83:29 | Attitude of the disbelievers",
                    "arabic": "إِنَّ ٱلَّذِينَ أَجۡرَمُواْ كَانُواْ مِنَ ٱلَّذِينَ ءَامَنُواْ يَضۡحَكُونَ",
                    "transliteration": "Inna allatheena ajramoo kanoo mina allatheena amanoo yadhakoon",
                    "translation": "Indeed, those who committed crimes used to laugh at those who believed."
                },
                {
                    "title": "83:34 | The last laugh",
                    "arabic": "فَٱلۡيَوۡمَ ٱلَّذِينَ ءَامَنُواْ مِنَ ٱلۡكُفَّارِ يَضۡحَكُونَ",
                    "transliteration": "Falyawma allatheena amanoo mina alkuffari yadhakoon",
                    "translation": "So Today those who believed are laughing at the disbelievers,"
                }
              ]
            },
            {
              "surah": "84. Al-Inshiqaq",
              "posts": [
                {
                    "title": "84:8 | The one who recieves his record from his right hand",
                    "arabic": "فَسَوۡفَ يُحَاسَبُ حِسَابٗا يَسِيرٗا",
                    "transliteration": "Fasawfa yuhasabu hisaban yaseera",
                    "translation": "He will be judged with an easy account"
                },
                {
                    "title": "84:11 | The one who recieves his record from behind his back",
                    "arabic": "فَسَوۡفَ يَدۡعُواْ ثُبُورٗا",
                    "transliteration": "Fasawfa yadAAoo thuboora",
                    "translation": "He will cry out for destruction"
                }
              ]
            },
            {
              "surah": "85. Al-Buruj",
              "posts": [
                {
                    "title": "85:11 | Fate of the righteous",
                    "arabic": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ جَنَّٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡكَبِيرُ",
                    "transliteration": "Inna allatheena amanoo waAAamiloo assalihati lahum jannatun tajree min tahtiha alanharu thalika alfawzu alkabeer",
                    "translation": "Indeed, those who have believed and done righteous deeds will have gardens beneath which rivers flow. That is the great attainment."
                },
                {
                    "title": "85:14 | Attributes of Allah",
                    "arabic": "وَهُوَ ٱلۡغَفُورُ ٱلۡوَدُودُ",
                    "transliteration": "Wahuwa alghafooru alwadood",
                    "translation": "And He is the Forgiving, the Affectionate,"
                },
                {
                    "title": "85:16 | What He wills, happens",
                    "arabic": "فَعَّالٞ لِّمَا يُرِيدُ",
                    "transliteration": "FaAAAAalun lima yureed",
                    "translation": "Effecter of what He intends."
                }
              ]
            },
            {
              "surah": "86. At-Tariq",
              "posts": [
                {
                    "title": "86:5 | Self-reflection",
                    "arabic": "فَلۡيَنظُرِ ٱلۡإِنسَٰنُ مِمَّ خُلِقَ",
                    "transliteration": "Falyanthuri alinsanu mimma khuliq",
                    "translation": "So let man observe from what he was created."
                },
                {
                    "title": "86:13 | The Quran is decisive",
                    "arabic": "إِنَّهُۥ لَقَوۡلٞ فَصۡلٞ",
                    "transliteration": "Innahu laqawlun fasl",
                    "translation": "Indeed, the Qur'an is a decisive statement,"
                }
              ]
            },
            {
              "surah": "87. Al-Ala",
              "posts": [
                {
                    "title": "87:1 | Glorify Allah",
                    "arabic": "سَبِّحِ ٱسۡمَ رَبِّكَ ٱلۡأَعۡلَى",
                    "transliteration": "Exalt the name of your Lord, the Most High,",
                    "translation": "Sabbihi isma rabbika alaAAla"
                }
              ]
            },
            {
              "surah": "88. Al-Ghashiya",
              "posts": [
                {
                    "title": "88:21 | Your role is to remind",
                    "arabic": "فَذَكِّرۡ إِنَّمَآ أَنتَ مُذَكِّرٞ",
                    "transliteration": "Fathakkir innama anta muthakkir",
                    "translation": "So remind, [O Muhammad]; you are only a reminder."
                },
                {
                    "title": "88:22 | You can't control people",
                    "arabic": "لَّسۡتَ عَلَيۡهِم بِمُصَيۡطِرٍ",
                    "transliteration": "Lasta AAalayhim bimusaytir",
                    "translation": "You are not over them a controller."
                }
              ]
            },
            {
              "surah": "89. Al-Fajr",
              "posts": [
                {
                    "title": "89:20 | Our relationship with wealth",
                    "arabic": "وَتُحِبُّونَ ٱلۡمَالَ حُبّٗا جَمّٗا",
                    "transliteration": "Watuhibboona almala hubban jamma",
                    "translation": "And you love wealth with immense love."
                }
              ]
            },
            {
              "surah": "90. Al-Balad",
              "posts": [
                {
                    "title": "90:8 | Signs in ourselves",
                    "arabic": "أَلَمۡ نَجۡعَل لَّهُۥ عَيۡنَيۡنِ",
                    "transliteration": "Alam najAAal lahu AAaynayn",
                    "translation": "Have We not made for him two eyes?"
                },
                {
                    "title": "90:17 | Patience and mercy",
                    "arabic": "ثُمَّ كَانَ مِنَ ٱلَّذِينَ ءَامَنُواْ وَتَوَاصَوۡاْ بِٱلصَّبۡرِ وَتَوَاصَوۡاْ بِٱلۡمَرۡحَمَةِ",
                    "transliteration": "Thumma kana mina allatheena amanoo watawasaw bissabri watawasaw bilmarhama",
                    "translation": "And then being among those who believed and advised one another to patience and advised one another to compassion."
                }
              ]
            },
            {
              "surah": "91. Ash-Shams",
              "posts": [
                {
                    "title": "91:13 | Animal rights",
                    "arabic": "فَقَالَ لَهُمۡ رَسُولُ ٱللَّهِ نَاقَةَ ٱللَّهِ وَسُقۡيَٰهَا",
                    "transliteration": "Faqala lahum rasoolu Allahi naqata Allahi wasuqyaha",
                    "translation": "And the messenger of Allah [Salih] said to them, \"[Do not harm] the she-camel of Allah or [prevent her from] her drink.\""
                }
              ]
            },
            {
              "surah": "92. Al-Lail",
              "posts": [
                {
                    "title": "92:5 | Fearing Allah and giving charity",
                    "arabic": "فَأَمَّا مَنۡ أَعۡطَىٰ وَٱتَّقَىٰ",
                    "transliteration": "Faamma man aAAta wattaqa",
                    "translation": "As for he who gives and fears Allah"
                }
              ]
            },
            {
              "surah": "93. Ad-Duhaa",
              "posts": [
                {
                    "title": "93:3 | Allah Is With You",
                    "arabic": "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَ",
                    "transliteration": "Ma waddaAAaka rabbuka wama qala",
                    "translation": "Your Lord has not taken leave of you, [O Muhammad], nor has He detested [you]."
                },
                {
                    "title": "93:7 | Divine Guidance",
                    "arabic": "وَوَجَدَكَ ضَآلّٗا فَهَدَىٰ",
                    "transliteration": "Wawajadaka dallan fahada",
                    "translation": "And He found you lost and guided [you],"
                }
              ]
            },
            {
              "surah": "94. Ash-Sharh",
              "posts": [
                {
                    "title": "94:5 | With hardship comes ease",
                    "arabic": "فَإِنَّ مَعَ ٱلۡعُسۡرِ يُسۡرًا",
                    "transliteration": "Fainna maAAa alAAusri yusra",
                    "translation": "For indeed, with hardship [will be] ease."
                }
              ]
            },
            {
              "surah": "95. At-Tin",
              "posts": [
                {
                    "title": "95:8 | Allah as the most Just",
                    "arabic": "أَلَيۡسَ ٱللَّهُ بِأَحۡكَمِ ٱلۡحَٰكِمِينَ",
                    "transliteration": "Alaysa Allahu biahkami alhakimeen",
                    "translation": "Is not Allah the most just of judges?"
                }
              ]
            },
            {
              "surah": "96. Al-Alaq",
              "posts": [
                {
                    "title": "96:19 | Draw close to Allah",
                    "arabic": "كـَلَّا لَا تُطِعۡهُ وَٱسۡجُدۡۤ وَٱقۡتَرِب",
                    "transliteration": "Kalla la tutiAAhu wasjud waqtarib",
                    "translation": "No! Do not obey him. But prostrate and draw near [to Allah]."
                }
              ]
            },
            {
              "surah": "97. Al-Qadr",
              "posts": [
                {
                    "title": "97:1 | The Night in which the Quran was revealed",
                    "arabic": "إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةِ ٱلۡقَدۡرِ",
                    "transliteration": "Inna anzalnahu fee laylati alqadr",
                    "translation": "Indeed, We sent the Qur'an down during the Night of Decree."
                },
                {
                    "title": "97:3 | The unmatched value of Laylatul Qadr",
                    "arabic": "لَيۡلَةُ ٱلۡقَدۡرِ خَيۡرٞ مِّنۡ أَلۡفِ شَهۡرٖ",
                    "transliteration": "Laylatu alqadri khayrun min alfi shahr",
                    "translation": "The Night of Decree is better than a thousand months."
                }
              ]
            },
            {
              "surah": "98. Al-Bayyina",
              "posts": [
                {
                    "title": "98:7 | The best of creation",
                    "arabic": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ أُوْلَٰٓئِكَ هُمۡ خَيۡرُ ٱلۡبَرِيَّةِ",
                    "transliteration": "Inna allatheena amanoo waAAamiloo assalihati olaika hum khayru albariyya",
                    "translation": "Indeed, they who have believed and done righteous deeds - those are the best of creatures."
                },
                {
                    "title": "98:8 | Allah is pleased with them and they are pleased with Him",
                    "arabic": "جَزَآؤُهُمۡ عِندَ رَبِّهِمۡ جَنَّٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ ذَٰلِكَ لِمَنۡ خَشِيَ رَبَّهُ",
                    "transliteration": "Jazaohum AAinda rabbihim jannatu AAadnin tajree min tahtiha alanharu khalideena feeha abadan radiya Allahu AAanhum waradoo AAanhu thalika liman khashiya rabbah",
                    "translation": "Their reward with Allah will be gardens of perpetual residence beneath which rivers flow, wherein they will abide forever, Allah being pleased with them and they with Him. That is for whoever has feared his Lord."
                }
              ]
            },
            {
              "surah": "99. Az-Zalzalah",
              "posts": [
                {
                    "title": "99:7 | Even the smallest good will be seen",
                    "arabic": "فَمَن يَعۡمَلۡ مِثۡقَالَ ذَرَّةٍ خَيۡرٗا يَرَهُۥ",
                    "transliteration": "Faman yaAAmal mithqala tharratin khayran yarah",
                    "translation": "So whoever does an atom's weight of good will see it,"
                },
                {
                    "title": "98:8 | No evil deed goes unnoticed",
                    "arabic": "وَمَن يَعۡمَلۡ مِثۡقَالَ ذَرَّةٖ شَرّٗا يَرَهُۥ",
                    "transliteration": "Waman yaAAmal mithqala tharratin sharran yarah",
                    "translation": "And whoever does an atom's weight of evil will see it."
                }
              ]
            },
            {
              "surah": "100. Al-Adiyat",
              "posts": [
                {
                    "title": "100:11 | All will be revealed",
                    "arabic": "إِنَّ رَبَّهُم بِهِمۡ يَوۡمَئِذٖ لَّخَبِيرُۢ ",
                    "transliteration": "Inna rabbahum bihim yawmaithin lakhabeer",
                    "translation": "Indeed, their Lord with them, that Day, is [fully] Acquainted."
                }
              ]
            },
            {
              "surah": "101. Al-Qaria",
              "posts": [
                {
                    "title": "101:6 | A rewarding life for those with heavy scales of good deeds",
                    "arabic": "فَهُوَ فِي عِيشَةٖ رَّاضِيَةٖ",
                    "transliteration": "Fahuwa fee AAeeshatin radiya",
                    "translation": "He will be in a pleasant life."
                }
              ]
            },
            {
              "surah": "102. At-Takathur",
              "posts": [
                {
                    "title": "102:8 | Accountability",
                    "arabic": "ثُمَّ لَتُسۡـَٔلُنَّ يَوۡمَئِذٍ عَنِ ٱلنَّعِيمِ",
                    "transliteration": "Thumma latusalunna yawmaithin AAani annaAAeem",
                    "translation": "Then you will surely be asked that Day about pleasure."
                }
              ]
            },
            {
              "surah": "103. Al-Asr",
              "posts": [
                {
                    "title": "103:2 | Mankind is in loss",
                    "arabic": "إِنَّ ٱلۡإِنسَٰنَ لَفِي خُسۡرٍ",
                    "transliteration": "Inna alinsana lafee khusr",
                    "translation": "Indeed, mankind is in loss,"
                },
                {
                    "title": "103:3 | Except for those who embody four qualities",
                    "arabic": "إِلَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَتَوَاصَوۡاْ بِٱلۡحَقِّ وَتَوَاصَوۡاْ بِٱلصَّبۡرِ",
                    "transliteration": "Illa allatheena amanoo waAAamiloo assalihati watawasaw bilhaqqi watawasaw bissabr",
                    "translation": "Except for those who have believed and done righteous deeds and advised each other to truth and advised each other to patience."
                }
              ]
            },
            {
              "surah": "104. Al-Humazah",
              "posts": [
                {
                    "title": "104:3 | People's perception of wealth",
                    "arabic": "يَحۡسَبُ أَنَّ مَالَهُۥٓ أَخۡلَدَهُۥ",
                    "transliteration": "Yahsabu anna malahu akhladah",
                    "translation": "He thinks that his wealth will make him immortal."
                }
              ]
            },
            {
              "surah": "105. Al-Fil",
              "posts": [
                {
                    "title": "105:2 | The defeat of the Army of the Elephant",
                    "arabic": "أَلَمۡ يَجۡعَلۡ كَيۡدَهُمۡ فِي تَضۡلِيلٖ",
                    "transliteration": "Alam yajAAal kaydahum fee tadleel",
                    "translation": "Did He not make their plan into misguidance?"
                }
              ]
            },
            {
              "surah": "106. Quraysh",
              "posts": [
                {
                    "title": "106:3 | Lord of the Ka'bah",
                    "arabic": "فَلۡيَعۡبُدُواْ رَبَّ هَٰذَا ٱلۡبَيۡتِ",
                    "transliteration": "FalyaAAbudoo rabba hatha albayt",
                    "translation": "Let them worship the Lord of this House,"
                },
                {
                    "title": "106:4 | Economic stability and security",
                    "arabic": "ٱلَّذِيٓ أَطۡعَمَهُم مِّن جُوعٖ وَءَامَنَهُم مِّنۡ خَوۡفِۭ",
                    "transliteration": "Allathee atAAamahum min jooAAin waamanahum min khawf",
                    "translation": "Who has fed them, [saving them] from hunger and made them safe, [saving them] from fear."
                }
              ]
            },
            {
              "surah": "107. Al-Ma'un",
              "posts": [
                {
                    "title": "107:5 | Warning for those careless in prayer",
                    "arabic": "ٱلَّذِينَ هُمۡ عَن صَلَاتِهِمۡ سَاهُونَ",
                    "transliteration": "Allatheena hum AAan salatihim sahoon",
                    "translation": "[But] who are heedless of their prayer"
                }
              ]
            },
            {
              "surah": "108. Al-Kawthar",
              "posts": [
                {
                    "title": "108:2 | Prayer and sacrifice",
                    "arabic": "فَصَلِّ لِرَبِّكَ وَٱنۡحَرۡ",
                    "transliteration": "Fasalli lirabbika wanhar",
                    "translation": "So pray to your Lord and sacrifice [to Him alone]."
                }
              ]
            },
            {
              "surah": "109. Al-Kafirun",
              "posts": [
                {
                    "title": "109:6 | Co-existence of religions",
                    "arabic": "لَكُمۡ دِينُكُمۡ وَلِيَ دِينِ",
                    "transliteration": "Lakum deenukum waliya deen",
                    "translation": "For you is your religion, and for me is my religion."
                }
              ]
            },
            {
              "surah": "110. An-Nasr",
              "posts": [
                {
                    "title": "110:1 | Victory of Allah",
                    "arabic": "إِذَا جَآءَ نَصۡرُ ٱللَّهِ وَٱلۡفَتۡحُ",
                    "transliteration": "Itha jaa nasru Allahi walfath",
                    "translation": "When the victory of Allah has come and the conquest,"
                },
                {
                    "title": "110:3 | Glorification and seeking forgiveness",
                    "arabic": "فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَٱسۡتَغۡفِرۡهُۚ إِنَّهُۥ كَانَ تَوَّابَۢا",
                    "transliteration": "Fasabbih bihamdi rabbika wastaghfirhu innahu kana tawwaba",
                    "translation": "Then exalt [Him] with praise of your Lord and ask forgiveness of Him. Indeed, He is ever Accepting of repentance."
                }
              ]
            },
            {
              "surah": "111. Al-Masad",
              "posts": [
                {
                    "title": "111:1 | Abu Lahab is doomed",
                    "arabic": "تَبَّتۡ يَدَآ أَبِي لَهَبٖ وَتَبَّ",
                    "transliteration": "Tabbat yada abee lahabin watab",
                    "translation": "May the hands of Abu Lahab be ruined, and ruined is he."
                }
              ]
            },
            {
              "surah": "112. Al-Ikhlas",
              "posts": [
                {
                    "title": "112:1 | The Oneness of Allah",
                    "arabic": "قُلۡ هُوَ ٱللَّهُ أَحَدٌ ",
                    "transliteration": "Qul huwa Allahu ahad",
                    "translation": "Say, He is Allah, [who is] One"
                }
              ]
            },
            {
              "surah": "113. Al-Falaq",
              "posts": [
                {
                    "title": "113:2 | Evil within creation",
                    "arabic": "مِن شَرِّ مَا خَلَقَ",
                    "transliteration": "Min sharri ma khalaq",
                    "translation": "From the evil of that which He created"
                },
                {
                    "title": "113:5 | Evil of the envier",
                    "arabic": "وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
                    "transliteration": "Wamin sharri hasidin itha hasad",
                    "translation": "And from the evil of an envier when he envies."
                }
              ]
            },
            {
              "surah": "114. An-Nas",
              "posts": [
                {
                    "title": "114:5 | The one who whispers evil into people's hearts",
                    "arabic": "ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ",
                    "transliteration": "Allathee yuwaswisu fee sudoori annas",
                    "translation": "Who whispers [evil] into the breasts of mankind"
                }
              ]
            }
]
