[
  {
    "surah": "1. Al-Fatihah",
    "posts": [
      {
        "text": "Surah Al-Fatihah is the 1st surah (chapter) of the Holy Quran and it’s titled “The Opening”. Consisting of 7 verses, it was revealed in the holy city of Makkah before the Prophet (PBUH) migrated to Madinah. The unique thing about this surah is that it’s recited 17 times daily in obligatory prayers. Another important aspect that makes it unique is that it encapsulates the essence of the Quranic message. It outlines Allah’s authority, humanity's reliance on divine guidance, and the uncompromising truth that Allah is the only one worthy of worship."
      }
    ]
  },
  {
    "surah": "2. Al-Baqarah",
    "posts": [
      {
        "text": "Surah Al-Baqarah, the second chapter, is the longest surah in the Quran and it’s named after the story of the cow, discussed in verses 67-73. It explains the qualities of believers, disbelievers, and hypocrites, discusses Allah's power in creation and resurrection, recounts Satan's enmity towards Adam (AS) and his descendants, and details Allah's covenant with Musa (AS) and the Children of Israel. The surah also provides rulings on many other important aspects, including marital relationships, bequests, jihad, fasting, pilgrimage, donations, debts, and interest."
      }
    ]
  },
  {
    "surah": "3. Al-Imran",
    "posts": [
      {
        "text": "The 3rd chapter of the Holy Quran is Surah Ali ‘Imran. It’s a Madinan surah named after the Family of Imran mentioned in verse 33. It reinforces the belief in Allah as the source of divine revelation and affirms Islam as the only accepted religion. The surah also touches on early battles against Makkan pagans, emphasizing the lessons from the Muslims' defeat at the Battle of Uhud (3 AH/625 CE). Additionally, the virtue of mindfulness of Allah is highlighted towards the end, connecting with the beginning of the next surah."
      }
    ]
  },
  {
    "surah": "4. An-Nisa",
    "posts": [
      {
        "text": "The 4th chapter of the Holy Quran is Surah An-Nisa, meaning Women, which serves as a comprehensive guide addressing various aspects of social, legal, and ethical matters. It provides guidance on family relationships, justice, and interactions with different religious communities, and exposes the characteristics of hypocrites. The Surah also plays a role in clarifying certain misconceptions related to the status of women and the beliefs surrounding Prophet ‘Isa (AS)."
      }
    ]
  },
  {
    "surah": "5. Al-Ma’idah",
    "posts": [
      {
        "text": "Surah Al-Ma'idah is the 5th chapter of the Holy Quran and it’s named after the story of the table mentioned in verses 112-115. It lays out various rulings, including what foods are permissible and prohibited, guidelines for hunting during the pilgrimage, and making a bequest while traveling. The Surah also addresses the violation of covenants made by the Jews and Christians with Allah, urging believers to comply with Allah's judgments as conveyed by the Prophet (PBUH). Additionally, it delves into topics previously mentioned in other chapters, such as compensating for broken oaths, the sanctity of human life, and the humanity of ‘Isa (AS)."
      }
    ]
  },
  {
    "surah": "6. Al-An’am",
    "posts": [
      {
        "text": "Revealed in Makkah, Surah Al-An’am explains Allah's sovereignty and refutes pagan beliefs. It details permissible and prohibited foods more extensively than previous chapters, emphasizing prophethood's nature and the importance of Allah's will. The surah begins by highlighting Allah's authority and ends by stressing accountability for one's deeds, bridging to the subsequent chapter. It solidifies belief in Allah's supremacy, debunking false ideologies, and emphasizing adherence to divine laws."
      }
    ]
  },
  {
    "surah": "7. Al-A’raf",
    "posts": [
      {
        "text": "The 7th chapter of the Holy Quran is Surah Al-A’raf, which translates to 'The Heights.' This surah delves into the historical accounts of various prophets and their communities, stressing the consequences of denying divine guidance. It also addresses the reality of the unseen, the nature of Satan’s deception, and the spiritual struggle of humankind. The Surah emphasizes personal accountability and the need for sincere submission to Allah."
      }
    ]
  },
  {
    "surah": "8. Al-Anfal",
    "posts": [
      {
        "text": "Surah Al-Anfal, meaning 'The Spoils of War,' is the 8th chapter of the Holy Quran. It discusses the Battle of Badr, emphasizing the divine assistance received by the believers and the ethics of warfare. The surah instructs Muslims to remain united, disciplined, and obedient to the Prophet (PBUH). It stresses the importance of trust in Allah, the distribution of war booty, and the distinction between believers and hypocrites."
      }
    ]
  },
  {
    "surah": "9. At-Tawbah",
    "posts": [
      {
        "text": "Surah At-Tawbah, also known as 'The Repentance,' is the only surah that begins without Bismillah. It exposes the hypocrisy and betrayal of treaties by the disbelievers, calls for the rejection of idolatry, and emphasizes the importance of striving in Allah’s cause. The surah encourages repentance and lays out rules regarding warfare, alliances, and the responsibilities of the Muslim community. It is a stern warning to hypocrites and a call to commitment for believers."
      }
    ]
  },
  {
    "surah": "10. Yunus",
    "posts": [
      {
        "text": "Surah Yunus, the 10th chapter of the Holy Quran, is named after Prophet Yunus (AS). The surah emphasizes Allah’s power, the truth of the Quran, and the consequences of disbelief. It encourages reflection on the signs of Allah in creation, highlights the mercy and justice of Allah, and uses the story of Yunus (AS) as a lesson in repentance and divine forgiveness. It invites humanity to believe before the inevitable Day of Judgment arrives."
      }
    ]
  },
  {
    "surah": "11. Hud",
    "posts": [
      {
        "text": "This Makkan Surah takes its name from Prophet Hud (AS), whose narrative is recounted in verses 50-60. Unlike the previous Surah and Surah 7, Surah Hud also provides more detailed accounts of Prophet Nuh (AS). It also explains stories of destroyed disbelievers to dissuade the Arab pagans and reassure the Prophet (PBUH) of his eventual victory. Additionally, it references the rewards awaiting believers and the punishments awaiting disbelievers in the Hereafter."
      }
    ]
  },
  {
    "surah": "12. Yusuf",
    "posts": [
      {
        "text": "This uplifting Makkan Surah was revealed during a critical time in the Prophet's (PBUH) life, following the loss of his main supporters and a period of persecution. It narrates the story of Prophet Yusuf (AS), who endured betrayal and hardship but ultimately rose to power in Egypt. Similarly, the Prophet (PBUH) faced adversity and persecution in his own life but emerged as Arabia's leader. When he finally triumphed over Makkah, he forgave his adversaries, echoing Prophet Yusuf’s words of mercy."
      }
    ]
  },
  {
    "surah": "13. Ar-Ra’d",
    "posts": [
      {
        "text": "Named after the thunder mentioned in verse 13, Surah Ar-Ra'd explains Allah's magnificent signs in the heavens and earth, which are disregarded by deniers. It highlights Allah's knowledge, might, and steadfast support for His prophets (AS), reaffirms the authenticity of the Qur'an, and issues warnings to disbelievers. The Surah also discusses the qualities of believers and disbelievers and the respective rewards for each, themes that are reiterated in the subsequent two Surahs."
      }
    ]
  },
  {
    "surah": "14. Ibrahim",
    "posts": [
      {
        "text": "This Makkan Surah is named after Prophet Ibrahim (AS), who settled his wife Hajrah (AS) and his son Ishmael (AS) in what later became the city of Makkah. He invoked Allah to safeguard his descendants from idol worship, which was prevalent among the Makkans at that time. The Surah also highlights Allah's favors, often met with ingratitude and denial. A significant portion of the Surah depicts how disbelievers will be misled by Satan and subjected to torment in Hell."
      }
    ]
  },
  {
    "surah": "15. Al-Hijr",
    "posts": [
      {
        "text": "Surah Al-Hijr is a Makkan Surah that derives its name from the place mentioned in verses 80-84, where the people of Prophet Saleh (AS) once resided. It recounts the destruction of other communities as a cautionary tale for the Arab deniers, who are further warned at the beginning of the subsequent Surah. The Surah highlights Satan's arrogance towards Allah and his enmity towards humanity. Lastly, it also encourages Prophet Muhammad (PBUH) to practice patience and find solace in worship."
      }
    ]
  },
  {
    "surah": "16. An-Nahl",
    "posts": [
      {
        "text": "Surah An-Nahl emphasizes Allah’s creation and numerous blessings, urging gratitude and obedience. It condemns polytheism and highlights the Quran as a guide and healing. The Surah also encourages patience and perseverance in trials, affirming that victory belongs to the believers. It ends with a reminder of divine justice and the final accountability in the Hereafter."
      }
    ]
  },
  {
    "surah": "17. Al-Isra",
    "posts": [
      {
        "text": "Surah Al-Isra, also known as Bani Isra’il, takes its name from the miraculous Night Journey of the Prophet Muhammad (PBUH). It highlights the consequences of ingratitude, especially referencing the Children of Israel. The Surah emphasizes Quranic guidance, prayer, and the Day of Judgement. It warns against arrogance and disobedience while promoting justice and the importance of parental respect."
      }
    ]
  },
  {
    "surah": "18. Al-Kahf",
    "posts": [
      {
        "text": "Surah Al-Kahf contains four major stories: the People of the Cave, the Owner of Two Gardens, Musa (AS) and Khidr, and Dhul-Qarnayn. Each narrative illustrates a key trial—faith, wealth, knowledge, and power. The Surah warns against Dajjal (Antichrist) and emphasizes the Quran’s truth and guidance. Reciting it is a protection against spiritual trials."
      }
    ]
  },
  {
    "surah": "19. Maryam",
    "posts": [
      {
        "text": "Surah Maryam recounts the miraculous births of Isa (AS) and Yahya (AS) and affirms the oneness of Allah. It defends the chastity of Maryam and refutes the notion of Allah having a son. The Surah also highlights Allah’s mercy and the fate of both the righteous and the arrogant. It urges submission and sincere worship."
      }
    ]
  },
  {
    "surah": "20. Ta-Ha",
    "posts": [
      {
        "text": "Surah Ta-Ha recounts the story of Musa (AS), including his mission to Pharaoh, the miracles he was granted, and the trials faced by Bani Isra’il. The Surah emphasizes the Quran’s purpose as a reminder, not a source of distress. It highlights Allah’s knowledge, guidance, and mercy, urging faith and steadfastness."
      }
    ]
  },
  {
    "surah": "21. Al-Anbiya",
    "posts": [
      {
        "text": "This Surah focuses on various prophets and their unwavering dedication to spreading Allah’s message. It demonstrates divine support for the righteous and punishment for those who reject the truth. It emphasizes that all prophets preached monotheism and called people to submit to Allah. The Surah concludes with a reassurance of the final victory of truth."
      }
    ]
  },
  {
    "surah": "22. Al-Hajj",
    "posts": [
      {
        "text": "Surah Al-Hajj, named after the pilgrimage, covers the significance of Hajj and rituals associated with it. It highlights the reality of the Day of Judgement and encourages believers to strive in the path of Allah. The Surah also deals with themes of sacrifice, unity, and the establishment of prayer and charity."
      }
    ]
  },
  {
   "surah": "23. Al-Mu’minun",
   "posts": [
     {
       "text": "This Makkan Surah stresses that Muslims are assured success (verse 1), while disbelievers are destined to fail (verse 117). Similar to the previous Surah, it highlights the oneness of Allah and His ability to create and resurrect. The final part addresses the judgment of believers and disbelievers, particularly focusing on the fate of the wicked who mistreat believers. This theme continues into the next Surah."
     }
   ]
 },
 {
   "surah": "24. An-Nur",
   "posts": [
     {
       "text": "Surah An-Nur literally means “divine light”, mentioned in its 35-36 verse. A significant portion of this Surah addresses the issue of sexual misconduct. Additionally, it provides guidelines for believers on how to respond to false rumors against Hazrat Aisha (RA), the wife of the Prophet Muhammad (PBUH). Other topics discussed include modesty, respecting people's privacy, forced prostitution, hypocrisy, and false accusations of adultery. The Surah emphasizes Allah's power, adherence to His judgment, and obedience to the Prophet Muhammad (PBUH)."
     }
   ]
 },
 {
   "surah": "25. Al-Furqan",
   "posts": [
     {
       "text": "Surah Al-Furqan is a Makkan Surah and its name is derived from verses 1-6, which refute pagan claims that the Quran was fabricated and plagiarized from earlier scriptures. Other passages condemn polytheism, denial of resurrection, and mocking the Prophet Muhammad (PBUH). The Surah also emphasizes Allah's power, evident in the marvels of creation and rain, a theme continued from the previous Surah. Additionally, verses 63-76 beautifully describe the qualities of righteous servants of Allah."
     }
   ]
 },
 {
   "surah": "26. Ash-Shu’ara",
   "posts": [
     {
       "text": "This Makkan Surah is named after the reference to poets in verses 224-226. Continuing from the previous Surah's warning to deniers of truth, this Surah recounts cautionary tales of destroyed deniers, including Pharaoh and the peoples of Nuh (AS), Shuaib (AS), Lut (AS), and Saleh (AS). The divine origin of the Quran is emphasized at both ends of the Surah. Furthermore, the qualities of the believers mentioned in the last verse (227) are elaborated upon at the beginning of the next Surah."
     }
   ]
 },
 {
   "surah": "27. An-Naml",
   "posts": [
     {
       "text": "Surah An-Naml recounts the encounters of Prophet Sulaiman (AS) with ants, a hoopoe, and Queen Saba, unique to this Surah. It contrasts Allah's power to create and provide with the powerlessness of idols. The Surah also presents deterrent examples to the pagans and warns of the horrors of the apocalypse. The Prophet Muhammad (PBUH) is reassured of the truth of the Quran and reminded that his duty is solely to deliver the message, with judgment resting only with Allah."
     }
   ]
 },
 {
   "surah": "28. Al-Qasas",
   "posts": [
     {
       "text": "Surah Al-Qasas means 'The Stories' and includes the most detailed narrative of Prophet Musa (AS), from his infancy to his mission. It also recounts the story of Qarun, an arrogant rich man whose downfall is a lesson. The Surah reaffirms the divine origin of the Quran and encourages patience in trials. It assures that Allah’s plan is always superior and reassures the Prophet (PBUH) that guidance lies with Allah."
     }
   ]
 },
 {
   "surah": "29. Al-Ankabut",
   "posts": [
     {
       "text": "This Makkan Surah takes its name from the spider mentioned in verse 41. It focuses on tests of faith and encourages believers to remain steadfast. The Surah discusses the stories of previous prophets and their communities to show the consequences of rejecting truth. It warns against relying on false beliefs and emphasizes sincerity in worship. The fragile spider's web is used as a metaphor for the weakness of false deities."
     }
   ]
 },
 {
   "surah": "30. Ar-Rum",
   "posts": [
     {
       "text": "Named after the Romans, this Surah begins by predicting the Roman Empire’s comeback after defeat, which came true. The Surah highlights Allah’s control over history and nature, stressing His ability to revive life. It invites reflection on creation, encourages patience, and promotes the values of justice and compassion. The contrast between believers and disbelievers is emphasized, with a reminder of the Day of Judgment."
     }
   ]
 },
 {
   "surah": "31. Luqman",
   "posts": [
     {
       "text": "This Meccan Surah is named after Luqman, who was a wise African man quoted advising his son (verses 12-19) on one's relationship with Allah and people. While the believers are praised, the pagans are condemned for ingratitude, distracting others from the Way of Allah, and setting up idols as His equals. The surah also references Allah's natural marvels, challenging deniers to point out anything their gods have created. It concludes by warning humanity of the Day of Judgment."
     }
   ]
 },
 {
   "surah": "32. As-Sajdah",
   "posts": [
     {
       "text": "Surah As-Sajdah is named after the prostrations of the believers mentioned in verse 15, emphasizing that the Quran is a divine revelation and that Almighty Allah is the sole Creator, most capable of resurrection. It also highlights the qualities of the believers and the disbelievers and the reward awaiting each. Additionally, it urges the Prophet Muhammad (PBUH) to turn away from the deniers and not yield to them."
     }
   ]
 },
 {
   "surah": "33. Al-Ahzab",
   "posts": [
     {
       "text": "This Madinan Surah is named after the enemy alliance mentioned in verses 9-27, which besieged Medina during the Battle of the Trench. While reminding believers of Allah's aid against the enemy alliance, the Surah repeatedly condemns the hypocrites. It provides social guidelines regarding adoption, divorce, modesty, and the etiquette of dealing with the Prophet Muhammad (PBUH) and his wives. With a view of Allah's favors to the believers, including His forgiveness and generous reward at the end of the Surah."
     }
   ]
 },
 {
   "surah": "34. Saba",
   "posts": [
     {
       "text": "Surah Saba is a Makkan chapter and derives its name from the reference to the people of Sava (verses 15-20), who were punished for meeting Allah's favors with ingratitude. Both the prophet Dawud (AS) and Sulaiman (AS) are cited as grateful servants of Allah. The Makkan pagans are reminded that only faith can bring them closer to Allah, not their wealth. They are criticized for calling the Prophet Muhammad (PBUH) insane and warned of punishment in this life and the next."
     }
   ]
 },
 {
   "surah": "35. Fatir",
   "posts": [
     {
       "text": "Surah Fatir showcases Allah's infinite power through the marvels of His creation, contrasting it with the powerlessness of pagan idols. The Prophet Muhammad (PBUH) is consoled by the fact that many prophets were denied before him. The surah also promises believers a great reward in Paradise (verses 31-35), while the disbelievers are warned of a scathing punishment in Hell (verses 36-39)."
     }
   ]
 },
 {
   "surah": "36. Ya-Sin",
   "posts": [
     {
       "text": "Surah Ya-Sin talks about the divine nature and purpose of the Quran. The Arab pagans are reminded of the fate of earlier disbelievers and condemned for following Satan, denying the Resurrection, discrediting the Quran, and rejecting the Prophet Muhammad (PBUH) as a poet. The surah also contains some examples of Allah's wonders of creation to prove His ability to bring the dead back to life."
     }
   ]
 },
 {
   "surah": "37. As-Saffat",
   "posts": [
     {
       "text": "The name of this chapter is taken from its first verse, which begins with an oath by “Saffat”, a group of angels who are arrayed to perform the command of Allah. It is the first Surah of the Holy Qur’an that begins with an oath. Like most other Makkan Surahs, many of the verses of this Surah also address Origin and Resurrection, accompanied by warnings and admonitions."
     }
   ]
 },
 {
   "surah": "38. Sad",
   "posts": [
     {
       "text": "This Surah is perceived as a continuation of the previous one since it mentions some prophets that are not mentioned there, including Dawud (AS), Sulaiman (AS), and Ayub (AS). Again, the pagans are condemned for denying the oneness of Allah and rejecting the Prophet Muhammad (PBUH). The end of this Surah talks about the universality of the Quran whereas the beginning of the next speaks of its divine nature."
     }
   ]
 },
 {
   "surah": "39. Az-Zumar",
   "posts": [
     {
       "text": "This Makkan Surah expands on the narrative of Adam's (AS) creation from the previous Surah. It mentions the creation of Adam's (AS) spouse and the development of their descendants. Some of these descendants choose to be faithful and grateful to their Creator, while others do not. Eventually, after a fair judgment, the faithful will be led to their places in Paradise, and the unfaithful to their places in Hell. The last part of this Surah explains that Allah is forgiving."
     }
   ]
 },
 {
   "surah": "40. Ghafir",
   "posts": [
     {
       "text": "Surah Ghafir talks about Allah's infinite mercy and severe punishment, and humanity's capacity to either be grateful or ungrateful to their Lord, along with the resulting rewards. These themes are exemplified in the story of the prophet Musa (AS) (verses 23-54), where Pharaoh represents the ungrateful disbeliever. The Prophet Muhammad (PBUH) is repeatedly advised to be patient, with the assurance that Allah never forsakes His prophets."
     }
   ]
 },
 {
   "surah": "41. Fussilat",
   "posts": [
     {
       "text": "Surah Fussilat, also known as Ha-Meem Sajdah, elaborates on the Quran’s clarity and consistency, along with its power to reform hearts and minds. It emphasizes the signs in the universe, encourages reflection, and portrays the consequences for those who deny the truth. The chapter assures the Prophet (PBUH) of divine support and highlights the importance of patience and perseverance."
     }
   ]
 },
 {
   "surah": "42. Ash-Shura",
   "posts": [
     {
       "text": "Surah Ash-Shura emphasizes the importance of mutual consultation (shura) in decision-making. It also discusses the unity of divine messages and the Prophet Muhammad’s (PBUH) mission to deliver the Quran. The Surah contrasts believers and disbelievers and affirms that guidance is solely in Allah’s hands."
     }
   ]
 },
 {
   "surah": "43. Az-Zukhruf",
   "posts": [
     {
       "text": "This Surah criticizes those who mock divine guidance and elevate worldly luxury over spiritual truth. It responds to objections raised against the Prophet Muhammad (PBUH) and reinforces the humanity of Isa (AS). The Surah urges reflection on the Quran's divine origin and Allah’s blessings."
     }
   ]
 },
 {
   "surah": "44. Ad-Dukhan",
   "posts": [
     {
       "text": "Surah Ad-Dukhan warns of a dreadful smoke that will envelop the disbelievers as a punishment. It recounts the destruction of past nations and the deliverance of the Children of Israel. The Surah reassures believers of Paradise and condemns those who persist in disbelief."
     }
   ]
 },
 {
   "surah": "45. Al-Jathiyah",
   "posts": [
     {
       "text": "Surah Al-Jathiyah addresses those who deny resurrection and divine judgment. It emphasizes the signs of Allah in creation and the truth of the Quran. The chapter concludes with a scene of every nation kneeling in judgment before Allah, highlighting the gravity of the Hereafter."
     }
   ]
 },
 {
   "surah": "46. Al-Ahqaf",
   "posts": [
     {
       "text": "Surah Al-Ahqaf derives its name from the sand hills mentioned in verse 21. It recounts the destruction of the people of Hud (AS) for their disbelief and contrasts Allah’s infinite power with the powerlessness of idols. The chapter also emphasizes the consequences for those who reject truth and urges Prophet Muhammad (PBUH) to remain patient."
     }
   ]
 },
 {
   "surah": "47. Muhammad",
   "posts": [
     {
       "text": "Surah Muhammad, a Madinan chapter named after the Prophet (PBUH), focuses on warfare etiquette and promises rewards in Paradise for believers while warning disbelievers and hypocrites. It urges striving in Allah’s path and encourages charity, highlighting the temporary nature of worldly life."
     }
   ]
 },
 {
   "surah": "48. Al-Fath",
   "posts": [
     {
       "text": "Surah Al-Fath is named after the clear triumph, referring to the Treaty of Ḥudaibiyah. It praises the believers’ steadfastness, criticizes the hypocrites’ inaction, and condemns the pagans for obstructing the Sacred House. The surah concludes with a description of true believers and their conduct toward the Prophet (PBUH)."
     }
   ]
 },
 {
   "surah": "49. Al-Hujurat",
   "posts": [
     {
       "text": "Surah Al-Hujurat, named after the Prophet’s (PBUH) private quarters, offers guidance on respecting the Prophet, social etiquette, and moral conduct among believers. It addresses issues like mockery, backbiting, and suspicion, emphasizing that true faith is demonstrated by actions, not merely words."
     }
   ]
 },
 {
   "surah": "50. Qaf",
   "posts": [
     {
       "text": "Surah Qaf begins with the disbelievers’ denial of resurrection. It cites examples of destroyed nations and Allah’s power to create and resurrect. The surah emphasizes personal accountability, angels recording deeds, and the certainty of the Day of Judgment, urging reflection and steadfastness."
     }
   ]
 },
 {
   "surah": "51. Adh-Dhariyat",
   "posts": [
     {
       "text": "Surah Adh-Dhariyat swears by natural elements to affirm the reality of Judgment Day. It contrasts the reward of the righteous with the punishment of disbelievers and includes the stories of Ibrahim (AS) and Lut’s (AS) people. The surah urges reflection on Allah’s signs and the inevitability of resurrection."
     }
   ]
 },
 {
   "surah": "52. At-Tur",
   "posts": [
     {
       "text": "Surah At-Tur warns of the punishment awaiting disbelievers and describes the bliss of Paradise for the righteous. It addresses objections to the Prophet’s (PBUH) message and affirms the truth of the Quran. The chapter encourages patience and reminds of the certainty of the Hereafter."
     }
   ]
 },
 {
   "surah": "53. An-Najm",
   "posts": [
     {
       "text": "Surah An-Najm highlights the authenticity of the Prophet’s (PBUH) revelation through the angel Jibreel. It refutes idol worship and emphasizes Allah’s sovereignty. The chapter urges submission and awe of divine power, ending with a call to prostration in reverence."
     }
   ]
 },
 {
   "surah": "54. Al-Qamar",
   "posts": [
     {
       "text": "Surah Al-Qamar opens with the splitting of the moon, a miracle denied by disbelievers. It recounts the destruction of past nations like Nuh (AS), Aad, Thamud, and Lut (AS) for rejecting their prophets. Each story ends with a reminder of the Quran’s ease for remembrance."
     }
   ]
 },
 {
   "surah": "55. Ar-Rahman",
   "posts": [
     {
       "text": "Surah Ar-Rahman, often called the 'Bride of the Quran', lists Allah’s countless blessings and repeatedly asks, “Which of your Lord’s favours will you deny?” It contrasts the fate of the righteous and the sinful, concluding with the grandeur of Paradise for those who are mindful of their Lord."
     }
   ]
 },
 {
   "surah": "56. Al-Waqi’ah",
   "posts": [
     {
       "text": "Surah Al-Waqi’ah just like the previous chapter classifies people into three groups on Judgment Day and discusses how Allah's blessings are taken for granted. These blessings should be seen as proof of His ability to raise the dead for judgment. It also makes references to the creation of the human race, the divine nature of the Quran, and the horrors of the apocalypse. The last verse of this surah glorifies Allah, the most Powerful and Great."
     }
   ]
 },
 {
   "surah": "57. Al-Hadid",
   "posts": [
     {
       "text": "Surah Al-Hadid, named after the reference to iron in verse 25, invites believers to strive for Allah's cause and spend in His Way. It strongly emphasizes Allah's knowledge and power, highlighting His ability to revive faith in the hearts of believers and the earth after its death. It also advises believers on destiny and the life of this world while warning hypocrites of their evil fate. It briefly mentions some prophets before issuing a final invitation to the People of the Book to believe in Allah and His Prophet (PBUH)."
     }
   ]
 },
 {
   "surah": "58. Al-Mujadila",
   "posts": [
     {
       "text": "A companion named Khawlah Bint Tha'labah approached the Prophet (PBUH) seeking his opinion after her husband invoked an ancient form of divorce, known as Zihar. Despite the absence of a revelation on the matter, the Prophet (PBUH) confirmed the divorce based on tradition. Khawlah pleaded, highlighting the hardship it would impose on their children. In response to her pleas, this surah was revealed, abolishing the practice of Zihar."
     }
   ]
 },
 {
   "surah": "59. Al-Hashr",
   "posts": [
     {
       "text": "Surah Al-Hashr derives its name from verse 2 and it recounts the expulsion of the Jewish tribe Banu An-Nadir from Madinah for conspiring with the Makkan pagans. It condemns the hypocrites for their clandestine dealings with Banu An-Nadir and provides directives on the distribution of war spoils. The surah concludes by emphasizing unwavering obedience to Almighty Allah, which is a theme that the Quran continues in the next surah."
     }
   ]
 },
 {
   "surah": "60. Al-Mumtahanah",
   "posts": [
     {
       "text": "Surah Al-Mumtahanah was revealed before the Prophet's (PBUH) conquest of Makkah, and it addresses a breach of the peace treaty at Ḥudaibiyah. It highlights the importance of loyalty to Allah and fellow believers. It also teaches believers to show courtesy to non-Muslims unless they persecute Muslims. The surah's name comes from testing women fleeing Mecca to ensure their emigration was for Islam."
     }
   ]
 },
 {
   "surah": "61. As-Saff",
   "posts": [
     {
       "text": "Surah As-Saff begins by emphasizing unity and the need for believers to stand firm like a concrete wall. It reminds Muslims of the support Prophet Musa (AS) received from his people and the aid Prophet Isa (AS) received from the disciples. The surah affirms the Prophet's (PBUH) truthfulness and asserts that his mission will succeed. Believers are invited to participate in the struggle for the truth through faith and financial contributions."
     }
   ]
 },
 {
   "surah": "62. Al-Jumu’ah",
   "posts": [
     {
       "text": "Surah Al-Jumu'ah praises Allah’s greatness and reminds believers of His favour in sending the Prophet Muhammad (PBUH) with the Qur'an. It criticizes those who fail to benefit from divine teachings and invites believers to leave off trade and assemble for Friday prayer. The surah ends by calling on believers to trust in Allah for provision rather than the material world."
     }
   ]
 },
 {
   "surah": "63. Al-Munafiqun",
   "posts": [
     {
       "text": "Surah Al-Munafiqun exposes the hypocrites, who praise the Prophet (PBUH) publicly but plot against him privately. It warns believers against letting their wealth and children distract them from remembrance of Allah. The surah closes by stressing the importance of giving charity before death and the inability to delay one’s time once the appointed term arrives."
     }
   ]
 },
 {
   "surah": "64. At-Taghabun",
   "posts": [
     {
       "text": "Surah At-Taghabun discusses belief and disbelief and highlights the inevitability of the Day of Judgement when losses and gains will be exposed. It reminds believers to trust in Allah and obey His messenger. The surah closes by encouraging believers to forgive and overlook, and to give charity for their own purification and salvation."
     }
   ]
 },
 {
   "surah": "65. At-Talaq",
   "posts": [
     {
       "text": "Surah At-Talaq lays out detailed instructions on divorce, including waiting periods, maintenance, and accommodation for women. It underscores the need for justice and respect even during separation. The surah also encourages taqwa (God-consciousness), as Allah provides a way out of every difficulty and sustains those who place their trust in Him."
     }
   ]
 },
 {
   "surah": "66. At-Tahrim",
   "posts": [
     {
       "text": "Surah At-Tahrim highlights a personal incident involving the Prophet (PBUH) and his wives, emphasizing the importance of prioritizing Allah's pleasure over personal relationships. The Surah calls on believers to protect themselves and their families from Hellfire and to sincerely repent. It ends by contrasting the examples of righteous and disbelieving women."
     }
   ]
 },
 {
   "surah": "67. Al-Mulk",
   "posts": [
     {
       "text": "Surah Al-Mulk emphasizes Allah’s authority over all creation, describing the perfection of the universe as proof of His existence. It outlines the consequences of disbelief and rewards for those who fear their Lord unseen. The chapter calls for reflection on the natural world and Allah’s complete control over life and death."
     }
   ]
 },
 {
   "surah": "68. Al-Qalam",
   "posts": [
     {
       "text": "Surah Al-Qalam begins by asserting the Prophet’s (PBUH) noble character in the face of mockery from his opponents. It presents the parable of the garden owners as a cautionary tale about ingratitude. The Surah addresses the arrogance of the disbelievers and warns them of the impending punishment should they persist in rejection."
     }
   ]
 },
 {
   "surah": "69. Al-Haqqah",
   "posts": [
     {
       "text": "Surah Al-Haqqah, meaning 'The Inevitable', discusses the fates of past nations like Thamud and ‘Ad as examples of those who denied truth. It describes the Day of Judgment in vivid detail and the differing outcomes for the righteous and the wicked. The surah ends by affirming the divine origin of the Quran."
     }
   ]
 },
 {
   "surah": "70. Al-Ma’arij",
   "posts": [
     {
       "text": "Surah Al-Ma’arij discusses the Day of Judgment and the qualities of those who will be saved. It portrays the panic of the disbelievers on that day and contrasts it with the composure of the believers. The Surah outlines traits of the righteous including prayer, charity, and truthfulness, warning against the greedy and impatient."
     }
   ]
 },
 {
   "surah": "71. Nuh",
   "posts": [
     {
       "text": "Surah Nuh recounts the story of Prophet Nuh (AS) and his efforts to call his people to monotheism over centuries. It reflects on human arrogance and rejection of divine guidance. The Surah serves as both a warning to deniers and a consolation to the Prophet Muhammad (PBUH) regarding the stubbornness of disbelievers."
     }
   ]
 },
 {
   "surah": "72. Al-Jinn",
   "posts": [
     {
       "text": "Surah Al-Jinn reveals that some jinn heard the Quran and accepted its message, acknowledging its divine source. It emphasizes that guidance is for those who seek it and warns against attributing knowledge of the unseen to anyone besides Allah. The chapter underscores the Prophet’s (PBUH) sole role as a warner."
     }
   ]
 },
 {
   "surah": "73. Al-Muzzammil",
   "posts": [
     {
       "text": "Surah Al-Muzzammil urges the Prophet (PBUH) to stand in prayer at night to prepare spiritually for the mission ahead. It encourages patience in facing opposition and reliance on Allah. Later verses ease the Prophet’s burden, permitting flexibility in night prayer for him and the believers."
     }
   ]
 },
 {
   "surah": "74. Al-Muddathir",
   "posts": [
     {
       "text": "Surah Al-Muddathir marks one of the earliest revelations, calling the Prophet (PBUH) to arise and warn. It stresses purification, sincerity, and avoiding ostentation. The Surah describes Hell and its keepers, reminding disbelievers of their fate and the gravity of rejecting the message."
     }
   ]
 },
 {
   "surah": "75. Al-Qiyamah",
   "posts": [
     {
       "text": "Surah Al-Qiyamah powerfully affirms resurrection and accountability. It describes the stages of death and the Day of Judgment, contrasting the fates of the righteous and the wicked. The surah reminds humanity of its humble origin and urges reflection on the inevitability of divine judgment."
     }
   ]
 },
 {
   "surah": "76. Al-Insan",
   "posts": [
     {
       "text": "Surah Al-Insan reminds humans of how Allah created them, endowed them with various faculties, guided them, and granted them free will. It extensively discusses the rewards for those who choose to believe, whereas the next surah only briefly mentions it. Conversely, it briefly mentions the punishment for those who choose disbelief but details it in the next surah. The Prophet (PBUH) is also advised to remain steadfast and not yield to the deniers of Judgment Day."
     }
   ]
 },
 {
   "surah": "77. Al-Mursalat",
   "posts": [
     {
       "text": "Just like the two previous and the next two surahs, Surah Al-Mursalat emphasizes that Allah’s power to create serves as proof of His ability to resurrect the dead for judgment. It vividly depicts the horrors of the Hour and the punishment awaiting the wicked."
     }
   ]
 },
 {
   "surah": "78. An-Naba",
   "posts": [
     {
       "text": "In this Makkan surah, the arguments of those who deny the Hereafter are thoroughly refuted through a detailed examination of the marvels of Allah’s creation. These examples serve as compelling evidence of Allah’s power to resurrect the dead and justly reward each individual according to their actions."
     }
   ]
 },
 {
   "surah": "79. An-Nazi'at",
   "posts": [
     {
       "text": "In Surah An-Nazi’at, the inevitability of the Day of Judgment is underscored, emphasizing that its timing remains solely within Allah’s knowledge. By recounting the destruction of Pharaoh as a cautionary tale, the surah serves as a warning to disbelievers regarding the consequences of their rejection of divine guidance."
     }
   ]
 },
 {
   "surah": "80. Abasa",
   "posts": [
     {
       "text": "In a hadith collected by At-Tirmidhi, a blind man named “Abdullah ibn Umm Maktum”, a devout early Muslim, interrupted the Prophet (PBUH) during a discussion with an elite Makkan pagan, seeking to learn more about the faith. The Prophet (PBUH), initially preoccupied, later received a revelation admonishing him for not giving attention to Abdullah. This Makkan surah underscores the importance of attending to those who are sincere, faithful, and eager to learn."
     }
   ]
 },
 {
   "surah": "81. At-Takwir",
   "posts": [
     {
       "text": "Surah At-Takwir describes the events that will take place on the Day of Judgment. It states that everyone will face the consequences of their actions on that fateful day. It concludes by reaffirming the divine origin of the Quran and rejecting the pagan accusations of the Prophet’s (PBUH) insanity."
     }
   ]
 },
 {
   "surah": "82. Al-Infitar",
   "posts": [
     {
       "text": "This surah continues the theme of cosmic upheaval on the Day of Judgment. It calls upon humans to reflect on their creation and Allah’s continuous watch over them. Each person will be fully informed of their deeds, highlighting the inevitability of divine accountability."
     }
   ]
 },
 {
   "surah": "83. Al-Mutaffifin",
   "posts": [
     {
       "text": "Surah Al-Mutaffifin warns against fraudulent behavior and unjust dealings, particularly in business transactions. It contrasts the fate of the wicked—who will face humiliation in Hell—with that of the righteous—who will enjoy bliss in Paradise. The surah emphasizes the recording of all actions and the reality of the Hereafter."
     }
   ]
 },
 {
   "surah": "84. Al-Inshiqaq",
   "posts": [
     {
       "text": "This surah portrays the splitting of the sky as one of the signs of the Last Day. It stresses that all humans will return to Allah and be judged based on their deeds. Believers will receive their records in their right hands, while disbelievers will receive them from behind, signifying disgrace."
     }
   ]
 },
 {
   "surah": "85. Al-Buruj",
   "posts": [
     {
       "text": "Surah Al-Buruj condemns the persecution of believers and reminds that Allah is a constant witness over all events. It references the story of the 'People of the Ditch' who were martyred for their faith, serving as a reminder of the eternal justice of Allah and the ultimate triumph of the believers."
     }
   ]
 },
 {
   "surah": "86. At-Tariq",
   "posts": [
     {
       "text": "Surah At-Tariq is an early Makkan surah and it underscores the meticulous recording of our deeds by angels, a constant reminder of our ultimate reckoning. The Quran, affirmed by a solemn oath, stands as a definitive message. It assures us that the Day of Resurrection will be no more difficult for Allah than our very creation. The surah concludes with a powerful warning against defying the will of God."
     }
   ]
 },
 {
   "surah": "87. Al-A'la",
   "posts": [
     {
       "text": "This surah emphasizes the greatness of Allah and reminds the Prophet (PBUH) of Allah's promise to help him memorize the Quran. It highlights the contrasting fates of the righteous and the wicked in the Hereafter. The righteous will succeed and remember Allah's name while the disbelievers, who prefer worldly life, will face a blazing Fire."
     }
   ]
 },
 {
   "surah": "88. Al-Ghashiyah",
   "posts": [
     {
       "text": "In Surah Al-Ghashiyah, the destiny of the wrongdoers in the Hereafter is contrasted with that of the righteous. Those who reject Allah’s power are scolded for neglecting to contemplate the marvels of His creation. The surah warns them about the destiny of certain annihilated disbelievers, which is mentioned at the start of the next surah."
     }
   ]
 },
 {
   "surah": "89. Al-Fajr",
   "posts": [
     {
       "text": "In this Makkan surah, the Prophet (PBUH) receives reassurance that the Arab pagans are not exempt from the torments suffered by Aad, Thamud, and Pharaoh. It references the wicked who lack gratitude in prosperity and patience in adversity. On Judgment Day, the evildoers will regret their actions, while the righteous will be honored. This surah also criticizes those who withhold Allah’s blessings."
     }
   ]
 },
 {
   "surah": "90. Al-Balad",
   "posts": [
     {
       "text": "The central theme of this Makkan chapter, Surah Al-Balad, is the innate ability of human beings to discern between right and wrong. Paradise awaits the righteous, while Hell awaits the evildoers. This theme is reiterated in the subsequent surah."
     }
   ]
 },
 {
   "surah": "91. Ash-Shams",
   "posts": [
     {
       "text": "This Makkan surah underscores the concept of free will, emphasizing that individuals have the choice to either purify or corrupt their souls. Success awaits those who opt for purity, while destruction awaits those who choose corruption, akin to the fate of the people of Thamud. The concept of free will continues to be emphasized in the subsequent surah."
     }
   ]
 },
 {
   "surah": "92. Al-Layl",
   "posts": [
     {
       "text": "Surah Al-Layl highlights the contrast between righteous and wicked individuals. The former are promised facilitation and rewards, while the latter face hardship and Hell. The surah also teaches that generosity and faith are keys to ease, whereas miserliness and disbelief lead to destruction."
     }
   ]
 },
 {
   "surah": "93. Ad-Duhaa",
   "posts": [
     {
       "text": "This surah reassures Prophet Muhammad (PBUH) that Allah has neither forsaken nor disliked him. It reminds the Prophet of Allah’s past favours and urges him to care for the orphan, the beggar, and to proclaim Allah’s bounty."
     }
   ]
 },
 {
   "surah": "94. Ash-Sharh",
   "posts": [
     {
       "text": "Surah Ash-Sharh offers solace to the Prophet (PBUH) by reminding him of how Allah has lifted burdens, elevated his status, and ensured relief after hardship. It concludes with encouragement to remain dedicated to Allah alone."
     }
   ]
 },
 {
   "surah": "95. At-Tin",
   "posts": [
     {
       "text": "This surah reflects on the dignity of the human being, created in the best form. However, those who reject faith fall to the lowest state. The surah concludes with the promise of eternal reward for the righteous and affirms Allah’s perfect justice."
     }
   ]
 },
 {
   "surah": "96. Al-Alaq",
   "posts": [
     {
       "text": "Verses 1–5 of this surah are the first revelation of the Quran. They recount the Prophet’s (PBUH) encounter with the angel Jibreel (AS) in a cave outside Makkah, where he was instructed to read despite his illiteracy. The subsequent verses were revealed to dissuade Abu Jahl, a prominent Makkan pagan, from mistreating the Prophet (PBUH)."
     }
   ]
 },
 {
   "surah": "97. Al-Qadr",
   "posts": [
     {
       "text": "As the previous chapter marks the initial revelation, Surah Al-Qadr commemorates the magnificent night of the Quran’s descent, traditionally believed to be during the 27th night of Ramadan in 610 CE. It elucidates the purpose behind the Prophet’s (PBUH) mission with the Quran, which is expounded upon in the subsequent surah."
     }
   ]
 },
 {
   "surah": "98. Al-Bayyinah",
   "posts": [
     {
       "text": "Surah Al-Bayyinah is a Madani chapter that outlines the Prophet’s (PBUH) mission to guide the disbelievers toward worshiping Allah alone. It promises great rewards for believers and warns of severe punishment for those who persist in disbelief."
     }
   ]
 },
 {
   "surah": "99. Az-Zalzalah",
   "posts": [
     {
       "text": "This Madani surah underscores the accountability of all deeds on the Day of Judgment, a theme echoed in the following surah. It emphasizes the inevitability of being held to account for one’s actions before Allah."
     }
   ]
 },
 {
   "surah": "100. Al-Adiyat",
   "posts": [
     {
       "text": "This Makkan surah emphasizes the accountability of individuals on the Day of Judgment for their ingratitude towards Allah. It sets the stage for the depiction of the resurrection in the following surah, particularly highlighting the scene of people emerging from their graves."
     }
   ]
 },
 {
   "surah": "101. Al-Qari'ah",
   "posts": [
     {
       "text": "This Makkan surah vividly depicts the events of the Resurrection and the weighing of deeds in the Hereafter, culminating in the final destinations of Paradise or Hell. It sets the stage for understanding the reasons behind the fate of many individuals in the subsequent surah."
     }
   ]
 },
 {
   "surah": "102. At-Takathur",
   "posts": [
     {
       "text": "In Surah At-Takathur, the disbelievers are admonished for squandering their lives in pursuits that hold no significance in the Hereafter. The focus, especially, is on the accumulation of wealth, which is portrayed as a futile endeavor devoid of lasting value."
     }
   ]
 },
 {
   "surah": "103. Al-Asr",
   "posts": [
     {
       "text": "In this Makkan surah, it is emphasized that success in the eternal life to come is reserved for those who utilize their time in this fleeting world for goodness. This stands in stark contrast to the fate of the evildoers mentioned in the subsequent surah."
     }
   ]
 },
 {
   "surah": "104. Al-Humazah",
   "posts": [
     {
       "text": "This Makkan surah condemns those who engage in slander and withhold the blessings bestowed by Allah. Their punishment in Hell is likened to the ease with which Allah can destroy the evil force mentioned in the subsequent surah."
     }
   ]
 },
 {
   "surah": "105. Al-Fil",
   "posts": [
     {
       "text": "This Makkan surah narrates the story of Abraha Al-Habashi, who led a mighty army to destroy the Kaaba in 570 C.E. but was thwarted by divine intervention. It is widely believed that the Prophet Muhammad (PBUH) was born in the same year."
     }
   ]
 },
 {
   "surah": "106. Quraysh",
   "posts": [
     {
       "text": "Surah Quraysh follows the narrative of the previous chapter, emphasizing the importance of gratitude and devotion to Allah alone for saving the Kaaba from the Army of the Elephant. It serves as a warning against unfaithfulness to Allah and mistreatment of the vulnerable, themes further elaborated upon in the next surah."
     }
   ]
 },
 {
   "surah": "107. Al-Ma'un",
   "posts": [
     {
       "text": "This Makkan surah criticizes those who neglect the prayer, act hypocritically, and show no concern for the needy and orphans. It serves as a wake-up call, stressing that true religiosity is reflected in one’s social conduct and compassion for others."
     }
   ]
 },
 {
   "surah": "108. Al-Kawthar",
   "posts": [
     {
       "text": "Surah Al-Kawthar was revealed to reassure the Prophet (PBUH). Due to the loss of his sons in childhood, an infamous Makkan pagan, Al-As ibn Wail, mocked Prophet Muhammad (PBUH) by saying he would be forgotten without a son to carry on his name. However, today “Muḥammad” is the most common name globally, while Al-As is rarely mentioned. The Prophet (PBUH) is commanded to devote himself solely to Allah, a theme continued in the next surah."
     }
   ]
 },
 {
   "surah": "109. Al-Kafirun",
   "posts": [
     {
       "text": "Surah Al-Kafirun was revealed in response to the pagans' proposal to worship Allah alone for one year in exchange for the Prophet (PBUH) worshiping their multiple gods for a year. In it, the Prophet (PBUH) firmly asserts his dedication solely to the worship of Allah until his last breath, a sentiment echoed in the next surah."
     }
   ]
 },
 {
   "surah": "110. An-Nasr",
   "posts": [
     {
       "text": "Surah An-Nasr focuses on the victory, the expansion of the Muslim community, and the need for seeking forgiveness. The next surah, Surah Al-Masad, deals with the fate of those who opposed the Prophet (PBUH)."
     }
   ]
 },
 {
   "surah": "111. Al-Masad",
   "posts": [
     {
       "text": "This Makkan surah serves as a warning to Abu Lahab, the uncle of the Prophet (PBUH), and his wife Um Jamil, who abused the Prophet (PBUH) and denied the One True God. The attributes of the One True God are described in the next surah."
     }
   ]
 },
 {
   "surah": "112. Al-Ikhlas",
   "posts": [
     {
       "text": "In Surah Al-Ikhlas, the concepts of Trinity, idolatry, atheism, and polytheism are refuted. It highlights the necessity of wholehearted devotion to the only True God (Allah). These themes are further elaborated in the next two surahs."
     }
   ]
 },
 {
   "surah": "113. Al-Falaq",
   "posts": [
     {
       "text": "Surah Al-Falaq was revealed during the early years of the Prophet Muhammad's (PBUH) mission. This surah is renowned for its themes of seeking refuge and protection from various forms of evil and harm. It also highlights reliance on Allah as the ultimate protector and guardian against all dangers, both visible and invisible."
     }
   ]
 },
 {
   "surah": "114. An-Nas",
   "posts": [
     {
       "text": "Surah An-Nas is the last chapter of the Holy Quran and it serves as a supplication seeking refuge in Allah from the evil of humans and jinn. Similar to Surah Al-Falaq, it emphasizes Allah's sovereignty and the importance of seeking His protection against all forms of harm and evil. Surah Al-Nas completes the Quran by reinforcing the central theme of monotheism and submission to Allah's will, mirroring the message conveyed in the opening chapter of the Quran."
     }
   ]
 }
]



